{"name":"Aboleth, Nihilith","size":"Large","subtype":"","group":null,"alignment":"chaotic evil","armor_class":17,"armor_desc":"natural armor","hit_points":135,"hit_dice":"18d10 + 36","speed":{"hover":true,"walk":10,"swim":40,"fly":50},"strength":21,"dexterity":9,"constitution":15,"intelligence":18,"wisdom":15,"charisma":18,"strength_save":null,"dexterity_save":null,"constitution_save":6,"intelligence_save":8,"wisdom_save":6,"charisma_save":null,"perception":10,"skills":{"history":12,"perception":10},"damage_vulnerabilities":"","damage_resistances":"acid, fire, lightning, thunder (only when in ethereal form); bludgeoning, piercing and slashing from nonmagical weapons","damage_immunities":"cold, necrotic, poison; bludgeoning, piercing and slashing from nonmagical weapons (only when in ethereal form)","condition_immunities":"charmed, exhaustion, frightened, grappled, paralyzed, petrified, poisoned, prone, restrained","senses":"darkvision 120 ft., passive Perception 20","languages":"Void Speech, telepathy 120 ft.","challenge_rating":"12","actions":[{"name":"Multiattack","desc":"The nihileth makes three tentacle attacks or three withering touches, depending on what form it is in."},{"name":"Tentacle (Material Form Only)","desc":"Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 12 (2d6 + 5) bludgeoning damage. If the target creature is hit, it must make a successful DC 14 Constitution saving throw or become diseased. The disease has no effect for 1 minute; during that time, it can be removed by lesser restoration or comparable magic. After 1 minute, the diseased creature's skin becomes translucent and slimy. The creature cannot regain hit points unless it is entirely underwater, and the disease can only be removed by heal or comparable magic. Unless the creature is fully submerged or frequently doused with water, it takes 6 (1d12) acid damage every 10 minutes. If a creature dies while diseased, it rises in 1d6 rounds as a nihilethic zombie. This zombie is permanently dominated by the nihileth.","attack_bonus":9,"damage_dice":"2d6+5"},{"name":"Withering Touch (Ethereal Form Only)","desc":"Melee Weapon Attack: +8 to hit, reach 10 ft., one creature. Hit: 14 (3d6+4) necrotic damage.","attack_bonus":8,"damage_dice":"3d6+4"},{"name":"Form Swap","desc":"As a bonus action, the nihileth can alter between its material and ethereal forms at will."},{"name":"Tail (Material Form Only)","desc":"Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 15 (3d6 + 5) bludgeoning damage.","attack_bonus":9,"damage_dice":"3d6+5"},{"name":"Enslave (3/day)","desc":"The nihileth targets one creature it can see within 30 ft. of it. The target must succeed on a DC 14 Wisdom saving throw or be magically charmed by the nihileth until the nihileth dies or until it is on a different plane of existence from the target. The charmed target is under the nihileth's control and can't take reactions, and the nihileth and the target can communicate telepathically with each other over any distance. Whenever the charmed target takes damage, the target can repeat the saving throw. On a success, the effect ends. No more than once every 24 hours, the target can also repeat the saving throw when it is at least 1 mile away from the nihileth."}],"reactions":[{"name":"Void Body","desc":"The nihileth can reduce the damage it takes from a single source to 0. Radiant damage can only be reduced by half."}],"legendary_desc":"A nihileth can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The nihileth regains spent legendary actions at the start of its turn.","legendary_actions":[{"name":"Detect","desc":"The aboleth makes a Wisdom (Perception) check."},{"name":"Tail Swipe","desc":"The aboleth makes one tail attack."},{"name":"Psychic Drain (Costs 2 Actions)","desc":"One creature charmed by the aboleth takes 10 (3d6) psychic damage, and the aboleth regains hit points equal to the damage the creature takes."}],"special_abilities":[{"name":"Undead Fortitude","desc":"If damage reduces the nihileth to 0 hit points, it must make a Constitution saving throw with a DC of 5 + the damage taken, unless the damage is radiant or from a critical hit. On a success, the nihileth drops to 1 hit point instead."},{"name":"Dual State","desc":"A nihileth exists upon the Material Plane in one of two forms and can switch between them at will. In its material form, it has resistance to damage from nonmagical weapons. In its ethereal form, it is immune to damage from nonmagical weapons. The creature's ethereal form appears as a dark purple outline of its material form, with a blackish-purple haze within. A nihileth in ethereal form can move through air as though it were water, with a fly speed of 40 feet."},{"name":"Void Aura","desc":"The undead nihileth is surrounded by a chilling cloud. A living creature that starts its turn within 5 feet of a nihileth must make a successful DC 14 Constitution saving throw or be slowed until the start of its next turn. In addition, any creature that has been diseased by a nihileth or a nihilethic zombie takes 7 (2d6) cold damage every time it starts its turn within the aura."},{"name":"Infecting Telepathy","desc":"If a creature communicates telepathically with the nihileth, or uses a psychic attack against it, the nihileth can spread its disease to the creature. The creature must succeed on a DC 14 Wisdom save or become infected with the same disease caused by the nihileth's tentacle attack."},{"name":"Nihileth 's Lair","desc":"on initiative count 20 (losing initiative ties), the nihileth can take a lair action to create one of the magical effects as per an aboleth, or the void absorbance action listed below. The nihileth cannot use the same effect two rounds in a row.\n\n- Void Absorbance: A nihileth can pull the life force from those it has converted to nihilethic zombies to replenish its own life. This takes 18 (6d6) hit points from zombies within 30 feet of the nihileth, spread evenly between the zombies, and healing the nihileth. If a zombie reaches 0 hit points from this action, it perishes with no Undead Fortitude saving throw."},{"name":"Regional Effects","desc":"the regional effects of a nihileth’s lair are the same as that of an aboleth, except as following.\n\n- Water sources within 1 mile of a nihileth’s lair are not only supernaturally fouled but can spread the disease of the nihileth. A creature who drinks from such water must make a successful DC 14 Constitution check or become infected."}],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"aboleth-nihilith","type":"undead"}