{"name":"Accursed Defiler","size":"Medium","subtype":"","group":null,"alignment":"neutral evil","armor_class":12,"armor_desc":"","hit_points":75,"hit_dice":"10d8 + 30","speed":{"walk":30},"strength":19,"dexterity":14,"constitution":17,"intelligence":6,"wisdom":15,"charisma":14,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":4,"skills":{"perception":4,"stealth":4},"damage_vulnerabilities":"","damage_resistances":"necrotic; bludgeoning, piercing, and slashing from nonmagical weapons","damage_immunities":"poison","condition_immunities":"charmed, exhaustion, frightened, poisoned","senses":"darkvision 60 ft., passive Perception 14","languages":"understands an ancient language, but can't speak","challenge_rating":"4","actions":[{"name":"Multiattack","desc":"The accursed defiler makes two slam attacks."},{"name":"Slam","desc":"Melee Weapon Attack: +6 to hit, reach 5 ft., one creature. Hit: 11 (2d6 + 4) bludgeoning damage. If a creature is hit by this attack twice in the same round (from the same or different accursed defilers), the target must make a DC 13 Constitution saving throw or gain one level of exhaustion.","attack_bonus":6,"damage_dice":"2d6"},{"name":"Sandslash (Recharge 5-6)","desc":"As an action, the accursed defiler intensifies the vortex of sand that surrounds it. All creatures within 10 feet of the accursed defiler take 21 (6d6) slashing damage, or half damage with a successful DC 14 Dexterity saving throw."}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Cursed Existence","desc":"When it drops to 0 hit points in desert terrain, the accursed defiler's body disintegrates into sand and a sudden parched breeze. However, unless it was killed in a hallowed location, with radiant damage, or by a blessed creature, the accursed defiler reforms at the next sundown 1d100 miles away in a random direction."},{"name":"Sand Shroud","desc":"A miniature sandstorm constantly whirls around the accursed defiler in a 10-foot radius. This area is lightly obscured to creatures other than an accursed defiler. Wisdom (Survival) checks made to follow tracks left by an accursed defiler or other creatures that were traveling in its sand shroud are made with disadvantage."}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"accursed-defiler","type":"undead"}