{"name":"Al-Aeshma Genie","size":"Large","subtype":"","group":null,"alignment":"chaotic evil","armor_class":17,"armor_desc":"natural armor","hit_points":172,"hit_dice":"15d10 + 90","speed":{"hover":true,"walk":30,"fly":90},"strength":21,"dexterity":15,"constitution":22,"intelligence":15,"wisdom":16,"charisma":20,"strength_save":null,"dexterity_save":6,"constitution_save":null,"intelligence_save":null,"wisdom_save":7,"charisma_save":9,"perception":null,"skills":{},"damage_vulnerabilities":"","damage_resistances":"","damage_immunities":"lightning, thunder","condition_immunities":"","senses":"darkvision 120 ft., passive Perception 13","languages":"Auran, Common, Ignan","challenge_rating":"9","actions":[{"name":"Multiattack","desc":"The al-Aeshma makes three scimitar attacks."},{"name":"Scimitar","desc":"Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 12 (2d6 + 5) slashing damage, plus 3 (1d6) necrotic damage.","attack_bonus":9,"damage_dice":"2d6"},{"name":"Dust Devil","desc":"A 5-foot-radius, 30-foot-tall cylinder of sand magically forms on a point the al-Aeshma can see within 120 feet of it. The dust devil lasts as long as the al-Aeshma maintains concentration (as if a spell). Any creature but the al-Aeshma that enters the dust devil must succeed on a DC 18 Strength saving throw or be restrained by it; any number of creatures may be restrained this way. At the start of a restrained creature's turn, it takes 7 (2d6) slashing damage plus 7 (2d6) necrotic damage. The al-Aeshma can move the dust devil up to 60 feet as an action; restrained creatures move with it. The dust devil ends if the al-Aeshma loses sight of it. A creature can use its action to free a creature restrained by the dust devil, including itself, by making a DC 18 Strength check. If the check succeeds, it moves to the nearest space outside the dust devil."}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Air Hatred","desc":"The al-Aeshma has advantage on attack rolls against airborne opponents."},{"name":"Bound","desc":"The al-Aeshma must always be anchored to the earth. Even in gaseous form or sandstorm form, part of it must always touch the ground. The al-Aeshma's maximum altitude while flying is 50 ft. If it is not touching, it loses its immunities and gains vulnerability to lightning and thunder."},{"name":"Elemental Demise","desc":"When an al-Aeshma dies, its body disintegrates into a swirling spray of coarse sand, leaving behind equipment it was wearing or carrying."},{"name":"Ill Wind","desc":"As a bonus action when in gaseous form, the al.Aeshma can befoul its space with a choking scent. When the al-Aeshma moves through another creature's space in gaseous form, the creature must succeed on a DC 18 Constitution saving throw or be incapacitated until the end of its next turn. Ill Wind lasts until the al-Aeshma leaves gaseous form or chooses to end the ability as a bonus action."},{"name":"Innate Spellcasting","desc":"the al-Aeshma's innate spellcasting ability is Charisma (spell save DC 17). It can innately cast the following spells, requiring no material components:\n\nat will: detect evil and good, detect magic, thunderwave\n\n3/day each: destroy food and water (as create food and water, but makes food and drink unpalatable), tongues, wind walk\n\n1/day each: creation, gaseous form, insect plague, invisibility, major image"},{"name":"Regeneration","desc":"The al-Aeshma regains 10 hit points at the start of its turn. If it takes fire or radiant damage, this trait doesn't function at the start of its next turn. The al.Aeshma dies only if it starts its turn at 0 hit points and doesn't regenerate."}],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"al-aeshma-genie","type":"elemental"}