{"name":"Ancient Mandriano","size":"Huge","subtype":"","group":null,"alignment":"lawful evil","armor_class":14,"armor_desc":"natural armor","hit_points":102,"hit_dice":"12d12+24","speed":{"walk":40},"strength":21,"dexterity":8,"constitution":15,"intelligence":12,"wisdom":10,"charisma":7,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":3,"skills":{"athletics":8,"perception":3,"stealth":2},"damage_vulnerabilities":"fire","damage_resistances":"necrotic; bludgeoning, piercing, and slashing from nonmagical attacks","damage_immunities":"poison","condition_immunities":"exhaustion, poisoned","senses":"passive Perception 13","languages":"","challenge_rating":"8","actions":[{"desc":"The ancient mandriano makes two swipe attacks.","name":"Multiattack"},{"attack_bonus":8,"damage_dice":"3d6+5","desc":"Melee Weapon Attack: +8 to hit, reach 15 ft., one target. Hit: 15 (3d6 + 5) slashing damage. If the target is Medium or smaller, it is grappled (escape DC 16). Until this grapple ends, the target is restrained. It can grapple up to three creatures.","name":"Swipe"},{"desc":"The mandriano drains the essence of one grappled target. The target must make a DC 16 Constitution saving throw, taking 21 (6d6) necrotic damage on a failed save, or half as much damage on a successful one. The target’s hp maximum is reduced by an amount equal to the necrotic damage taken, and the mandriano regains hp equal to that amount. The reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hp maximum to 0. A humanoid slain in this way rises 24 hours later as a zombie or skeleton under the mandriano’s control, unless the humanoid is restored to life or its body is destroyed. The mandriano can control up to twelve undead at one time.","name":"Consume the Spark"},{"desc":"The ancient mandriano animates one humanoid corpse within 60 feet. This works like the animate dead spell, except it only creates zombies and the zombies. The mandriano can control up to twenty zombies at one time.","name":"Call the Dead (3/Day)"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"The ancient mandriano deals double damage to objects and structures.","name":"Siege Monster"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"ancient-mandriano","type":"plant"}