{"name":"Arbeyach","size":"Large","subtype":"devil","group":null,"alignment":"lawful evil","armor_class":17,"armor_desc":"natural armor","hit_points":275,"hit_dice":"22d10 + 154","speed":{"walk":40,"burrow":20,"climb":40,"fly":80,"hover":true},"strength":22,"dexterity":20,"constitution":25,"intelligence":19,"wisdom":21,"charisma":25,"strength_save":null,"dexterity_save":12,"constitution_save":14,"intelligence_save":null,"wisdom_save":12,"charisma_save":14,"perception":12,"skills":{"deception":14,"insight":12,"perception":12,"stealth":12},"damage_vulnerabilities":"","damage_resistances":"acid, cold; bludgeoning, piercing, and slashing from nonmagical weapons that aren't silvered","damage_immunities":"fire, poison","condition_immunities":"charmed, frightened, poisoned, stunned","senses":"truesight 120 ft., passive Perception 22","languages":"Celestial, Common, Draconic, Infernal, telepathy 120 ft.","challenge_rating":"21","actions":[{"name":"Multiattack","desc":"Arbeyach makes one bite attack and two claw attacks."},{"name":"Bite","desc":"Melee Weapon Attack: +13 to hit, reach 5 ft., one target. Hit: 15 (2d8 + 6) piercing damage plus 9 (2d8) poison damage. If the target is a creature, it must succeed on a DC 22 Constitution saving throw or be cursed with Arbeyach rot. The cursed target is poisoned, can't regain hit points, its hit point maximum decreases by 13 (3d8) for every 24 hours that elapse, and vermin attack the creature on sight. If the curse reduces the target's hit point maximum to 0, the target dies and immediately transforms into a randomly chosen swarm of insects. The curse lasts until removed by the remove curse spell or comparable magic.","attack_bonus":13,"damage_dice":"2d8"},{"name":"Claw","desc":"Melee Weapon Attack: +13 to hit, reach 10 ft., one target. Hit: 10 (1d8 + 6) slashing damage plus 9 (2d8) poison damage.","attack_bonus":13,"damage_dice":"1d8"},{"name":"Vermin Breath (Recharge 5-6)","desc":"Arbeyach exhales vermin in a 120-foot line that's 10 feet wide. Each creature in the line takes 54 (12d8) poison damage, or half damage with a successful DC 22 Dexterity saving throw. Each creature that fails this saving throw must succeed on a DC 22 Constitution saving throw or be cursed with Arbeyach rot (see the Bite attack). In addition, Arbeyach summons a swarm of insects (of any type) at any point of the line. The swarm remains until destroyed, until Arbeyach dismisses it as a bonus action, or for 2 minutes. No more than five swarms of insects can be summoned at the same time."}],"reactions":"","legendary_desc":"Arbeyach can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. Arbeyach regains spent legendary actions at the start of its turn.","legendary_actions":[{"name":"Move","desc":"Arbeyach moves up to half its speed, using any movement mode it wishes."},{"name":"Poison","desc":"Arbeyach targets a creature within 120 feet. If the target isn't poisoned, it must make a DC 22 Constitution saving throw or become poisoned. The poisoned target repeats the saving throw at the end of each of its turns, ending the effect on itself on a success."},{"name":"Spell (Costs 2 Actions)","desc":"Arbeyach casts a spell."}],"special_abilities":[{"name":"Legendary Resistance (3/Day)","desc":"If Arbeyach fails a saving throw, it can choose to succeed instead."},{"name":"Magic Resistance","desc":"Arbeyach has advantage on saving throws against spells and other magical effects."},{"name":"Magic Weapons","desc":"Arbeyach's weapon attacks are magical."},{"name":"Innate Spellcasting","desc":"arbeyach's spellcasting ability is Charisma (spell save DC 22, +14 to hit with spell attacks). Arbeyach can innately cast the following spells, requiring no material components:\n\nat will: poison spray\n\n3/day each: fog cloud, stinking cloud\n\n1/day each: cloudkill, contagion, insect plague"},{"name":"Fear Aura","desc":"Any creature hostile to Arbeyach that starts its turn within 20 feet of it must make a DC 22 Wisdom saving throw, unless Arbeyach is incapacitated. On a failed save, the creature is frightened until the start of its next turn. If a creature's saving throw is successful, the creature is immune to Arbeyach's Fear Aura for the next 24 hours."},{"name":"Aura of Virulence","desc":"Creatures that would normally be resistant or immune to poison damage or the poisoned condition lose their resistance or immunity while within 120 feet of Arbeyach. All other creatures within 120 feet of Arbeyach have disadvantage on saving throws against effects that cause poison damage or the poisoned condition."},{"name":"Swarm Prince","desc":"Arbeyach can communicate with spawns of Arbeyach and all vermin and insects, including swarms and giant varieties, within 120 feet via pheromone transmission. In a hive, this range extends to cover the entire hive. This is a silent and instantaneous mode of communication that only Arbeyach, spawn of Arbeyach, insects, and vermin can understand. All these creatures follow Arbeyach's orders and will never harm the devil."}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"arbeyach","type":"fiend"}