{"name":"Arcamag","size":"Tiny","subtype":"shapechanger","group":null,"alignment":"neutral","armor_class":13,"armor_desc":"natural armor","hit_points":22,"hit_dice":"5d4+10","speed":{"fly":30,"hover":true,"walk":10},"strength":7,"dexterity":10,"constitution":15,"intelligence":5,"wisdom":12,"charisma":18,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":null,"skills":{"stealth":4},"damage_vulnerabilities":"","damage_resistances":"","damage_immunities":"","condition_immunities":"","senses":"darkvision 60 ft., passive Perception 11","languages":"understands Common but can’t speak","challenge_rating":"2","actions":[{"desc":"Melee Weapon Attack: +2 to hit, reach 5 ft., one creature that can cast spells. Hit: The arcamag attaches to the target. While attached, the arcamag doesn’t attack. Instead, it causes a handful of changes in its spellcaster host (see Changes to the Host sidebar). The arcamag can detach itself by spending 5 feet of its movement. A creature other than the host can use its action to detach the arcamag by succeeding on a DC 15 Strength check. The host can use its action to detach the arcamag only after the host has expended all of its spell slots for the day, including the extra cantrips and spell slots gained from having the arcamag attached. Doing so doesn’t require a Strength check. When the arcamag detaches itself or is detached from a host, the host takes 2 (1d4) psychic damage per spellcaster level.","name":"Attach"},{"desc":"The arcamag magically teleports up to 60 feet to an unoccupied space. If it is attached to a host when it uses this action, it automatically detaches.","name":"Teleport (1/Day)"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"While attached to a host, the arcamag has advantage on Dexterity (Stealth) checks.","name":"Camouflage"},{"desc":"The arcamag can use its action to polymorph into a small object, such as a ring, wand, orb, rod, or scroll. Its statistics are the same in each form. Any equipment it is wearing or carrying isn’t transformed. It reverts to its true form if it dies. False Appearance (Object Form Only). While motionless, the arcamag is indistinguishable from an ordinary object.","name":"Shapechanger"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"arcamag","type":"monstrosity"}