{"name":"Automata Devil","size":"Large","subtype":"devil","group":null,"alignment":"lawful evil","armor_class":17,"armor_desc":"natural armor","hit_points":168,"hit_dice":"16d10 + 80","speed":{"walk":40},"strength":24,"dexterity":17,"constitution":20,"intelligence":11,"wisdom":14,"charisma":19,"strength_save":11,"dexterity_save":7,"constitution_save":9,"intelligence_save":null,"wisdom_save":6,"charisma_save":8,"perception":null,"skills":{"athletics":11,"intimidation":8},"damage_vulnerabilities":"","damage_resistances":"cold; bludgeoning, piercing, and slashing from nonmagical weapons that aren't silvered","damage_immunities":"fire, poison","condition_immunities":"poisoned","senses":"passive Perception $1","languages":"Common, Infernal; telepathy 100 ft.","challenge_rating":"10","actions":[{"name":"Multiattack","desc":"The automata devil makes two melee attacks, using any combination of bite, claw, and whip attacks. The bite attack can be used only once per turn."},{"name":"Bite","desc":"Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 18 (2d10 + 7) slashing damage.","attack_bonus":11,"damage_dice":"2d10"},{"name":"Claw","desc":"Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 14 (2d6 + 7) slashing damage.","attack_bonus":11,"damage_dice":"2d6"},{"name":"Whip","desc":"Melee Weapon Attack: +11 to hit, reach 15 ft., one target. Hit: 11 (1d8 + 7) slashing damage and the target is grappled (escape DC 17) and restrained. Only two targets can be grappled by the automata devil at one time, and each grappled target prevents one whip from being used to attack. An individual target can be grappled by only one whip at a time. A grappled target takes 9 (2d8) piercing damage at the start of its turn.","attack_bonus":11,"damage_dice":"1d8"},{"name":"Punishing Maw","desc":"If a target is already grappled in a whip at the start of the automata devil's turn, both creatures make opposed Strength (Athletics) checks. If the grappled creature wins, it takes 9 (2d8) piercing damage and remains grappled. If the devil wins, the grappled creature is dragged into the devil's stomach maw, a mass of churning gears, razor teeth, and whirling blades. The creature takes 49 (4d20 + 7) slashing damage and is grappled, and the whip is free to attack again on the devil's next turn. The creature takes another 49 (4d20 +7) slashing damage automatically at the start of each of the automata devil's turns for as long as it remains grappled in the maw. Only one creature can be grappled in the punishing maw at a time. The automata devil can freely \"spit out\"a creature or corpse during its turn, to free up the maw for another victim."},{"name":"Fear Aura","desc":"Automata devils radiate fear in a 10-foot radius. A creature that starts its turn in the affected area must make a successful DC 16 Wisdom saving throw or become frightened. A creature that makes the save successfully cannot be affected by the same automata devil's fear aura again."}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Devil's Sight","desc":"Magical darkness doesn't impede the devil's darkvision."},{"name":"Magic Resistance","desc":"The automata devil has advantage on saving throws against spells and other magical effects."},{"name":"Innate Spellcasting","desc":"the automata devils' spellcasting ability is Charisma (spell save DC 16). It can innately cast the following spells, requiring no material components:\n\nat will: charm person, suggestion, teleport\n\n1/day each: banishing smite, cloudkill"}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"automata-devil","type":"fiend"}