{"name":"Azi Dahaka","size":"Huge","subtype":"","group":null,"alignment":"chaotic evil","armor_class":15,"armor_desc":"natural armor","hit_points":157,"hit_dice":"15d12+60","speed":{"fly":80,"walk":40},"strength":21,"dexterity":14,"constitution":19,"intelligence":14,"wisdom":13,"charisma":17,"strength_save":null,"dexterity_save":7,"constitution_save":9,"intelligence_save":null,"wisdom_save":6,"charisma_save":8,"perception":11,"skills":{"perception":11,"stealth":7},"damage_vulnerabilities":"","damage_resistances":"cold; bludgeoning, piercing, and slashing from nonmagical attacks not made with silver","damage_immunities":"lightning","condition_immunities":"","senses":"blindsight 60 ft., darkvision 120 ft., passive Perception 21","languages":"Common, Draconic, Infernal","challenge_rating":"14","actions":[{"desc":"Azi Dahaka makes three bite attacks and two claw attacks.","name":"Multiattack"},{"attack_bonus":10,"damage_dice":"1d10+5","desc":"Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 10 (1d10 + 5) piercing damage","name":"Bite"},{"desc":"Melee Weapon Attack. +10 to hit, reach 5 ft., one target. Hit: 12 (2d6 + 5) slashing damage.","name":"Claw"},{"desc":"Azi Dahaka exhales a blast of wind and lightning in a 60-foot cone. Each creature in that area must make a DC 18 Dexterity saving throw. On a failure, a target takes 22 (4d10) bludgeoning damage and 18 (4d8) lightning damage, is pushed 25 feet away from Azi Dahaka, and is knocked prone. On a success, a target takes half the bludgeoning and lightning damage and is pushed, but isn’t knocked prone. All nonmagical flames in the cone are extinguished.","name":"Storm Breath (Recharge 5-6)"}],"reactions":"","legendary_desc":"Azi Dahaka can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature’s turn. Azi Dahaka regains spent legendary actions at the start of its turn.","legendary_actions":[{"desc":"Azi Dahaka can alter the weather in a 5-mile radius centered on itself. The effect is identical to the control weather spell, except the casting time and effects are immediate. Call Lightning (Cost 2 Actions). A bolt of lightning flashes down from the clouds to a point Azi Dahaka can see within 100 feet of it. Each creature within 5 feet of that point must make a DC 20 Dexterity saving throw, taking 16 (3d10) lightning damage on a failed save, or half as much damage on a successful one.","name":"Control Weather"},{"desc":"Azi Dahaka beats its wings. Each creature within 10 feet of the dragon must succeed on a DC 20 Dexterity saving throw or take 12 (2d6 + 5) bludgeoning damage and be knocked prone. Azi Dahaka can then fly up to half its flying speed.","name":"Wing Attack (Costs 2 Actions)"}],"special_abilities":[{"desc":"If Azi Dahaka fails a saving throw, it can choose to succeed instead.","name":"Legendary Resistance (3/Day)"},{"desc":"Azi Dahaka has advantage on saving throws against spells and other magical effects.","name":"Magic Resistance"},{"desc":"Azi Dahaka’s three heads grant it advantage on saving throws against being blinded, charmed, deafened, frightened, stunned, and knocked unconscious.","name":"Multiple Heads"},{"desc":"Azi Dahaka gets two extra reactions that can be used only for opportunity attacks.","name":"Reactive Heads"},{"desc":"A creature that hits Azi Dahaka with a melee attack while within 5 feet takes 4 (1d8) piercing damage and 4 (1d8) poison damage as the dragon’s blood becomes biting and stinging vermin.","name":"Vermin Blood"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"azi-dahaka","type":"dragon"}