{"name":"Blood Elemental","size":"Large","subtype":"","group":null,"alignment":"neutral","armor_class":14,"armor_desc":"natural armor","hit_points":95,"hit_dice":"10d10+40","speed":{"walk":30},"strength":16,"dexterity":13,"constitution":18,"intelligence":5,"wisdom":10,"charisma":5,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":null,"skills":{},"damage_vulnerabilities":"poison","damage_resistances":"acid, fire; bludgeoning, piercing, and slashing from nonmagical attacks","damage_immunities":"necrotic, psychic","condition_immunities":"exhaustion, grappled, paralyzed, petrified, poisoned, prone, restrained, unconscious","senses":"darkvision 60 ft., passive Perception 10","languages":"Primordial","challenge_rating":"5","actions":[{"desc":"The elemental makes two slam attacks.","name":"Multiattack"},{"attack_bonus":6,"damage_dice":"2d8+3","desc":"Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 12 (2d8 + 3) bludgeoning damage.","name":"Slam"},{"desc":"Each creature in the elemental’s space must make a DC 15 Constitution saving throw. On a failure, a creature takes 10 (3d6) necrotic damage and, if it is Large or smaller, it is grappled (escape DC 13). A grappled creature is restrained and unable to breathe. If the saving throw is successful, the creature is pushed out of the elemental’s space. The elemental can grapple one Large creature or up to two Medium or smaller creatures at one time.\n\nAt the start of the elemental’s turn, each target grappled by it takes 10 (3d6) necrotic damage. A creature within 5 feet of the elemental can use its action to make a DC 15 Strength check, freeing a grappled creature on a success. When Blood Drain deals 30 or more necrotic damage, the elemental grows in size as though affected by an enlarge/reduce spell. This increase in size lasts until the blood elemental finishes a long rest.","name":"Blood Drain (Recharge 4-6)"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"Each time the elemental takes cold damage, its speed is reduced by 10 feet until the end of its next turn.","name":"Coagulate"},{"desc":"If the blood elemental becomes entirely submerged in water, it dissipates and dies instantly.","name":"Destroyed by Water"},{"desc":"The elemental can enter a hostile creature’s space and stop there. It can move through a space as narrow as 1 inch wide without squeezing.","name":"Liquid Form"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"blood-elemental","type":"elemental"}