{"name":"Bloody Bones","size":"Medium","subtype":"","group":null,"alignment":"chaotic evil","armor_class":13,"armor_desc":"natural armor","hit_points":55,"hit_dice":"10d8+10","speed":{"walk":30},"strength":16,"dexterity":12,"constitution":12,"intelligence":6,"wisdom":10,"charisma":10,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":null,"skills":{"deception":4,"stealth":3},"damage_vulnerabilities":"","damage_resistances":"","damage_immunities":"","condition_immunities":"","senses":"darkvision 60 ft., passive Perception 11","languages":"none, but can speak through the use of its Horrific Imitation trait","challenge_rating":"3","actions":[{"desc":"The bloody bones makes two claw attacks. It can use its Dark Stare in place of one claw attack.","name":"Multiattack"},{"attack_bonus":5,"damage_dice":"2d4+3","desc":"Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 8 (2d4 + 3) slashing damage.","name":"Claw"},{"desc":"The bloody bones stares balefully at one creature it can see within 60 feet. That creature must succeed on a DC 13 Wisdom saving throw or have disadvantage on all attacks until the end of its next turn.","name":"Dark Stare"}],"reactions":[{"desc":"When it is hit by an attack, the bloody bones regains 5 (1d10) hit points and has resistance to that damage type until the end of its next turn as life-giving blood pours from the top of its skull.","name":"Its Crown Runs Red"}],"legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"Any creature hostile to the bloody bones that starts its turn within 10 feet of the bloody bones must succeed on a DC 13 Wisdom saving throw or be frightened until the end of its next turn. If a creature’s saving throw is successful, the creature is immune to the bloody bones’ Horrifying Aura for the next 24 hours.","name":"Horrifying Aura"},{"desc":"The bloody bones chooses one creature it can see. It moves, acts, and speaks in a macabre imitation of the creature. Its utterances are nonsense, and it can’t understand the languages of its chosen target. It maintains this imitation until it dies. A creature that hears and sees the bloody bones can tell it is performing an imitation with a successful DC 14 Wisdom (Insight) check.","name":"Horrific Imitation"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"bloody-bones","type":"monstrosity"}