{"name":"Bone Crab","size":"Small","subtype":"","group":null,"alignment":"neutral","armor_class":13,"armor_desc":"natural armor","hit_points":33,"hit_dice":"6d6 + 12","speed":{"walk":20,"swim":10},"strength":10,"dexterity":14,"constitution":14,"intelligence":1,"wisdom":12,"charisma":4,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":3,"skills":{"perception":3,"stealth":4},"damage_vulnerabilities":"","damage_resistances":"bludgeoning","damage_immunities":"","condition_immunities":"","senses":"darkvision 60 ft., passive Perception 13","languages":"-","challenge_rating":"1/2","actions":[{"name":"Multiattack","desc":"The bone crab makes two claw attacks."},{"name":"Claw","desc":"Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 9 (2d6 + 2) slashing damage.","attack_bonus":4,"damage_dice":"2d6"},{"name":"White Ghost Shivers","desc":"A living creature that is injured by or makes physical contact with a creature carrying the white ghost shivers must succeed on a DC 11 Constitution saving throw at the end of the encounter to avoid becoming infected. This disease manifests after 24 hours, beginning as a mild chill, but increasingly severe after a day, accompanied by a fever. Hallucinations are common, and the fright they induce lends the disease its name. At onset, the infected creature gains two levels of exhaustion that cannot be removed until the disease is cured by lesser restoration, comparable magic, or rest. The infected creature makes another DC 11 Constitution saving throw at the end of each long rest; a successful save removes one level of exhaustion. If the saving throw fails, the disease persists. If both levels of exhaustion are removed by successful saving throws, the victim has recovered naturally."}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Amphibious","desc":"The bone crab can breathe air and water."},{"name":"Bone Camouflage","desc":"A bone crab has advantage on Dexterity (Stealth) checks while it's among bones."},{"name":"Hive Mind","desc":"A bone crab can communicate perfectly with all other bone crabs within 100 feet of it. If one is aware of danger, they all are."},{"name":"Leap","desc":"Bone crabs have incredibly powerful legs and can leap up to 10 feet straight ahead or backward as part of its movement; this counts as withdraw action when moving away from a foe."}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"bone-crab","type":"beast"}