{"name":"Bonepowder Ghoul","size":"Small","subtype":"","group":null,"alignment":"neutral evil","armor_class":18,"armor_desc":"natural armor","hit_points":195,"hit_dice":"26d6 + 104","speed":{"walk":30},"strength":10,"dexterity":20,"constitution":18,"intelligence":19,"wisdom":15,"charisma":18,"strength_save":null,"dexterity_save":9,"constitution_save":8,"intelligence_save":null,"wisdom_save":6,"charisma_save":8,"perception":6,"skills":{"perception":6,"stealth":9},"damage_vulnerabilities":"","damage_resistances":"cold, lightning; bludgeoning, piercing, and slashing from nonmagical weapons","damage_immunities":"necrotic, poison","condition_immunities":"charmed, exhaustion, frightened, paralyzed, poisoned","senses":"darkvision 60 ft., passive Perception 16","languages":"Common, Darakhul, Draconic, Dwarvish","challenge_rating":"12","actions":[{"name":"Bite","desc":"Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 18 (3d8 + 5) plus 1d4 Strength damage, and the target must succeed on a DC 17 Constitution saving throw or be paralyzed for 1d4 + 1 rounds. If the target creature is humanoid, it must succeed on a second DC 19 Constitution saving throw or contract darakhul fever.","attack_bonus":9,"damage_dice":"3d8"},{"name":"Gravedust","desc":"A bonepowder ghoul can project a 40-ft. cone of grave dust. All targets within the area must make a DC 19 Dexterity saving throw to avoid taking 4d8 necrotic damage, and must make a second DC 17 Constitution saving throw to avoid being infected with darakhul fever."},{"name":"Whirlwind (Recharge 5-6)","desc":"A bonepowder ghoul can generate a whirlwind of bones and teeth. All creatures within a 20-foot cube take 66 (12d10) slashing damage and are drained of 1d6 Strength; a successful DC 17 Dexterity saving throw reduces damage to half and negates the Strength loss. The whirlwind dissipates after one round."}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Amorphous","desc":"The bonepowder ghoul can move through a space as narrow as 1 inch wide without squeezing."},{"name":"Coalesce","desc":"Whenever a bonepowder ghoul drains life force from victims with Gravedust, it can use that energy transform its shape into a more solid form and maintain it. The new form is Small and semi-transparent but roughly the shape of a normal ghoul. In this form, the ghoul isn't amorphous and can't form a whirlwind, but it can speak normally and manipulate objects. The altered form lasts for 1 minute for every point of necrotic damage it delivered against living foes."},{"name":"Turning Defiance","desc":"The bonepowder ghoul and any other ghouls within 30 feet of it have advantage on saving throws against effects that turn undead."},{"name":"Innate Spellcasting","desc":"the bonepowder ghoul's innate spellcasting ability is Charisma (spell save DC 18, +10 to hit with spell attacks). It can innately cast the following spells, requiring no material components:\n\nat will: chill touch, darkness, dispel magic, ray of enfeeblement\n\n3/day: blindness/deafness, circle of death (7th level; 10d6)\n\n1/day: finger of death"}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"bonepowder-ghoul","type":"undead"}