{"name":"Chelicerae","size":"Large","subtype":"","group":null,"alignment":"neutral evil","armor_class":16,"armor_desc":"natural armor","hit_points":153,"hit_dice":"18d10 + 54","speed":{"walk":40,"climb":30},"strength":22,"dexterity":17,"constitution":17,"intelligence":14,"wisdom":15,"charisma":14,"strength_save":null,"dexterity_save":6,"constitution_save":null,"intelligence_save":null,"wisdom_save":5,"charisma_save":5,"perception":5,"skills":{"acrobatics":6,"athletics":9,"perception":5,"stealth":6},"damage_vulnerabilities":"","damage_resistances":"","damage_immunities":"poison","condition_immunities":"charmed, poisoned","senses":"darkvision 60 ft., passive Perception 15","languages":"-","challenge_rating":"7","actions":[{"name":"Multiattack","desc":"The chelicerae makes one bite attack and two claw attacks."},{"name":"Bite","desc":"Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 17 (2d10 + 6) piercing damage, and the target is grappled (escape DC 16). The target must also make a successful DC 16 Constitution saving throw or become poisoned. While poisoned this way, the target is unconscious and takes 1d4 Strength damage at the start of each of its turns. The poisoning ends after 4 rounds or when the target makes a successful DC 16 Constitution save at the end of its turn.","attack_bonus":9,"damage_dice":"2d10"},{"name":"Claw","desc":"Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 15 (2d8 + 6) slashing damage.","attack_bonus":9,"damage_dice":"2d8"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Magic Resistance","desc":"The chelicerae has advantage on saving throws against spells and other magical effects."},{"name":"Spellcasting","desc":"the chelicerae is an 8th-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 13, +5 to hit with spell attacks). It requires no material components to cast its spells. The chelicerae has the following wizard spells prepared:\n\ncantrips: acid splash, mage hand, minor illusion, true strike\n\n1st level: burning hands, detect magic, expeditious retreat, ray of sickness\n\n2nd level: hold person, invisibility, scorching ray\n\n3rd level: animate dead, haste, lightning bolt\n\n4th level: phantasmal killer"},{"name":"Siphon Spell Slots","desc":"The chelicerae cannot replenish its spells naturally. Instead, it uses grappled spellcasters as spell reservoirs, draining uncast spells to power its own casting. Whenever the chelicerae wishes to cast a spell, it consumes a number of spell slots from its victim equal to the spell slots necessary to cast the spell. If the victim has too few spell slots available, the chelicerae cannot cast that spell. The chelicerae can also draw power from drained spellcasters or creatures without magic ability. It can reduce a grappled creature's Wisdom by 1d4, adding 2 spell slots to its spell reservoir for every point lowered. A creature reduced to 0 Wisdom is unconscious until it regains at least one point, and can't offer any more power. A creature regains all lost Wisdom when it finishes a long rest."},{"name":"Spider Climb","desc":"Chelicerae can climb difficult surfaces, including upside down on ceilings, without requiring an ability check."}],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"chelicerae","type":"aberration"}