{"name":"Chronalmental","size":"Large","subtype":"","group":null,"alignment":"unaligned","armor_class":17,"armor_desc":"natural armor","hit_points":152,"hit_dice":"16d10 + 64","speed":{"walk":30},"strength":1,"dexterity":20,"constitution":19,"intelligence":9,"wisdom":13,"charisma":6,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":null,"skills":{},"damage_vulnerabilities":"","damage_resistances":"","damage_immunities":"poison; bludgeoning, piercing, and slashing from nonmagical weapons","condition_immunities":"exhaustion, paralyzed, petrified, poisoned, unconscious","senses":"darkvision 60 ft., passive Perception 11","languages":"Celestial, Infernal","challenge_rating":"8","actions":[{"name":"Multiattack","desc":"The chronalmental makes 1d4 + 1 slam attacks."},{"name":"Slam","desc":"Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 16 (2d10 + 5) bludgeoning damage.","attack_bonus":8,"damage_dice":"2d10"},{"name":"Steal Time (1/Day)","desc":"The chronalmental targets one creature it can see within 30 feet of it. The targeted creature must make a DC 16 Wisdom saving throw. On a failed saving throw, the chronalmental draws some of the creature's time into itself and gains +10 to its position in initiative order. In addition, the target's speed is reduced by half, it can't take reactions, and it can take either an action or a bonus action on its turn, but not both. While it is stealing time, the chronalmental's speed increases by 30 feet, and when it takes the multiattack action, it can make an additional slam attack. The targeted creature can repeat the saving throw at the end of each of its turns, ending the effect on a success."},{"name":"Displace (Recharge 5-6)","desc":"The chronalmental targets one creature it can see within 30 feet of it. The target must succeed on a DC 16 Wisdom saving throw or be magically shunted outside of time. The creature disappears for 1 minute. As an action, the displaced creature can repeat the saving throw. On a success, the target returns to its previously occupied space, or the nearest unoccupied space."}],"reactions":[{"name":"Step Between Seconds (Recharge 4-6)","desc":"When a creature the chronalmental can see moves within 5 feet of it, the chronalmental can shift itself to a place it occupied in the past, teleporting up to 60 feet to an unoccupied space, along with any equipment it is wearing or carrying."}],"legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Temporal Body","desc":"When a chronalmental is subjected to a slow spell, haste spell, or similar effect, it automatically succeeds on the saving throw and regains 13 (3d8) hit points."}],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"chronalmental","type":"elemental"}