{"name":"Cipactli","size":"Medium","subtype":"demon","group":null,"alignment":"chaotic evil","armor_class":15,"armor_desc":"natural armor","hit_points":78,"hit_dice":"12d8+24","speed":{"swim":30,"walk":20},"strength":16,"dexterity":14,"constitution":14,"intelligence":10,"wisdom":10,"charisma":10,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":null,"skills":{"stealth":5},"damage_vulnerabilities":"fire","damage_resistances":"lightning","damage_immunities":"cold, poison","condition_immunities":"poisoned","senses":"darkvision 60 ft., passive Perception 10","languages":"Primordial","challenge_rating":"5","actions":[{"desc":"The cipactli makes two bite attacks. If both attacks hit a Medium or smaller target, the target is grappled (escape DC 14), and the cipactli uses its Devouring Embrace.","name":"Multiattack"},{"desc":"Melee Weapon Attack. +6 to hit, reach 5 ft., one target. Hit: 7 (1d8+ 3) piercing damage.","name":"Bite"},{"desc":"The cipactli devours a Medium or smaller creature grappled by it. The devoured target is blinded, restrained, it has total cover against attacks and other effects outside the cipactli, and it takes 14 (4d6) piercing damage at the start of each of the cipactli’s turns as the fiend’s lesser mouths slowly consume it.\n\nIf the cipactli moves, the devoured target moves with it. The cipactli can only devour one target at a time. A creature, including the devoured target, can take its action to pry the devoured target out of the cipactli’s many jaws by succeeding on a DC 14 Strength check.","name":"Devouring Embrace"},{"desc":"A cipactli sings a soporific, primordial song of eternal rest and divine repose from its many mouths. Each creature within 100 feet of the cipactli that can hear the song must succeed on a DC 14 Charisma saving throw or fall asleep and remain unconscious for 10 minutes. A creature awakens if it takes damage or another creature takes an action to wake it. This song has no effect on constructs and undead.","name":"Ancient Lullaby (Recharge 5-6)"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"The cipactli can breathe air and water.","name":"Amphibious"},{"desc":"The cipactli has advantage on Dexterity (Stealth) checks made while underwater.","name":"Underwater Camouflage"},{"desc":"As a bonus action, the cipactli can liquefy itself, disappearing from its current location and reappearing in an unoccupied space it can see within 20 feet. Its current location and the new location must be connected by water in some way: a stream, ooze, soggy ground, or even runoff from a drain pipe.","name":"Water Step"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"cipactli","type":"fiend"}