{"name":"Corpse Mound","size":"Huge","subtype":"","group":null,"alignment":"neutral evil","armor_class":16,"armor_desc":"natural armor","hit_points":207,"hit_dice":"18d12 + 90","speed":{"walk":30},"strength":24,"dexterity":11,"constitution":21,"intelligence":8,"wisdom":10,"charisma":8,"strength_save":null,"dexterity_save":null,"constitution_save":9,"intelligence_save":3,"wisdom_save":4,"charisma_save":null,"perception":null,"skills":{},"damage_vulnerabilities":"","damage_resistances":"necrotic","damage_immunities":"poison","condition_immunities":"charmed, exhaustion, frightened, poisoned","senses":"darkvision 60 ft., passive Perception 10","languages":"Understands Common but can't speak","challenge_rating":"11","actions":[{"name":"Multiattack","desc":"The corpse mound makes two weapon attacks or uses envelop once."},{"name":"Slam","desc":"Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 18 (2d10 + 7) bludgeoning damage plus 10 (3d6) necrotic damage and the target is grappled (escape DC 17). Until this grapple ends, the target is restrained.","attack_bonus":11,"damage_dice":"2d10"},{"name":"Bone Shard","desc":"Ranged Weapon Attack: +11 to hit, range 30/120 ft., one target. Hit: 14 (2d6 + 7) piercing damage and 10 (3d6) necrotic damage. When hit, the target must make a successful DC 17 Strength check or be knocked prone, pinned to the ground by the shard, and restrained. To end this restraint, the target or a creature adjacent to it must use an action to make a successful DC 17 Strength (Athletics) check to remove the shard.","attack_bonus":11,"damage_dice":"2d6"},{"name":"Envelop","desc":"The corpse mound makes a slam attack against a restrained creature. If the attack hits, the target takes damage as normal, is pulled 5 feet into the corpse mound's space, and is enveloped, which ends any grappled or prone condition. While enveloped, the creature is blinded and restrained, it has total cover against attacks and other effects outside the corpse mound, and it takes 21 (6d6) necrotic damage at the start of each of the corpse mound's turns. An enveloped creature can escape by using its action to make a successful DC 17 Strength saving throw. If the corpse mound takes 30 or more damage on a single turn from the enveloped creature, it must succeed on a DC 17 Constitution saving throw at the end of that turn or expel the creature, which falls prone in a space within 10 feet of the corpse mound. If the corpse mound dies, an enveloped creature is no longer restrained by it and can escape by using 10 feet of movement, exiting prone. A corpse mound can envelop up to 4 creatures at once."}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Absorb the Dead","desc":"Whenever a Small or larger non.undead creature dies within 20 feet of the corpse mound, that creature's remains join its form and the corpse mound regains 10 hit points."},{"name":"Noxious Aura","desc":"Creatures that are within 20 feet of the corpse mound at the end of its turn must succeed on a DC 17 Constitution saving throw or become poisoned until the end of their next turn. On a successful saving throw, the creature is immune to the Noxious Aura for 24 hours."},{"name":"Zombie Drop","desc":"At the start of the corpse mound's turn during combat, one corpse falls from the mound onto the ground and immediately rises as a zombie under its control. Up to 10 such zombies can be active at one time. Zombies take their turns immediately after the corpse mound's turn."}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"corpse-mound","type":"undead"}