{"name":"Devilbound Gnomish Prince","size":"Small","subtype":"gnome","group":null,"alignment":"any evil","armor_class":12,"armor_desc":"15 with mage armor","hit_points":104,"hit_dice":"19d6 + 38","speed":{"walk":25},"strength":10,"dexterity":14,"constitution":15,"intelligence":16,"wisdom":12,"charisma":22,"strength_save":null,"dexterity_save":null,"constitution_save":6,"intelligence_save":7,"wisdom_save":null,"charisma_save":10,"perception":null,"skills":{"arcana":7,"deception":10,"history":7,"persuasion":10},"damage_vulnerabilities":"","damage_resistances":"cold, fire, poison; bludgeoning, piercing, and slashing damage from nonmagical weapons that aren’t silvered","damage_immunities":"","condition_immunities":"poisoned","senses":"darkvision 60 ft., passive Perception 11","languages":"Common, Infernal, Gnomish","challenge_rating":"9","actions":[{"name":"Dagger","desc":"Melee or Ranged Weapon Attack: +6 to hit, reach 5 ft or range 20/60 ft., one target. Hit: 4 (1d4 + 2) piercing damage.","attack_bonus":6,"damage_dice":"1d4"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Banishing Word (1/Day)","desc":"When the devilbound gnomish prince hits with an attack, he can choose to banish the target to the Eleven Hells. The target vanishes from its current location and is incapacitated until its return. At the end of the devilbound gnomish prince's next turn, the target returns to the spot it previously occupied or the nearest unoccupied space and takes 55 (10d10) psychic damage."},{"name":"Infernal Blessing","desc":"The devilbound gnomish prince gains 21 temporary hit points when it reduces a hostile creature to 0 hit points."},{"name":"Infernal Tie","desc":"The devilbound gnomish prince can perceive through his imp's senses, communicate telepathically through its mind, and speak through his imp's mouth as long as both of them are on the same plane of existence."},{"name":"Innate Spellcasting","desc":"the devilbound gnomish prince's innate spellcasting ability is Charisma (spell save DC 18, +10 to hit with spell attacks). He can innately cast the following spells, requiring no material components:\n\nat will: detect magic, false life, mage armor\n\n1/rest each: create undead, forcecage, power word stun"},{"name":"Magic Resistance","desc":"The devilbound gnomish prince has advantage on all saving throws against spells and magical effects."},{"name":"Spellcasting","desc":"the devilbound gnomish prince is a 15th-level spellcaster. Its spellcasting ability is Charisma (spell save DC 18, +10 to hit with spell attacks). The devilbound gnomish prince has the following warlock spells prepared:\n\ncantrips (at will): chill touch, eldritch blast, minor illusion, prestidigitation\n\n5th level (3 slots):banishment, command, contact other plane, counterspell, dimension door, fireball, fly, flame strike, hallow, hex, hold monster, invisibility, scorching ray, scrying, wall of fire, witch bolt"}],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"devilbound-gnomish-prince","type":"Humanoid"}