{"name":"Droth","size":"Huge","subtype":"shoth","group":null,"alignment":"lawful neutral","armor_class":16,"armor_desc":"natural armor","hit_points":230,"hit_dice":"20d12+100","speed":{"climb":10,"walk":20},"strength":18,"dexterity":9,"constitution":20,"intelligence":14,"wisdom":16,"charisma":20,"strength_save":null,"dexterity_save":null,"constitution_save":9,"intelligence_save":null,"wisdom_save":7,"charisma_save":9,"perception":7,"skills":{"perception":7},"damage_vulnerabilities":"","damage_resistances":"cold, fire","damage_immunities":"acid","condition_immunities":"","senses":"blindsight 60 ft., passive Perception 17","languages":"all, telepathy 100 ft.","challenge_rating":"12","actions":[{"desc":"The droth makes two oozing crush attacks.","name":"Multiattack"},{"attack_bonus":8,"damage_dice":"4d12+4","desc":"Melee Weapon Attack: +8 to hit, reach 15 ft., one target. Hit: 30 (4d12 + 4) bludgeoning damage and 7 (2d6) acid damage.","name":"Oozing Crush"},{"desc":"A shoth with less than half its maximum hp can merge with any other shoth creature within 10 feet, adding its remaining hp to that creature’s. The hp gained this way can exceed the normal maximum of that creature. A shoth can accept one such merger every 24 hours.","name":"Merge"},{"desc":"The droth rises up and crashes down, releasing a 20-foot-radius wave of acidic ooze. Each creature in the area must make a DC 17 Dexterity saving throw. On a failure, a creature takes 45 (10d8) acid damage and is knocked prone. On a success, a creature takes half the damage and isn’t knocked prone.","name":"Acid Wave (Recharge 5-6)"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"When the droth damages a creature, it absorbs a portion of that creature’s knowledge and power. As a bonus action, it can recreate any action available to a creature it damaged within the last minute. This includes spells and actions with limited uses or with a recharge. This recreated action is resolved using the droth’s statistics where applicable.","name":"Absorbent (3/Day)"},{"desc":"The droth, including its equipment, can move through a space as narrow as 1 inch wide without squeezing.","name":"Amorphous"},{"desc":"Any creature hostile to the droth that starts its turn within 20 feet of the droth must succeed on a DC 17 Wisdom saving throw or have disadvantage on all attack rolls until the end of its next turn. Creatures with Intelligence 3 or lower automatically fail the saving throw.","name":"Soothing Aura"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"droth","type":"aberration"}