{"name":"Dullahan","size":"Large","subtype":"","group":null,"alignment":"lawful evil","armor_class":17,"armor_desc":"natural armor","hit_points":178,"hit_dice":"17d10 + 85","speed":{"walk":60},"strength":19,"dexterity":18,"constitution":20,"intelligence":13,"wisdom":15,"charisma":17,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":6,"skills":{"intimidation":7,"perception":6,"persuasion":7,"survival":6},"damage_vulnerabilities":"","damage_resistances":"bludgeoning, piercing, and slashing damage from nonmagical weapons","damage_immunities":"necrotic","condition_immunities":"charmed, frightened, exhaustion","senses":"blindsight 60 ft., passive Perception 16","languages":"Common, Elvish, Sylvan","challenge_rating":"11","actions":[{"name":"Multiattack","desc":"The dullahan makes two attacks with its spine whip."},{"name":"Spine Whip","desc":"Melee Weapon Attack: +8 to hit, reach 10 ft., one target. Hit: 15 (2d10 + 4) slashing damage plus 10 (3d10) necrotic damage. If the target is a creature it must make a DC 15 Constitution saving throw or be wracked with pain and fall prone.","attack_bonus":8,"damage_dice":"2d10"},{"name":"Seal the Doom","desc":"The dullahan points at a creature marked by Deathly Doom within 40 feet than it can see. The creature must succeed at a DC 15 Constitution saving throw against this magic or immediately drop to 0 hit points. A creature that successfully saves is immune to this effect for 24 hours."}],"reactions":[{"name":"Interposing Glare","desc":"When the dullahan is hit by a melee attack it can move its severed head in front of the attacker's face. The attacker is affected by the dullahan's Baleful Glare immediately. If the creature is averting its eyes this turn, it must still make the save, but does so with advantage."}],"legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Baleful Glare","desc":"When a creature that can see the eyes of the dullahan's severed head starts its turn within 30 feet of the dullahan, the dullahan can force it to make a DC 15 Wisdom saving throw if the dullahan isn't incapacitated and can see the creature. On a failed save, the creature is frightened until the start of its next turn. While frightened in this way the creature must move away from the dullahan, and can only use its action to Dash. If the creature is affected by the dullahan's Deathly Doom trait, it is restrained while frightened instead. Unless surprised, a creature can avert its eyes to avoid the saving throw at the start of its turn. If the creature does so, it can't see the dullahan until the start of its next turn, when it can avert its eyes again. If the creature looks at the dullahan in the meantime, it must immediately make the save."},{"name":"Deathly Doom (1/Day)","desc":"As a bonus action, the dullahan magically dooms a creature. The dullahan knows the direction to the doomed creature as long as it is on the same plane."},{"name":"Innate Spellcasting","desc":"the dullahan's innate spellcasting ability is Charisma (spell save DC 15, +7 to hit with spell attacks). The dullahan can innately cast the following spells, requiring no material or somatic components:\n\nat will: bane, chill touch, hex, knock\n\n3/day each: false life, see invisibility\n\n1/day: blight"},{"name":"Relentless Advance","desc":"The dullahan is unaffected by difficult terrain, and can ride over water and other liquid surfaces."}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"dullahan","type":"fey"}