{"name":"Dune Mimic","size":"Huge","subtype":"shapechanger","group":null,"alignment":"neutral","armor_class":13,"armor_desc":"natural armor","hit_points":168,"hit_dice":"16d12 + 64","speed":{"walk":10},"strength":20,"dexterity":8,"constitution":18,"intelligence":9,"wisdom":13,"charisma":10,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":4,"skills":{"perception":4},"damage_vulnerabilities":"","damage_resistances":"","damage_immunities":"acid","condition_immunities":"prone","senses":"darkvision 60 ft., tremorsense 30 ft., passive Perception 14","languages":"-","challenge_rating":"8","actions":[{"name":"Multiattack","desc":"The dune mimic makes four pseudopod attacks."},{"name":"Pseudopod","desc":"Melee Weapon Attack: +8 to hit, reach 10 ft., one target. Hit: 14 (2d8 + 5) bludgeoning damage. If the dune mimic is in object or terrain form, the target is subjected to the mimic's Adhesive trait.","attack_bonus":8,"damage_dice":"2d8"},{"name":"Engulf","desc":"The dune mimic engulfs all creatures it has grappled. An engulfed creature can't breathe, is restrained, is no longer grappled, has total cover against attacks and other effects outside the dune mimic, and takes 18 (4d8) acid damage at the start of each of the dune mimic's turns. When the dune mimic moves, the engulfed creature moves with it. An engulfed creature can try to escape by taking an action to make a DC 15 Strength check. On a success, the creature escapes and enters a space of its choice within 5 feet of the dune mimic."}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Shapechanger","desc":"The dune mimic can use its action to polymorph into a Huge object or terrain feature (maximum area 25 x 25 feet) or back into its true, amorphous form. Since its coating of dust, sand, and gravel can't be hidden, it usually disguises itself as a terrain feature or eroded ruin. Its statistics are the same in each form. Any equipment it is wearing or carrying isn't transformed. It reverts to its true form if it dies."},{"name":"Adhesive (Object or Terrain Form Only)","desc":"The dune mimic adheres to anything that touches it. A creature adhered to the dune mimic is also grappled by it (escape DC 15). Ability checks made to escape this grapple have disadvantage. The dune mimic can harden its outer surface, so only the creatures it chooses are affected by this trait."},{"name":"False Appearance (Object or Terrain Form Only)","desc":"While the dune mimic remains motionless, it is indistinguishable from an ordinary object or terrain feature."},{"name":"Grappler","desc":"The dune mimic has advantage on attack rolls against a creature grappled by it."}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"dune-mimic","type":"monstrosity"}