{"name":"Elementalist","size":"Medium","subtype":"dragonborn","group":null,"alignment":"lawful neutral","armor_class":15,"armor_desc":"studded leather","hit_points":45,"hit_dice":"7d8+14","speed":{"walk":30},"strength":8,"dexterity":16,"constitution":15,"intelligence":12,"wisdom":10,"charisma":17,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":null,"skills":{"arcana":3,"stealth":5},"damage_vulnerabilities":"","damage_resistances":"one of fire, lightning, cold, or poison (see Elemental Focus)","damage_immunities":"","condition_immunities":"","senses":"passive Perception 10","languages":"Common, Draconic","challenge_rating":"2","actions":[{"desc":"The dragonborn makes two scimitar attacks.","name":"Multiattack"},{"attack_bonus":5,"damage_dice":"1d6+3","desc":"Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) slashing damage.","name":"Scimitar"},{"desc":"The dragonborn breathes elemental energy in a 15-foot cone. Each creature in that area must make a DC 12 Dexterity saving throw, taking 10 (3d6) damage of the elementalist’s elemental focus type on a failed save, or half as much damage on a successful one.","name":"Fire Breath (Recharges after a Short or Long Rest)"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"Each dragonborn elementalist permanently aligns with a particular element. This elemental focus grants the dragonborn resistance to a certain damage type and the ability to innately cast some spells. Its spellcasting ability is Charisma (spell save DC 13, +5 to hit with spell attacks).\nFlame (Fire): The dragonborn has resistance to fire damage. It can cast the produce flame cantrip at will and can cast heat metal or scorching ray three times per day.\nStorm (Air): The dragonborn has resistance to lightning damage. It can cast the shocking grasp cantrip at will and can cast blur or gust of wind three times per day.\nTide (Water): The dragonborn has resistance to cold damage. It can cast the ray of frost cantrip at will and can cast sleet storm or water breathing three times per day. \nCave (Earth): The dragonborn has resistance to poison damage. It can cast the blade ward cantrip at will and can cast meld into stone or shatter three times per day.","name":"Elemental Focus"},{"desc":"When making an opportunity attack, the dragonborn can cast a spell with a casting time of 1 action instead of making a weapon attack. If this spell requires a ranged attack roll, the dragonborn doesn’t have disadvantage on the attack roll from being within 5 feet of a hostile creature, though it may still have disadvantage from other sources. This spell must only target the creature that provoked the opportunity attack.","name":"War Mage"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"elementalist","type":"humanoid"}