{"name":"Elemental Locus","size":"Gargantuan","subtype":"","group":null,"alignment":"neutral","armor_class":16,"armor_desc":"natural armor","hit_points":290,"hit_dice":"20d20 + 80","speed":{"walk":5},"strength":28,"dexterity":1,"constitution":18,"intelligence":10,"wisdom":11,"charisma":11,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":6,"wisdom_save":6,"charisma_save":6,"perception":6,"skills":{"nature":6,"perception":6},"damage_vulnerabilities":"","damage_resistances":"bludgeoning, piercing, and slashing","damage_immunities":"acid, cold, fire, lightning, poison, thunder; bludgeoning, piercing, and slashing from nonmagical weapons","condition_immunities":"charmed, exhaustion, frightened, paralyzed, petrified, poisoned, unconscious","senses":"darkvision 120 ft., tremorsense 120 ft., passive Perception 16","languages":"Primordial","challenge_rating":"17","actions":[{"name":"Multiattack","desc":"The elemental locus makes two slam attacks."},{"name":"Slam","desc":"Melee Weapon Attack: +15 to hit, reach 15 ft., one target. Hit: 36 (6d8 + 9) bludgeoning damage. If the target is a creature, it must succeed on a DC 23 Strength saving throw or be knocked prone.","attack_bonus":15,"damage_dice":"6d8"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Magic Resistance","desc":"The elemental locus has advantage on saving throws against spells and other magical effects."},{"name":"Immortal","desc":"The elemental locus does not age and does not die when it drops to 0 hit points. If the elemental locus drops to 0 hit points, it falls into a quiescent state for 25 weeks before returning to activity with full hit points. Its spawned elementals continue fighting whatever enemies attacked the elemental locus; if no enemies are present, they defend the locus's area."},{"name":"Massive","desc":"The elemental locus is larger than most Gargantuan creatures, occupying a space of 60 by 60 feet. Its movement is not affected by difficult terrain or by Huge or smaller creatures. Other creatures can enter and move through the elemental locus's space, but they must make a successful DC 20 Strength (Athletics) check after each 10 feet of movement. Failure indicates they fall prone and can move no farther that turn."},{"name":"Spawn Elementals","desc":"As a bonus action, the elemental locus loses 82 hit points and spawns an air, earth, fire, or water elemental to serve it. Spawned elementals answer to their creator's will and are not fully independent. The types of elementals the locus can spawn depend on the terrain it embodies; for example, an elemental locus of the desert can spawn earth, fire, and air elementals, but not water."},{"name":"Siege Monster","desc":"The elemental locus deals double damage to objects and structures."}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"elemental-locus","type":"elemental"}