{"name":"Emerald Eye","size":"Tiny","subtype":"","group":null,"alignment":"chaotic evil","armor_class":14,"armor_desc":"","hit_points":54,"hit_dice":"12d4 + 24","speed":{"hover":true,"walk":0,"fly":30},"strength":3,"dexterity":15,"constitution":14,"intelligence":15,"wisdom":12,"charisma":16,"strength_save":null,"dexterity_save":4,"constitution_save":4,"intelligence_save":4,"wisdom_save":null,"charisma_save":null,"perception":3,"skills":{"acrobatics":4,"arcana":4,"deception":5,"history":4,"perception":3,"persuasion":5,"religion":4},"damage_vulnerabilities":"","damage_resistances":"cold, fire; piercing damage","damage_immunities":"poison","condition_immunities":"blinded, deafened, exhausted, paralyzed, petrified, poisoned, prone, unconscious","senses":"passive Perception $1","languages":"Common, Draconic, telepathy 250 ft.","challenge_rating":"1","actions":[{"name":"Slash","desc":"Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 14 (5d4 + 2) slashing damage.","attack_bonus":4,"damage_dice":"5d4"},{"name":"Attraction (Recharge 5-6)","desc":"An emerald eye can compel one creature to move toward a particular person or object. If the creature fails a DC 13 Charisma saving throw, it feels a powerful compulsion to move toward whatever the emerald eye chooses. The target creature must be within 25 feet of the emerald eye when attraction is triggered, but the creature is then free to move beyond this range while remaining under the effect. Nothing seems out of the ordinary to the creature, but it does not knowingly put itself or its allies in harm's way to reach the object. The creature may attempt another DC 13 Charisma saving throw at the start of each of its turns; a success ends the effect."},{"name":"Bind (3/Day)","desc":"The emerald eye can bind itself psychically to a creature with an Intelligence of 6 or greater. The attempt fails if the target succeeds on a DC 13 Charisma saving throw. The attempt is unnoticed by the target, regardless of the result."},{"name":"Telepathic Lash (3/Day)","desc":"An emerald eye can overwhelm one humanoid creature within 25 feet with emotions and impulses the creature is hard-pressed to control. If the target fails a DC 13 Wisdom saving throw, it is stunned for 1 round."}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Bound","desc":"An emerald eye cannot move more than 25 feet away from the creature that it is psychically linked to. It begins existence bound to its creator, but a free emerald eye can bind itself to another creature as in the Bind action."},{"name":"Immutable Form","desc":"The emerald eye is immune to any spell or effect that would alter its form."}],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"emerald-eye","type":"construct"}