{"name":"Fang of the Great Wolf","size":"Large","subtype":"","group":null,"alignment":"neutral evil","armor_class":14,"armor_desc":"natural armor","hit_points":65,"hit_dice":"10d10+10","speed":{"walk":50},"strength":16,"dexterity":13,"constitution":13,"intelligence":9,"wisdom":13,"charisma":8,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":5,"skills":{"insight":3,"perception":5,"religion":1},"damage_vulnerabilities":"","damage_resistances":"cold","damage_immunities":"","condition_immunities":"","senses":"darkvision 60 ft., passive Perception 15","languages":"Common, Goblin, Worg","challenge_rating":"3","actions":[{"attack_bonus":5,"damage_dice":"3d6+3","desc":"Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 13 (3d6 + 3) piercing damage. If the target is a Medium or smaller creature, it is grappled (escape DC 13) if the worg isn’t already grapping a creature. Until this grapple ends, the target is restrained and the worg can’t bite another target.","name":"Bite"},{"desc":"The fang of the Great Wolf grows in size. This works like the enlarge/reduce spell, except the worg can only enlarge and it lasts for 1 minute. While enlarged, the fang of the Great Wolf gains the following action:\nSwallow. The worg makes one bite attack against a Medium or smaller target it is grappling. If the attack hits, the target is also swallowed, and the grapple ends. While swallowed, the target is blinded and restrained, it has total cover against attacks and other effects outside the worg, and it takes 10 (3d6) acid damage at the start of each of the worg’s turns. The worg can have only one creature swallowed at a time. \n\nIf the worg takes 10 damage or more on a single turn from the swallowed creature, the worg must succeed on a DC 11 Constitution saving throw at the end of that turn or regurgitate the creature, which falls prone in a space within 5 feet of the worg. The creature is automatically regurgitated when the worg is no longer enlarged. If the worg dies, a swallowed creature is no longer restrained by it and can escape from the corpse by using 10 feet of movement, exiting prone.","name":"Might of the Great Wolf (Recharges after a Short or Long Rest)"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"The worg has advantage on Wisdom (Perception) checks that rely on hearing or smell.","name":"Keen Hearing and Smell"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"fang-of-the-great-wolf","type":"monstrosity"}