{"name":"Fear Liath","size":"Large","subtype":"","group":null,"alignment":"neutral evil","armor_class":12,"armor_desc":null,"hit_points":33,"hit_dice":"6d10","speed":{"walk":40},"strength":17,"dexterity":15,"constitution":10,"intelligence":8,"wisdom":14,"charisma":7,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":null,"skills":{"athletics":5,"stealth":6},"damage_vulnerabilities":"","damage_resistances":"","damage_immunities":"poison","condition_immunities":"exhaustion, frightened, poisoned","senses":"darkvision 60 ft., passive Perception 12","languages":"any languages it knew in life","challenge_rating":"2","actions":[{"attack_bonus":5,"damage_dice":"1d6+3","desc":"Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) bludgeoning damage. The target must succeed on a DC 13 Constitution saving throw or be blinded for 1 minute. It can repeat this saving throw at the end of each of its turns, ending the effect on itself on a success.","name":"Slam"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"If remove curse is cast upon a fear liath, it is instantly destroyed. In addition, if the fear liath kills a humanoid creature, the fear liath is destroyed and the humanoid it killed rises as a fear liath in 1d4 hours. If remove curse is cast upon the cursed humanoid before it becomes a fear liath, the curse is broken.","name":"Gray Curse"},{"desc":"The fear liath becomes incorporeal and appears as a dark gray shadow while any living creature looks directly at it. While incorporeal, it can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object. While incorporeal, it also gains resistance to acid, fire, lightning, and thunder damage, and bludgeoning, piercing, and slashing damage from nonmagical attacks. The fear liath has no control over this trait.\n\nUnless surprised, a creature can avert its eyes to avoid looking directly at the fear liath at the start of its turn. If the creature does so, it can’t see the fear liath until the start of its next turn, when it can avert its eyes again. If a creature looks at the fear liath, the fear liath becomes incorporeal.","name":"Unwatchable"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"fear-liath","type":"undead"}