{"name":"Fear Smith","size":"Medium","subtype":"","group":null,"alignment":"chaotic neutral","armor_class":17,"armor_desc":"natural armor","hit_points":123,"hit_dice":"19d8 + 38","speed":{"walk":40,"climb":15},"strength":11,"dexterity":17,"constitution":14,"intelligence":11,"wisdom":15,"charisma":18,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":6,"charisma_save":null,"perception":null,"skills":{"stealth":7},"damage_vulnerabilities":"","damage_resistances":"bludgeoning, piercing, and slashing from weapons that aren't made of cold iron","damage_immunities":"","condition_immunities":"charmed, frightened","senses":"blindsight 30 ft., passive Perception 12","languages":"Common, Elvish, Sylvan","challenge_rating":"10","actions":[{"name":"Multiattack","desc":"The fear smith makes three claw attacks."},{"name":"Claw","desc":"Melee Weapon Attack: +7 to hit, reach 5 ft., 1 creature. Hit: 16 (2d12 + 3) slashing damage. If the target is disoriented by Distortion Gaze, this attack does an additional 13 (3d8) psychic damage and heals the fear smith by an equal amount.","attack_bonus":7,"damage_dice":"2d12+3"},{"name":"Heartstopping Stare","desc":"The fear smith terrifies a creature within 30 feet with a look. The target must succeed on a DC 16 Wisdom saving throw or be stunned for 1 round and take 13 (3d8) psychic damage and heal the fear smith by an equal amount."}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Distortion Gaze","desc":"Those who meet the gaze of the fear smith experience the world seeming to twist at unnatural angles beneath their feet. When a creature that can see the fear smith's eye starts its turn within 30 feet of the fear smith, the creature must make a successful DC 16 Wisdom saving throw or become disoriented. While disoriented, the creature falls prone each time it tries to move or take the Dash or Disengage action. To recover from disorientation, a creature must start its turn outside the fear smith's gaze and make a successful DC 16 Wisdom saving throw. To use this ability, the fear smith can't be incapacitated and must see the affected creature. A creature that isn't surprised can avert its eyes at the start of its turn to avoid the effect. In that case, no saving throw is necessary but the creature treats the fear smith as invisible until the start of the creature's next turn. If during its turn the creature chooses to look at the fear smith, it must immediately make the saving throw."},{"name":"Hidden Eye","desc":"The fear smith has advantage on saving throws against the blinded condition."},{"name":"Innate Spellcasting","desc":"the fear smith's innate spellcasting ability is Charisma (spell save DC 16). The fear smith can innately cast the following spells, requiring no verbal or material components:at will: detect thoughts, fear2/day each: charm person, command, confusion"},{"name":"Magic Resistance","desc":"The fear smith has advantage on saving throws against spells and other magical effects."}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"fear-smith","type":"fey"}