{"name":"Fellforged","size":"Medium","subtype":"","group":null,"alignment":"lawful evil","armor_class":15,"armor_desc":"natural armor","hit_points":135,"hit_dice":"18d8 + 54","speed":{"walk":30},"strength":14,"dexterity":12,"constitution":17,"intelligence":12,"wisdom":14,"charisma":15,"strength_save":8,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":null,"skills":{},"damage_vulnerabilities":"","damage_resistances":"acid, cold, fire, lightning","damage_immunities":"necrotic, poison","condition_immunities":"charmed, exhaustion, poisoned","senses":"darkvision 60 ft., passive Perception 12","languages":"any languages it knew in life","challenge_rating":"5","actions":[{"name":"Multiattack","desc":"The fellforged makes two necrotic slam attacks."},{"name":"Necrotic Slam","desc":"Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 11 (2d8 + 2) bludgeoning damage plus 4 (1d8) necrotic damage, and the target must succeed on a DC 14 Constitution saving throw or its hit point maximum is reduced by an amount equal to the total damage taken. This reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hit point maximum to 0.","attack_bonus":5,"damage_dice":"2d8"},{"name":"Violent Escapement","desc":"With little regard for the clockwork bodies they inhabit, fellforged wraiths can stress and strain their mechanisms in such a violent manner that flywheels become unbalanced, gears shatter, and springs snap. As a bonus action, this violent burst of gears and pulleys deals 7 (2d6) piercing damage to all foes within 5 feet who fail a DC 14 Dexterity saving throw. Each use of this ability imposes a cumulative reduction in movement of 5 feet upon the fellforged. If its speed is reduced to 0 feet, the fellforged becomes paralyzed."}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Expelled Spirit","desc":"While the fellforged body was made to bind spirits, the wraith within is vulnerable to turning attempts. Any successful turn attempt exorcises the wraith from its clockwork frame. The expelled wraith retains its current hp total and fights normally. The construct dies without an animating spirit."},{"name":"Sunlight Sensitivity","desc":"While in sunlight, the fellforged has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight."},{"name":"Unnatural Aura","desc":"All animals, whether wild or domesticated, can sense the unnatural presence of fellforged at a distance of 30 feet. They do not willingly approach nearer than that and panic if forced to do so, and they remain panicked as long as they are within that range."}],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"fellforged","type":"construct"}