{"name":"Fierstjerren","size":"Medium","subtype":"","group":null,"alignment":"neutral evil","armor_class":14,"armor_desc":"studded leather","hit_points":105,"hit_dice":"14d8+42","speed":{"walk":30},"strength":16,"dexterity":15,"constitution":16,"intelligence":14,"wisdom":11,"charisma":12,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":3,"skills":{"perception":3},"damage_vulnerabilities":"","damage_resistances":"","damage_immunities":"necrotic, poison","condition_immunities":"charmed, exhaustion, frightened, paralyzed, poisoned, unconscious","senses":"passive Perception 13","languages":"Common","challenge_rating":"5","actions":[{"desc":"The fierstjerren makes two sword attacks.","name":"Multiattack"},{"attack_bonus":6,"damage_dice":"2d8+3","desc":"Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 12 (2d8 + 3) slashing damage.","name":"Sword"},{"desc":"The fierstjerren targets one creature it can see within 30 feet of it. If the creature can see the fierstjerren, it must succeed on a DC 15 Wisdom saving throw or be frightened until the end of the fierstjerren’s next turn.","name":"Terrifying Glare"},{"desc":"The fierstjerren targets one humanoid it can see within 30 feet of it that has a CR up to 1/2. The humanoid must succeed on a DC 15 Wisdom saving throw or be magically charmed by the fierstjerren. The fierstjerren can telepathically communicate with any creature it has charmed. The charmed target can’t take reactions and obeys the fierstjerren’s verbal and telepathic commands. A fierstjerren can have up to twelve charmed thralls at one time. A charmed thrall loses the memories of its previous life and devotes itself to the fierstjerren and the cult. The charm lasts for 24 hours or until the fierstjerren is destroyed, is more than 300 feet from the charmed target, or takes a bonus action to end the effect. The fierstjerren can attempt to reassert control over all of its thralls by using this action. Each thrall can repeat the saving throw when the fierstjerren uses this action to reassert control.","name":"Thrall Enslavement"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"When the fierstjerren has 80 hp or fewer, the spirit within it tears free and tendrils of necrotic energy erupt from its skin. When it hits with any weapon, the weapon deals an extra 4 (1d8) necrotic damage. When it has 60 hp or fewer, its weapon attacks instead deal an extra 9 (2d8) necrotic damage. When it has 40 hp or fewer, its weapon attacks instead deal an extra 13 (3d8) necrotic damage.","name":"Apotheosis"},{"desc":"A fierstjerren with thralls can’t be surprised and attacks from hiding don’t gain advantage against it.","name":"Thrall Watch"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"fierstjerren","type":"undead"}