{"name":"Gargoctopus","size":"Large","subtype":"","group":null,"alignment":"neutral","armor_class":13,"armor_desc":"natural armor","hit_points":104,"hit_dice":"16d10+16","speed":{"climb":20,"swim":40,"walk":40},"strength":18,"dexterity":13,"constitution":12,"intelligence":19,"wisdom":16,"charisma":14,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":6,"skills":{"history":7,"investigation":7,"perception":6,"stealth":7},"damage_vulnerabilities":"","damage_resistances":"","damage_immunities":"","condition_immunities":"","senses":"darkvision 60 ft., passive Perception 16","languages":"telepathy 100 ft.","challenge_rating":"5","actions":[{"desc":"The gargoctopus makes four tentacle attacks or one bite attack and three tentacle attacks.","name":"Multiattack"},{"attack_bonus":7,"damage_dice":"3d8+4","desc":"Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 17 (3d8 + 4) piercing damage.","name":"Bite"},{"attack_bonus":7,"damage_dice":"2d6+4","desc":"Melee Weapon Attack: +7 to hit, reach 15 ft., one target. Hit: 11 (2d6 + 4) bludgeoning damage. If the target is a Medium or smaller creature, it is grappled (escape DC 15). Until the grapple ends, the target is restrained, the gargoctopus can automatically hit the target with its tentacle, and it can’t use the same tentacle on another target. The gargoctopus can grapple up to four creatures at one time.","name":"Tentacle"},{"desc":"One Medium or smaller creature grappled by the gargoctopus is thrown up to 20 feet in a random direction and is knocked prone. If the target strikes a solid surface, the target takes 7 (2d6) bludgeoning damage. If the target is thrown at another creature, that creature must succeed on a DC 12 Dexterity saving throw or take the same damage and be knocked prone.","name":"Fling"},{"desc":"The gargoctopus slams the creatures grappled by it into a solid surface. Each grappled creature must make a DC 15 Constitution saving throw. On a failure, a target takes 10 (3d6) bludgeoning damage and is stunned until the end of the gargoctopus’ next turn. On a success, a target takes half the damage and isn’t stunned.","name":"Tentacle Slam (Recharge 5-6)"},{"desc":"A 20-foot-radius cloud of darkness extends around the gargoctopus. The area is heavily obscured until the start of the gargoctopus’ next turn. If underwater, the gargoctopus can use the Dash action as a bonus action after releasing the cloud.","name":"Ink Cloud (Recharge 6)"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"The gargoctopus can breathe air and water.","name":"Amphibious"},{"desc":"The gargoctopus has advantage on Dexterity (Stealth) checks made to hide.","name":"Shifting Camouflage"},{"desc":"The gargoctopus can climb on difficult surfaces, including upside down on ceilings, without needing to make an ability check.","name":"Spider Climb"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"gargoctopus","type":"monstrosity"}