{"name":"Ghostwalk Spider","size":"Large","subtype":"","group":null,"alignment":"neutral evil","armor_class":15,"armor_desc":"","hit_points":119,"hit_dice":"14d10 + 42","speed":{"walk":50,"climb":50},"strength":15,"dexterity":20,"constitution":17,"intelligence":9,"wisdom":14,"charisma":8,"strength_save":null,"dexterity_save":null,"constitution_save":9,"intelligence_save":null,"wisdom_save":null,"charisma_save":3,"perception":6,"skills":{"perception":6},"damage_vulnerabilities":"","damage_resistances":"","damage_immunities":"poison","condition_immunities":"poisoned","senses":"blindsight 10 ft., darkvision 60 ft., passive Perception 16","languages":"understands Undercommon but can't speak","challenge_rating":"9","actions":[{"name":"Multiattack","desc":"The ghostwalk spider makes two bite attacks. It can make a ghostly snare attack in place of one of its bites."},{"name":"Bite","desc":"Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 16 (2d10 + 5) piercing damage plus 13 (3d8) poison damage, or half poison damage with a successful DC 15 Constitution saving throw. If the poison damage reduces the target to 0 hit points, the target is stable but poisoned and paralyzed for 1 hour, even after regaining hit points. While using Ghostwalk, the spider's bite and poison do half damage to targets that aren't affected by Ghostly Snare (see below).","attack_bonus":9,"damage_dice":"2d10"},{"name":"Ghostly Snare (During Ghostwalk Only, Recharge 5-6)","desc":"Ranged Weapon Attack: +9 to hit, range 40/160 ft., one target. Hit: The target is restrained by ghostly webbing. While restrained in this way, the target is invisible to all creatures except ghostwalk spiders, and it has resistance to acid, cold, fire, lightning, and thunder damage. A creature restrained by Ghostly Snare can escape by using an action to make a successful DC 14 Strength check, or the webs can be attacked and destroyed (AC 10; hp 5)."}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Ghostwalk","desc":"As a bonus action, the ghostwalk spider becomes invisible and intangible. Attacking doesn't end this invisibility. While invisible, the ghostwalk spider has advantage on Dexterity (Stealth) checks and gains the following: Damage Resistances acid, cold, fire, lightning, thunder; bludgeoning, piercing, and slashing damage from nonmagical weapons. Condition Immunities paralyzed, petrified, prone, restrained, stunned. The ghostwalk ends when the spider chooses to end it as a bonus action or when the spider dies"},{"name":"Incorporeal Movement (During Ghostwalk Only)","desc":"The ghostwalk spider can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object."},{"name":"Spider Climb","desc":"The spider can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check."},{"name":"Web Walker","desc":"The spider ignores movement restrictions caused by webbing."}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"ghostwalk-spider","type":"monstrosity"}