{"name":"Gloomflower","size":"Tiny","subtype":"","group":null,"alignment":"unaligned","armor_class":12,"armor_desc":"natural armor","hit_points":44,"hit_dice":"8d4+24","speed":{"walk":10},"strength":10,"dexterity":6,"constitution":16,"intelligence":1,"wisdom":6,"charisma":18,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":null,"skills":{},"damage_vulnerabilities":"","damage_resistances":"","damage_immunities":"","condition_immunities":"blinded, deafened, frightened","senses":"blindsight 120 ft. passive Perception 8","languages":"understands all languages known by creatures within 120 feet, but can’t speak, telepathy 120 ft.","challenge_rating":"3","actions":[{"desc":"The gloomflower makes two psychic strike attacks.","name":"Multiattack"},{"attack_bonus":6,"damage_dice":"3d6","desc":"Ranged Spell Attack: +6 to hit, range 120 ft., one target. Hit: 10 (3d6) psychic damage.","name":"Psychic Strike"},{"desc":"Each creature of the gloomflower’s choice that is within 60 feet of the gloomflower and aware of it must make a DC 14 Wisdom saving throw. On a failure, a creature is bombarded with visions of its fears and anxieties for 1 minute. While bombarded, it takes 7 (2d6) psychic damage at the start of each of its turns and must spend its action to make one melee attack against a creature within 5 feet of it, other than the gloomflower or itself. If the creature can’t make a melee attack, it takes the Dodge action. The creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. On a success, a creature is incapacitated by hallucinations until the end of its next turn but isn’t bombarded with visions of its fears and anxieties. \n\nA creature that is reduced to 0 hp by this psychic damage falls unconscious and is stable. When that creature regains consciousness, it suffers permanent hallucinations and has disadvantage on ability checks until cured by a remove curse spell or similar magic.","name":"Corrupting Visions (Recharge 5-6)"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"Creatures have disadvantage on attack rolls against the gloomflower. An attacker is immune to this effect if it doesn’t rely on sight, as with blindsight, or can see through illusions, as with truesight.","name":"Blur"},{"desc":"Whenever the gloomflower takes damage, each creature within 10 feet of the gloomflower must succeed on a DC 14 Wisdom saving throw or take 7 (2d6) psychic damage.","name":"Psychic Scream"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"gloomflower","type":"plant"}