{"name":"Haugbui","size":"Medium","subtype":"","group":null,"alignment":"lawful neutral","armor_class":18,"armor_desc":"natural armor","hit_points":136,"hit_dice":"16d8 + 64","speed":{"hover":true,"walk":0,"fly":40},"strength":18,"dexterity":17,"constitution":18,"intelligence":15,"wisdom":20,"charisma":16,"strength_save":null,"dexterity_save":8,"constitution_save":9,"intelligence_save":null,"wisdom_save":10,"charisma_save":null,"perception":10,"skills":{"arcana":7,"history":7,"intimidation":8,"perception":10,"religion":12},"damage_vulnerabilities":"","damage_resistances":"cold, lightning, necrotic","damage_immunities":"poison; bludgeoning, piercing, and slashing from nonmagical weapons","condition_immunities":"charmed, exhaustion, frightened, paralyzed, poisoned","senses":"truesight 60 ft., passive Perception 20","languages":"the languages it spoke in life; telepathy 120 ft.","challenge_rating":"13","actions":[{"name":"Multiattack","desc":"The haugbui makes two psychic claw attacks."},{"name":"Psychic Claw","desc":"Ranged Magical Attack: +10 to hit, range 40 ft., one target. Hit: 32 (6d8 + 5) psychic damage.","attack_bonus":10,"damage_dice":"6d8"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Incorporeal Movement","desc":"The haugbui can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object."},{"name":"Innate Spellcasting","desc":"the haugbui's innate spellcasting ability is Wisdom (spell save DC 18). It can innately cast the following spells, requiring no material components:\n\nconstant: detect thoughts, invisibility, mage hand, scrying\n\nat will: dancing lights, druidcraft, mending, spare the dying\n\n7/day each: bane, create or destroy water, fog cloud, purify food and drink\n\n5/day each: blindness/deafness, gust of wind, locate object, moonbeam, shatter\n\n3/day each: bestow curse, dispel magic, plant growth, remove curse, telekinesis\n\n1/day each: blight, contagion, dream\n\n1/week each: geas, hallow"},{"name":"Legendary Resistance (3/Day)","desc":"If the haugbui fails a saving throw it can choose to succeed instead."},{"name":"Sepulchral Scrying (1/Day)","desc":"An invisible magical eye is created under the haugbui's control, allowing it to watch its territory without leaving the burial mound. The eye travels at the speed of thought and can be up to 5 miles from the haugbui's location. The haugbui can see and hear as if it were standing at the eye's location, and it can use its innate spellcasting abilities as if it were at the eye's location. The eye can be noticed with a successful DC 18 Wisdom (Perception) check and can be dispelled as if it were 3rd-level spell. Spells that block other scrying spells work against Sepulchral Scrying as well. Unless dismissed by its creator or dispelled, lasts for up to 12 hours after its creation; only one can be created per 24-hour period."},{"name":"Sunlight Sensitivity","desc":"While in sunlight, the haugbui has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight."},{"name":"Turn Resistance","desc":"The haugbui has advantage on saving throws against any effect that turns undead."}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"haugbui","type":"undead"}