{"name":"Horakh","size":"Medium","subtype":"","group":null,"alignment":"neutral","armor_class":17,"armor_desc":"natural armor","hit_points":161,"hit_dice":"19d8 + 76","speed":{"walk":40,"climb":30},"strength":18,"dexterity":19,"constitution":19,"intelligence":8,"wisdom":15,"charisma":10,"strength_save":null,"dexterity_save":12,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":6,"skills":{"athletics":8,"perception":6,"stealth":8},"damage_vulnerabilities":"","damage_resistances":"","damage_immunities":"","condition_immunities":"","senses":"darkvision 60 ft., tremorsense 30 ft., passive Perception 20","languages":"understands Undercommon","challenge_rating":"9","actions":[{"name":"Multiattack","desc":"The horakh makes two claw attacks and one bite attack."},{"name":"Bite","desc":"Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 22 (4d8 + 4) slashing damage. If the bite attack hits a target that's grappled by the horakh, the target must make a successful DC 16 Dexterity saving throw or one of its eyes is bitten out. A creature with just one remaining eye has disadvantage on ranged attack rolls and on Wisdom (Perception) checks that rely on sight. If both (or all) eyes are lost, the target is blinded. The regenerate spell and comparable magic can restore lost eyes. Also see Implant Egg, below.","attack_bonus":8,"damage_dice":"4d8"},{"name":"Claw","desc":"Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 17 (3d8 + 4) piercing damage. If both attacks hit the same Medium or smaller target in a single turn, the target is grappled (escape DC 14).","attack_bonus":8,"damage_dice":"3d8"},{"name":"Implant Egg","desc":"If a horakh's bite attack reduces a grappled creature to 0 hit points, or it bites a target that's already at 0 hit points, it implants an egg in the creature's eye socket. The deposited egg grows for 2 weeks before hatching. If the implanted victim is still alive, it loses 1d2 Constitution every 24 hours and has disadvantage on attack rolls and ability checks. After the first week, the victim is incapacitated and blinded. When the egg hatches after 2 weeks, an immature horakh erupts from the victim's head, causing 1d10 bludgeoning, 1d10 piercing, and 1d10 slashing damage. A lesser restoration spell can kill the egg during its incubation."}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Shadow Stealth","desc":"A horakh can hide as a bonus action if it's in dim light or darkness."},{"name":"Standing Leap","desc":"As part of its movement, the horakh can jump up to 20 feet horizontally and 10 feet vertically, with or without a running start."}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"horakh","type":"monstrosity"}