{"name":"Hulking Whelp","size":"Small","subtype":"shapechanger","group":null,"alignment":"chaotic neutral","armor_class":15,"armor_desc":"natural armor","hit_points":94,"hit_dice":"9d12 + 36","speed":{"walk":40},"strength":21,"dexterity":10,"constitution":18,"intelligence":7,"wisdom":14,"charisma":9,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":null,"skills":{},"damage_vulnerabilities":"","damage_resistances":"bludgeoning, piercing, and slashing from nonmagical weapons","damage_immunities":"","condition_immunities":"","senses":"impaired sight 30 ft., passive Perception 12","languages":"-","challenge_rating":"5","actions":[{"name":"Multiattack","desc":"The hulking whelp makes two slam attacks."},{"name":"Slam","desc":"Melee Weapon Attack: +8 to hit, reach 15 ft., one target. Hit: 18 (3d8 + 5) bludgeoning damage.","attack_bonus":8,"damage_dice":"3d8"}],"reactions":[{"name":"Quick Step","desc":"A hulking whelp can move 20 feet as a reaction when it is attacked. No opportunity attacks are triggered by this move."}],"legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Calm State","desc":"When a hulking whelp is calm and unafraid, it uses the following statistics instead of those listed above: Size Small; HP 9 (6d6 . 12); Speed 20 ft.; STR 8 (-1); CON 6 (-2); Languages Common, Sylvan"},{"name":"Poor Senses","desc":"A hulking whelp has poor hearing and is nearsighted. It can see in normal or dim light up to 30 feet and hear sounds from up to 60 feet away."},{"name":"Unleashed Emotion","desc":"When a hulking whelp feels threatened - it's touched, intimidated, cornered, attacked, or even just if a stranger moves adjacent to the whelp - it immediately grows from size Small to Huge as a reaction. If the whelp was attacked, this reaction occurs after the attack is made but before damage is done. Nearby creatures and objects are pushed to the nearest available space and must make a successful DC 15 Strength saving throw or fall prone. Weapons, armor, and other objects worn or carried by the hulking whelp grow (and shrink again) proportionally when it changes size. Overcome by raw emotion, it sets about destroying anything and everything it can see (which isn't much) and reach (which is quite a lot). The transformation lasts until the hulking whelp is unaware of any nearby creatures for 1 round, it drops to 0 hit points, it has 5 levels of exhaustion, or it's affected by a calm emotions spell or comparable magic. The transformation isn't entirely uncontrollable; people or creatures the whelp knows and trusts can be near it without triggering the reaction. Under the wrong conditions, such as in a populated area, a hulking whelp's Unleashed Emotion can last for days."}],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"hulking-whelp","type":"fey"}