{"name":"Imy-Ut Ushabti","size":"Medium","subtype":"","group":null,"alignment":"neutral","armor_class":15,"armor_desc":"chain shirt","hit_points":97,"hit_dice":"15d8 + 30","speed":{"walk":30},"strength":17,"dexterity":14,"constitution":15,"intelligence":6,"wisdom":10,"charisma":5,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":2,"charisma_save":null,"perception":null,"skills":{},"damage_vulnerabilities":"","damage_resistances":"bludgeoning","damage_immunities":"","condition_immunities":"exhaustion, frightened","senses":"darkvision 60 ft., passive Perception 10","languages":"Common (Ancient Nurian)","challenge_rating":"3","actions":[{"name":"Ceremonial Greatsword","desc":"Melee Weapon Attack: +5 to hit, reach 5 ft., one creature. Hit: 10 (2d6 + 3) slashing damage, and the target must make a successful DC 13 Constitution saving throw or take 5 (2d4) poison damage at the start of each of its turns. The target repeats the saving throw at the end of each of its turns, ending the effect on itself on a success.","attack_bonus":5,"damage_dice":"2d6"},{"name":"Vomit Swarm (1/Day)","desc":"The imy-ut ushabti parts its wrappings voluntarily and releases a swarm of scarab beetles that follow its mental commands. The statistics of this swarm are identical to a swarm of insects, but with the following attack instead of a swarm of insects' standard bite attack:"},{"name":"Bites","desc":"Melee Weapon Attack: +3 to hit, reach 0 ft., one creature. Hit: 10 (4d4) piercing damage, or 5 (2d4) piercing damage if the swarm has half of its hit points or fewer, and the target must make a successful DC 13 Constitution saving throw or take 5 (2d4) poison damage at the start of each of its turns. A poisoned creature repeats the saving throw at the end of each of its turns, ending the effect on itself on a success.","attack_bonus":3,"damage_dice":"4d4"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Regeneration","desc":"The imy-ut ushabti regains 5 hit points at the start of its turn if it has at least 1 hit point."},{"name":"Rent wrappings","desc":"A creature that touches or deals slashing or piercing damage to an imy-ut ushabti while within 5 feet of the creature shreds its delicate linen wrappings, releasing a flurry of skittering scarabs. The attacking creature must make a DC 12 Dexterity saving throw to avoid them. On a failure, these beetles flow onto the attacker and deal 3 (1d6) piercing damage to it at the start of each of its turns. A creature can remove beetles from itself or from another affected creature within reach by using an action and making a successful DC 12 Dexterity saving throw. The beetles are also destroyed if the affected creature takes damage from an area effect."}],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"imy-ut-ushabti","type":"monstrosity"}