{"name":"Ink Guardian","size":"Large","subtype":"","group":null,"alignment":"unaligned","armor_class":8,"armor_desc":null,"hit_points":102,"hit_dice":"12d10+36","speed":{"walk":20},"strength":16,"dexterity":7,"constitution":16,"intelligence":6,"wisdom":6,"charisma":1,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":null,"skills":{},"damage_vulnerabilities":"","damage_resistances":"fire, slashing, thunder","damage_immunities":"acid","condition_immunities":"blinded, charmed, deafened, exhaustion, frightened, prone","senses":"blindsight 60 ft. (blind beyond this radius), passive Perception 8","languages":"—","challenge_rating":"4","actions":[{"desc":"As a Medium or Large creature, the ink guardian makes two pseudopod attacks","name":"Multiattack"},{"attack_bonus":5,"damage_dice":"1d8+3","desc":"Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 7 (1d8 + 3) bludgeoning damage plus 7 (2d6) acid damage.","name":"Pseudopod"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"The ink guardian can move through a space as narrow as 1 inch wide without squeezing.","name":"Amorphous"},{"desc":"When activated, the creature launches from its bottle, landing within 20 feet of the bottle. It starts as Tiny, and at the start of each of its turns, it increases in size by one step to a maximum of Large.\n\nWhen the ink guardian is defeated, the bottle becomes inactive for 3d8 hours. After that time, the ink guardian regains all its hp and is active again. The bottle has AC of 20, 10 hp, and is immune to damage that isn’t bludgeoning. If the bottle is destroyed, the ink guardian dies and can’t rejuvenate.","name":"Bottled Rejuvenation"},{"desc":"A creature that touches the ink guardian or hits it with a melee attack while within 5 feet of it takes 4 (1d8) acid damage. The ink guardian can eat through flesh quickly, but it doesn’t harm metal, wood, or paper.","name":"Selectively Caustic"},{"desc":"When the ink guardian is subjected to thunder damage, it takes no damage and instead splashes onto creatures within 5 feet of it. Each creature in the area takes 4 (1d8) acid damage. When the ink guardian is reduced to 0 hp, it explodes. Each creature within 15 feet of it must make a DC 13 Dexterity saving throw, taking 9 (2d8) acid damage on a failed save, or half as much damage on a successful one.","name":"Volatile"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"ink-guardian","type":"ooze"}