{"name":"Ink Devil","size":"Small","subtype":"devil","group":null,"alignment":"lawful evil","armor_class":14,"armor_desc":"","hit_points":54,"hit_dice":"12d6 + 12","speed":{"walk":30},"strength":12,"dexterity":18,"constitution":12,"intelligence":20,"wisdom":8,"charisma":18,"strength_save":null,"dexterity_save":6,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":null,"skills":{"arcana":9,"deception":8,"history":9,"stealth":8},"damage_vulnerabilities":"","damage_resistances":"cold; bludgeoning, piercing, and slashing from nonmagical weapons that aren't silvered","damage_immunities":"fire, poison","condition_immunities":"poisoned","senses":"darkvision 120 ft., passive Perception 9","languages":"Celestial, Common, Draconic, Infernal; telepathy (120 ft.)","challenge_rating":"2","actions":[{"name":"Bite","desc":"Melee Weapon Attack: +6 to hit, reach 5 ft., single target. Hit: 11 (2d6 + 4) piercing damage.","attack_bonus":6,"damage_dice":"2d6"},{"name":"Claw","desc":"Melee Weapon Attack: +6 to hit, reach 5 ft., single target. Hit: 14 (3d6 + 4) slashing damage.","attack_bonus":6,"damage_dice":"3d6"},{"name":"Disrupt Concentration","desc":"Their sharp, shrill tongues and sharper claws make ink devils more distracting than their own combat prowess might indicate. As a bonus action, an ink devil can force a single foe within 30 feet of the ink devil to make a DC 13 Wisdom saving throw or lose concentration until the beginning of the target's next turn."},{"name":"Corrupt Scroll","desc":"An ink devil can corrupt the magic within any scroll by touch. Any such corrupted scroll requires a DC 13 Intelligence saving throw to use successfully. If the check fails, the scroll's spell affects the caster if it is an offensive spell, or it affects the nearest devil if it is a beneficial spell."},{"name":"Devil's Mark","desc":"Ink devils can flick ink from their fingertips at a single target within 15 feet of the devil. The target must succeed on a Dexterity saving throw (DC 13), or the affected creature gains a devil's mark.a black, red, or purple tattoo in the shape of an archduke's personal seal (most often Mammon or Totivillus but sometimes Arbeyach, Asmodeus, Beelzebub, Dispater, or others). All devils have advantage on spell attacks made against the devil-marked creature, and the creature has disadvantage on saving throws made against spells and abilities used by devils. The mark can be removed only by a remove curse spell or comparable magic. In addition, the mark detects as faintly evil and often shifts its position on the body. Paladins, witchfinders, and some clerics may consider such a mark proof that a creature has made a pact with a devil."}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Devil's Sight","desc":"Magical darkness doesn't impede the devil's darkvision."},{"name":"Magic Resistance","desc":"The devil has advantage on saving throws against spells and other magical effects."},{"name":"Innate Spellcasting","desc":"the ink devil's spellcasting ability is Charisma (spell save DC 14). The ink devil can cast the following spells, requiring no material components:\n\nat will: detect magic, illusory script, invisibility, teleportation (self plus 50 lb of objects only)\n\n1/day each: glyph of warding, planar ally (1d4 + 1 lemures 40 percent, or 1 ink devil 25 percent)"}],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"ink-devil","type":"fiend"}