{"name":"Koschei","size":"Medium","subtype":"","group":null,"alignment":"neutral evil","armor_class":18,"armor_desc":"natural armor","hit_points":135,"hit_dice":"18d8 + 54","speed":{"walk":30},"strength":22,"dexterity":12,"constitution":17,"intelligence":17,"wisdom":13,"charisma":21,"strength_save":null,"dexterity_save":7,"constitution_save":null,"intelligence_save":null,"wisdom_save":7,"charisma_save":11,"perception":7,"skills":{"arcana":9,"insight":7,"perception":7},"damage_vulnerabilities":"","damage_resistances":"cold, lightning","damage_immunities":"necrotic; bludgeoning, piercing, and slashing damage from nonmagical weapons","condition_immunities":"charmed, exhaustion, frightened","senses":"darkvision 60 ft., passive Perception 17","languages":"Abyssal, Common, Celestial, Dwarvish, Infernal","challenge_rating":"17","actions":[{"name":"Multiattack","desc":"Koschei makes two longsword attacks and one drain life attack."},{"name":"Longsword","desc":"Melee Weapon Attack: +12 to hit, reach 5 ft., one target. Hit: 10 (1d8 + 6) slashing damage or 11 (1d10 + 6) slashing damage if used in two hands plus 14 (4d6) necrotic damage.","attack_bonus":12,"damage_dice":"1d8"},{"name":"Drain Life","desc":"Melee Spell Attack: +11 to hit, reach 5 ft., one target. Hit: 20 (4d6 + 6) necrotic damage. The target must succeed on a DC 19 Constitution saving throw or its hit point maximum is reduced by an amount equal to the damage taken from this attack, and Koschei regains an equal number of hit points. This reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hit point maximum to 0.","attack_bonus":11,"damage_dice":"4d6"}],"reactions":"","legendary_desc":"Koschei can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. Koschei regains spent legendary actions at the start of its turn.","legendary_actions":[{"name":"Attack","desc":"Koschei makes one attack with his longsword."},{"name":"Teleport","desc":"Koschei teleports to an unoccupied space he can see within 40 feet."},{"name":"Drain (2 actions)","desc":"Koschei makes one attack with Drain Life."}],"special_abilities":[{"name":"Hidden Soul","desc":"A creature holding the egg containing Koschei's soul can use an action to compel Koschei as if a dominate monster spell were cast on him and Koschei failed his saving throw. As long as the soul is within the needle, Koschei can't permanently die. If he is killed, his body reforms in his lair in 1d10 days. If the needle is broken, Koschei can be killed like any other creature."},{"name":"Innate Spellcasting","desc":"koschei's innate spellcasting attribute is Charisma (spell save DC 19, +11 to hit with spell attacks). He can innately cast the following spells, requiring no material components.\n\nat will: detect magic, phantom steed, scorching ray, sending\n\n3/day each: invisibility, magic missile, shield\n\n2/day each: animate objects, cone of cold, hypnotic pattern\n\n1/day each: disintegrate, meteor swarm, true polymorph"},{"name":"Legendary Resistance (3/day)","desc":"If Koschei fails a saving throw, he can choose to succeed instead."},{"name":"Magic Weapons","desc":"Koschei's weapon attacks are magical and do an extra 14 (4d6) necrotic damage (included below)."},{"name":"Koschei's Lair Actions","desc":"on initiative count 20 (losing initiative ties), Koschei takes a lair action to cause one of the following effects; Koschei can’t use the same effect two rounds in a row:\n\n- Koschei creates a whirlwind centered on a point he can see within 100 feet. The whirlwind is 10 feet wide and up to 50 feet tall. A creature in the area of the whirlwind when it’s created, or who enters the area for the first time on a turn, must make a DC 15 Strength saving throw. On a failed save, the creature is restrained and takes 18 (4d8) bludgeoning damage fromthe buffeting wind. A restrained creature can escape from the whirlwind by using its action to repeat the saving throw; on a success, it moves 5 feet outside the area of the whirlwind. The whirlwind lasts until Koschei uses this action again or dies.\n\n- Tortured spirits appear and attack up to three creatures Koschei can see within the lair. One attack is made against each targeted creature; each attack has +8 to hit and does 10 (3d6) necrotic damage.\n\n- Koschei disrupts the flow of magic in his lair. Until initiative count 20 on the following round, any creature other than a fiend who targets Koschei with a spell must make a DC 15 Wisdom saving throw. On a failure, the creature still casts the spell, but it must target a creature other than Koschei."},{"name":"Regional Effects","desc":"the region containing Koschei’s lair is warped by Koschei’s magic, which creates one or more of the following effects:\n\n- Rabbits, ducks, and other game animals become hostile toward intruders within 5 miles of the lair. They behave aggressively, but only attack if cornered. Foraging for food by hunting is difficult and only yields half the normal amount of food.\n\n- Wind and snowstorms are common within 5 miles of the lair.\n\n- Koschei is aware of any spell cast within 5 miles of his lair. He knows the source of the magic (innate, the caster’s class, or a magic item) and knows the direction to the caster.\n\nif Koschei dies, conditions in the area surrounding his lair return to normal over the course of 1d10 days."}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"koschei","type":"fiend"}