{"name":"Lady in White","size":"Medium","subtype":"","group":null,"alignment":"any alignment","armor_class":12,"armor_desc":null,"hit_points":49,"hit_dice":"11d8","speed":{"fly":30,"hover":true,"walk":0},"strength":6,"dexterity":14,"constitution":10,"intelligence":10,"wisdom":11,"charisma":18,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":null,"skills":{},"damage_vulnerabilities":"","damage_resistances":"acid, fire, lightning, thunder; bludgeoning, piercing, and slashing from nonmagical attacks","damage_immunities":"cold, necrotic, poison","condition_immunities":"charmed, exhaustion, frightened, grappled, paralyzed, petrified, poisoned, prone, restrained","senses":"darkvision 60 ft., passive Perception 10","languages":"any languages it knew in life","challenge_rating":"2","actions":[{"attack_bonus":4,"damage_dice":"1d4+2","desc":"Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 4 (1d4 + 2) necrotic damage, and, if the target is a Large or smaller humanoid, the lady in white attaches to it. The lady in white attaches to the target’s back, where it is unable to see the lady in white. The lady in white can detach itself by spending 5 feet of its movement. A creature, other than the target, can take its action to detach the lady in white by succeeding on a DC 14 Strength check.","name":"Grasp"},{"desc":"The lady in white makes one grasp attack against the target to which it is attached. If the attack hits, the target’s Charisma score is reduced by 1d4. The target dies if this reduces its Charisma to 0. Otherwise, the reduction lasts until the target finishes a short or long rest. If a female humanoid dies from this attack, a new lady in white rises from the corpse 1d4 hours later.","name":"Inflict Sorrow"},{"desc":"The lady in white turns invisible until it attacks, or until its concentration ends (as if concentrating on a spell).","name":"Invisibility"},{"desc":"The lady in white does away with her living disguise and reveals her undead state. Each non-undead creature within 50 feet of the lady that can see her must succeed on a DC 13 Wisdom saving throw or be frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a target’s saving throw is successful or the effect ends for it, the target is immune to the lady’s Corpse Revealed for the next 24 hours.","name":"Corpse Revealed"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"The lady in white can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object.","name":"Incorporeal Movement"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"lady-in-white","type":"undead"}