{"name":"Lorelei","size":"Medium","subtype":"","group":null,"alignment":"chaotic evil","armor_class":15,"armor_desc":"18 mage armor","hit_points":76,"hit_dice":"9d8 + 36","speed":{"walk":30,"swim":30},"strength":10,"dexterity":21,"constitution":18,"intelligence":16,"wisdom":16,"charisma":23,"strength_save":null,"dexterity_save":null,"constitution_save":8,"intelligence_save":null,"wisdom_save":null,"charisma_save":9,"perception":null,"skills":{"deception":9,"performance":9,"persuasion":9},"damage_vulnerabilities":"","damage_resistances":"","damage_immunities":"","condition_immunities":"","senses":"darkvision 60 ft., passive Perception 13","languages":"Common, Sylvan","challenge_rating":"5","actions":[{"name":"Dagger","desc":"Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 7 (1d4 + 5) piercing damage.","attack_bonus":8,"damage_dice":"1d4"},{"name":"Charm","desc":"The lorelei targets one humanoid she can see within 30 feet of her. If the target can see or hear the lorelei, it must succeed on a DC 17 Wisdom saving throw against this magic or be charmed by the lorelei. The charmed target regards the lorelei as its one, true love, to be heeded and protected. Although the target isn't under the lorelei's control, it takes the lorelei's requests or actions in the most favorable way it can. Each time the lorelei or her companions cause the target to take damage, directly or indirectly, it repeats the saving throw, ending the effect on itself on a success. Otherwise, the effect lasts 24 hours or until the lorelei is killed, is on a different plane of existence than the target, or takes a bonus action to end the effect."},{"name":"Stunning Glance","desc":"The lorelei mentally disrupts a creature within 30 feet with a look. The target must succeed on a DC 17 Wisdom saving throw or be stunned for 2 rounds. Anyone who successfully saves against this effect cannot be affected by it from the same lorelei for 24 hours."}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Alluring Presence","desc":"All humanoids within 30 feet of a lorelei who look directly at her must succeed on a DC 17 Charisma saving throw or be drawn to her in the most direct path, regardless of the danger. This compulsion fades once the person gets within 5 feet of the lorelei. A creature can avoid this effect for one full round by choosing to avert its eyes at the start of its turn, but it then has disadvantage on any attacks or other rolls directed against the lorelei until the start of its next turn. A lorelei can suppress or resume this ability as a bonus action. Anyone who successfully saves against this effect cannot be affected by it from the same lorelei for 24 hours."},{"name":"Unearthly Grace","desc":"A lorelei applies her Charisma modifier to all of her saving throws in place of the normal ability modifier."},{"name":"Water Spirit","desc":"The lorelei is under the effect of freedom of movement whenever she is in contact with a body of water."},{"name":"Spellcasting","desc":"the lorelei is an 8th-level spellcaster. Her spellcasting ability is Charisma (spell save DC 17, +9 to hit with spell attacks). She requires no material components to cast her spells. The lorelei has the following sorcerer spells prepared:\n\ncantrips (at will): detect magic, guidance, light, mending, poison spray, prestidigitation\n\n1st level (4 slots): comprehend languages, fog cloud, mage armor, ray of sickness\n\n2nd level (3 slots): hold person, misty step, suggestion\n\n3rdlevel (3 slots): hypnotic pattern, gaseous form, water walk\n\n4th level (2 slots): dominate beast, ice storm"}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"lorelei","type":"fey"}