{"name":"Mammon","size":"Huge","subtype":"devil","group":null,"alignment":"lawful evil","armor_class":20,"armor_desc":"natural armor","hit_points":378,"hit_dice":"28d12 + 196","speed":{"walk":50},"strength":22,"dexterity":13,"constitution":24,"intelligence":23,"wisdom":21,"charisma":26,"strength_save":null,"dexterity_save":9,"constitution_save":null,"intelligence_save":14,"wisdom_save":13,"charisma_save":16,"perception":13,"skills":{"deception":16,"insight":13,"perception":13,"persuasion":16},"damage_vulnerabilities":"","damage_resistances":"cold","damage_immunities":"fire, poison; bludgeoning, piercing, and slashing from weapons that aren't silvered","condition_immunities":"charmed, exhaustion, frightened, poisoned","senses":"truesight 120 ft., passive Perception 23","languages":"all, telepathy 120 ft.","challenge_rating":"25","actions":[{"name":"Multiattack","desc":"Mammon makes three attacks."},{"name":"Purse","desc":"Melee Weapon Attack: +14 to hit, reach 10 ft., one target. Hit: 19 (3d8 + 6) bludgeoning damage plus 18 (4d8) radiant damage","attack_bonus":14,"damage_dice":"7d8+6"},{"name":"Molten Coins","desc":"Ranged Weapon Attack: +14 to hit, range 40/120 ft., one target. Hit: 16 (3d6 + 6) bludgeoning damage plus 18 (4d8) fire damage.","attack_bonus":14,"damage_dice":"3d6"},{"name":"Your Weight In Gold (Recharge 5-6)","desc":"Mammon can use this ability as a bonus action immediately after hitting a creature with his purse attack. The creature must make a DC 24 Constitution saving throw. If the saving throw fails by 5 or more, the creature is instantly petrified by being turned to solid gold. Otherwise, a creature that fails the saving throw is restrained. A restrained creature repeats the saving throw at the end of its next turn, becoming petrified on a failure or ending the effect on a success. The petrification lasts until the creature receives a greater restoration spell or comparable magic."}],"reactions":"","legendary_desc":"Mammon can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. Mammon regains spent legendary actions at the start of his turn.","legendary_actions":[{"name":"Attack","desc":"Mammon makes one purse or molten coins attack."},{"name":"Make It Rain!","desc":"Mammon casts gold and jewels into a 5-foot radius within 60 feet. One creature within 60 feet of the treasure that can see it must make a DC 24 Wisdom saving throw. On a failure, the creature must use its reaction to move its speed toward the trinkets, which vanish at the end of the turn."},{"name":"Deep Pockets (3 actions)","desc":"Mammon recharges his Your Weight In Gold ability."}],"special_abilities":[{"name":"Innate Spellcasting","desc":"mammon's innate spellcasting ability is Charisma (spell save DC 24, +16 to hit with spell attacks). He can innately cast the following spells, requiring no material components:\n\nat will: charm person, detect magic, dispel magic, fabricate (Mammon can create valuable objects), heat metal, magic aura\n\n3/day each: animate objects, counterspell, creation, instant summons, legend lore, teleport\n\n1/day each: imprisonment (minimus containment only, inside gems), sunburst"},{"name":"Legendary Resistance (3/day)","desc":"If Mammon fails a saving throw, he can choose to succeed instead."},{"name":"Magic Resistance","desc":"Mammon has advantage on saving throws against spells and other magical effects."},{"name":"Magic Weapons","desc":"Mammon's weapon attacks are magical."},{"name":"Mammon's Lair","desc":"on initiative count 20 (losing initiative ties), Mammon takes a lair action to cause one of the following effects; Mammon can’t use the same effect two rounds in a row:\n\n- Mammon infuses a pile of treasure in his lair with life. It becomes an earth elemental made of precious metals and gems. The elemental acts immediately and lasts until destroyed or until Mammon uses this action again.\n\n- Stacked piles of treasure shift and slide, collapsing onto a creature Mammon can see. The creature is restrained until initiative count 20 on the following round, or until it or an adjacent ally uses an action to make a successful DC 18 Strength check to free it.\n\n- Mammon magically teleports from one area of treasure to another within 150 feet."},{"name":"Regional Effects","desc":"the region containing Mammon’s lair is warped by the archdevil’s magic, which creates one or more of the following effects:\n\n- Treasure in the possession of creatures other than Mammon turns to worthless materials such as lead, wood, or gravel, after spending 24 hours within 1 mile of the lair. The resulting junk resumes its valuable form when Mammon claims it, or by means of a wish spell or comparable magic.\n\n- Creatures that spend more than 1 hour within 1 mile of Mammon’s lair become obsessed with gaining the most generous payment or portion of wealth in any dealing unless they succeed on a DC 18 Wisdom saving throw. A creature that saves successfully is immune to this effect for 24 hours. The effect can be removed by a greater restoration spell or comparable magic.\n\n- Any naturally occurring treasure in Mammon’s home plane reverts to worthless junk if removed from the plane. Similarly, any mundane item left behind transforms into something fantastically valuable, as long as it remains on the plane.\n\nif Mammon dies, conditions in the area surrounding the lair return to normal over the course of 1d10 days."}],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"mammon","type":"fiend"}