{"name":"Mask Wight","size":"Medium","subtype":"","group":null,"alignment":"neutral evil","armor_class":19,"armor_desc":"natural armor","hit_points":207,"hit_dice":"18d8 + 126","speed":{"walk":40},"strength":22,"dexterity":18,"constitution":24,"intelligence":15,"wisdom":16,"charisma":18,"strength_save":11,"dexterity_save":9,"constitution_save":12,"intelligence_save":7,"wisdom_save":8,"charisma_save":9,"perception":null,"skills":{},"damage_vulnerabilities":"","damage_resistances":"acid, fire, lightning, cold; bludgeoning, piercing, and slashing from nonmagical weapons","damage_immunities":"necrotic, poison","condition_immunities":"charmed, frightened, paralyzed, petrified, poisoned, stunned, unconscious","senses":"darkvision 60 ft., truesight 30 ft., passive Perception 13","languages":"Common, Giant, Infernal","challenge_rating":"13","actions":[{"name":"Multiattack","desc":"The mask wight makes one Khopesh of Oblivion attack and one Enervating Spiked Gauntlet attack."},{"name":"Khopesh of Oblivion","desc":"Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 19 (3d8 + 6) slashing damage, and the target must succeed on a DC 17 Wisdom saving throw or some cherished material thing disappears from the universe, and only the target retains any memory of it. This item can be as large as a building, but it can't be a living entity and it can't be on the target's person or within the target's sight.","attack_bonus":11,"damage_dice":"3d8"},{"name":"Enervating Spiked Gauntlet","desc":"Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 19 (2d12 + 6) bludgeoning damage plus 11 (2d10) necrotic damage, and the target must succeed on a DC 17 Wisdom saving throw or gain 1 level of exhaustion. The target recovers from all exhaustion caused by the enervating spiked gauntlet at the end of its next long rest.","attack_bonus":11,"damage_dice":"2d12"},{"name":"Wail of the Forgotten (Recharge 6)","desc":"The mask wight emits an ear-piercing wail. All creatures within 30 feet of the wight take 65 (10d12) thunder damage and are permanently deafened; a successful DC 17 Charisma saving throw reduces damage to half and limits the deafness to 1d4 hours. Targets slain by this attack are erased from the memories of every creature in the planes, all written or pictorial references to the target fade away, and its body is obliterated.the only exception is those who personally witnessed the death. Restoring such a slain creature requires a wish or divine intervention; no mortal remembers the creature's life or death."}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Innate Spellcasting","desc":"the wight's innate spellcasting ability is Charisma (spell save DC 17). It can innately cast the following spells, requiring no material components:\n\nat will: alter self\n\n1/day each: counterspell, dispel magic, enlarge/reduce, spider climb, tongues\n\n1/week: gate"},{"name":"Single-minded Purpose","desc":"The wight has advantage on attack rolls against followers of the fiend it is tasked to destroy and those in its target's employ (whether or not they are aware of their employer), as well as the fiend itself."}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"mask-wight","type":"undead"}