{"name":"Moon Drake","size":"Medium","subtype":"","group":null,"alignment":"neutral","armor_class":15,"armor_desc":null,"hit_points":76,"hit_dice":"9d8+36","speed":{"fly":100,"walk":25},"strength":10,"dexterity":20,"constitution":19,"intelligence":13,"wisdom":18,"charisma":14,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":null,"skills":{"arcana":4,"insight":7},"damage_vulnerabilities":"varies (see Moonbound)","damage_resistances":"varies (see Moonbound)","damage_immunities":"","condition_immunities":"paralyzed, unconscious","senses":"darkvision 120 ft., passive Perception 14","languages":"Celestial, Common, Draconic","challenge_rating":"5","actions":[{"desc":"The moon drake makes three attacks: one with its bite and two with its claws.","name":"Multiattack"},{"attack_bonus":8,"damage_dice":"2d6+5","desc":"Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 12 (2d6 + 5) piercing damage plus 5 (1d10) radiant damage. A shapechanger that takes radiant damage from this attack instantly reverts to its true form and can’t assume a different form for 1d4 rounds.","name":"Bite"},{"attack_bonus":8,"damage_dice":"1d6+5","desc":"Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 8 (1d6 + 5) slashing damage.","name":"Claw"},{"desc":"Melee Weapon Attack: +6 to hit, reach 5 ft., one creature afflicted with lycanthropy. Hit: The target must succeed on a DC 15 Constitution saving throw or be cured of lycanthropy (it can willingly fail this save). This attack can’t cure a natural born lycanthrope of the curse of lycanthropy.","name":"Moonlight Nip"},{"desc":"The drake exhales searing moonlight in a 60-foot line that is 5 feet wide. Each creature in that area must make a DC 15 Constitution saving throw, taking 33 (6d10) radiant damage on a failed save, or half as much damage on a successful one. A shapechanger makes its saving throw with disadvantage. If it fails, it also instantly reverts to its true form and can’t assume a different form for 1d4 rounds.","name":"Lunarbeam (Recharge 5-6)"}],"reactions":[{"desc":"When the moon drake takes damage or is restrained, it can transmute its physical form into an incorporeal form of pure moonlight until the end of its next turn. While in this form, it has resistance to cold, fire, and lightning damage and immunity to bludgeoning, piercing, and slashing damage from nonmagical attacks. While in this form, the drake can pass through openings at least 1 inch wide and through transparent objects. It takes 5 (1d10) force damage if it ends its turn inside an object.","name":"Form of Moonlight"}],"legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"The moon drake’s saliva can be bottled, distilled, and used in 1-ounce doses. An afflicted lycanthrope that drinks this concoction is instantly cured of lycanthropy, requiring no saving throw. This draught can’t cure a natural-born lycanthrope of the curse of lycanthropy.","name":"Curative Saliva"},{"desc":"A moon drake’s power waxes and wanes with the moon. Under a full moon, it has resistance to bludgeoning, piercing, and slashing damage from nonmagical attacks and its weapon attacks deal an additional 3 (1d6) radiant damage. Under a new moon, it has vulnerability to bludgeoning, piercing, and slashing damage. Under any other moon, it gains no extra traits.","name":"Moonbound"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"moon-drake","type":"dragon"}