{"name":"Myling","size":"Small","subtype":"","group":null,"alignment":"chaotic evil","armor_class":13,"armor_desc":"natural armor","hit_points":45,"hit_dice":"10d6 + 10","speed":{"walk":30,"burrow":10},"strength":15,"dexterity":10,"constitution":12,"intelligence":10,"wisdom":12,"charisma":10,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":null,"skills":{"stealth":4},"damage_vulnerabilities":"","damage_resistances":"bludgeoning, piercing, and slashing from nonmagical weapons that aren't silvered","damage_immunities":"necrotic, poison","condition_immunities":"charmed, frightened, poisoned, stunned, unconscious","senses":"darkvision 60 ft., passive Perception 11","languages":"Common","challenge_rating":"2","actions":[{"name":"Multiattack","desc":"The myling makes one bite and two claw attacks."},{"name":"Bite","desc":"Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 7 (2d4 + 2) piercing damage, and the target is grappled (escape DC 12). If the target was grappled by the myling at the start of the myling's turn, the bite attack hits automatically.","attack_bonus":4,"damage_dice":"2d4"},{"name":"Claw","desc":"Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 8 (2d6 + 1) slashing damage.","attack_bonus":4,"damage_dice":"2d6"},{"name":"Buried Alive","desc":"If the myling starts its turn on its chosen burial ground, it sinks into the earth. If it has a creature grappled, that creature sinks with the myling. A Medium or larger creature sinks up to its waist; a Small creature sinks up to its neck. If the myling still has the victim grappled at the start of the myling's next turn, both of them disappear into the earth. While buried this way, a creature is considered stunned. It can free itself with a successful DC 20 Strength (Athletics) check, but only one check is allowed; if it fails, the creature is powerless to aid itself except with magic. The creature must also make a DC 10 Constitution saving throw; if it succeeds, the creature has a lungful of air and can hold its breath for (Constitution modifier + 1) minutes before suffocation begins. Otherwise, it begins suffocating immediately. Allies equipped with digging tools can reach it in four minutes divided by the number of diggers; someone using an improvised tool (a sword, a plate, bare hands) counts as only one-half of a digger."}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":"","spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"myling","type":"undead"}