{"name":"Nichny","size":"Medium","subtype":"","group":null,"alignment":"neutral evil","armor_class":17,"armor_desc":"natural armor","hit_points":112,"hit_dice":"15d8 + 45","speed":{"walk":30,"climb":30},"strength":17,"dexterity":19,"constitution":17,"intelligence":18,"wisdom":18,"charisma":19,"strength_save":null,"dexterity_save":7,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":7,"skills":{"acrobatics":7,"insight":7,"perception":7},"damage_vulnerabilities":"","damage_resistances":"acid, cold, fire, lightning; bludgeoning, piercing, and slashing from nonmagical weapons that aren't silvered","damage_immunities":"poison","condition_immunities":"charmed, frightened, paralyzed, poisoned, unconscious","senses":"darkvision 60 ft., passive Perception 17","languages":"Elvish, Primordial, Sylvan, Void Speech","challenge_rating":"6","actions":[{"name":"Multiattack","desc":"The nichny makes two claw attacks."},{"name":"Claw","desc":"Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 17 (2d12 + 4) slashing damage.","attack_bonus":7,"damage_dice":"2d12"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Freedom of Movement","desc":"A nichny ignores difficult terrain and cannot be entangled, grappled, or otherwise impeded in its movements as if it is under the effect of a constant freedom of movement spell. This ability is negated for grapple attempts if the attacker is wearing gold or orichalcum gauntlets or using a gold or orichalcum chain as part of its attack."},{"name":"Imbue Luck (1/Day)","desc":"Nichny can enchant a small gem or stone to bring good luck. If the nichny gives this lucky stone to another creature, the bearer receives a +1 bonus to all saving throws for 24 hours."},{"name":"Innate Spellcasting","desc":"the nichny's innate spellcasting ability is Charisma (spell save DC 15, +7 to hit with spell attacks). It can innately cast the following spells, requiring no material components:\n\nat Will: detect magic, invisibility, magic missile, ray of frost\n\n3/day each: blink, dimension door, haste, polymorph (self only)\n\n1/day each: teleport, word of recall"},{"name":"Luck Aura","desc":"A nichny is surrounded by an aura of luck. All creatures it considers friends within 10 feet of the nichny gain a +1 bonus to attack rolls, saving throws, and ability checks. Creatures that it considers its enemies take a -1 penalty to attack rolls, saving throws, and ability checks. The nichny can activate or suppress this aura on its turn as a bonus action."},{"name":"Magic Resistance","desc":"The nichny has advantage on saving throws against spells and other magical effects."},{"name":"Soothsaying","desc":"Once per week, a nichny can answer up to three questions about the past, present, or future. All three questions must be asked before the nichny can give its answers, which are short and may be in the form of a paradox or riddle. One answer always is false, and the other two must be true."}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"nichny","type":"fey"}