{"name":"One-Headed Clockwork Dragon","size":"Large","subtype":"","group":null,"alignment":"unaligned","armor_class":16,"armor_desc":"natural armor","hit_points":178,"hit_dice":"17d10+85","speed":{"fly":50,"walk":30},"strength":22,"dexterity":10,"constitution":20,"intelligence":10,"wisdom":10,"charisma":1,"strength_save":9,"dexterity_save":null,"constitution_save":8,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":6,"skills":{"athletics":9,"perception":6},"damage_vulnerabilities":"","damage_resistances":"","damage_immunities":"poison, psychic","condition_immunities":"charmed, exhaustion, frightened, paralyzed, petrified, poisoned","senses":"darkvision 60 ft., passive Perception 16","languages":"understands Common but can’t speak","challenge_rating":"8","actions":[{"desc":"The dragon can use its Oil Spray. It then makes three attacks: one with its bite and two with its fists.","name":"Multiattack"},{"attack_bonus":9,"damage_dice":"2d10+6","desc":"Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 17 (2d10 + 6) piercing damage plus 3 (1d6) fire damage.","name":"Bite"},{"attack_bonus":9,"damage_dice":"2d6+6","desc":"Melee Weapon Attack: +9 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) bludgeoning damage.","name":"Fist"},{"desc":"The dragon exhales fire in a 30-foot cone. Each creature in that area must make a DC 16 Dexterity saving throw, taking 35 (10d6) fire damage on a failed save, or half as much damage on a successful one.","name":"Fire Breath (Recharge 6)"},{"desc":"The dragon sprays oil in a 30-foot-cone. Each creature in the area must succeed on a DC 16 Dexterity saving throw or become vulnerable to fire damage until the end of the dragon’s next turn.","name":"Oil Spray"},{"desc":"The dragon swings its bladed tail. Each creature within 10 feet of the dragon must make a DC 17 Dexterity saving throw, taking 15 (2d8 + 6) slashing damage on a failed save, or half as much damage on a successful one.","name":"Tail Sweep"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"The dragon is magically bound to three circlets. As long as the dragon is within 1 mile of a circlet wearer on the same plane of existence, the wearer can communicate telepathically with the dragon. While the dragon is active, the wearers see through its eyes and hear what it hears. During this time, the wearers are deaf and blind with regard to their own senses. \n\nIf only two circlet wearers are within 1 mile of the active dragon, each hour spent wearing the circlets imposes one level of exhaustion on those wearers. If only a single wearer is within 1 mile of the active dragon, each minute spent wearing the circlet gives that wearer one level of exhaustion. If no circlet wearers are within 1 mile of the dragon, it views all creatures it can see as enemies and tries to destroy them until a circlet wearer communicates with the dragon or the dragon is destroyed. A circlet wearer can use its action to put the dragon in an inactive state where it becomes incapacitated until a wearer uses an action to switch the dragon to active. \n\nEach circlet is a magic item that must be attuned.","name":"Bound"},{"desc":"The dragon is immune to any spell or effect that would alter its form.","name":"Immutable Form"},{"desc":"The dragon has advantage on saving throws against spells and other magical effects.","name":"Magic Resistance"},{"desc":"The dragon deals double damage to objects and structures.","name":"Siege Monster"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"one-headed-clockwork-dragon","type":"construct"}