{"name":"Piasa","size":"Large","subtype":"","group":null,"alignment":"unaligned","armor_class":15,"armor_desc":"natural armor","hit_points":144,"hit_dice":"17d10+51","speed":{"fly":80,"walk":40},"strength":18,"dexterity":11,"constitution":16,"intelligence":9,"wisdom":12,"charisma":7,"strength_save":null,"dexterity_save":3,"constitution_save":6,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":4,"skills":{"athletics":7,"perception":4,"stealth":3},"damage_vulnerabilities":"poison","damage_resistances":"","damage_immunities":"","condition_immunities":"","senses":"blindsight 15 ft., darkvision 120 ft., passive Perception 14","languages":"Draconic","challenge_rating":"6","actions":[{"desc":"The piasa can use its Frightful Presence. It then makes three attacks: one with its bite or tail and two with its claws.","name":"Multiattack"},{"attack_bonus":7,"damage_dice":"2d10+4","desc":"Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 15 (2d10 + 4) piercing damage.","name":"Bite"},{"attack_bonus":7,"damage_dice":"2d6+4","desc":"Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) slashing damage.","name":"Claw"},{"attack_bonus":7,"damage_dice":"2d8+4","desc":"Melee Weapon Attack: +7 to hit, reach 15 ft., one target. Hit: 13 (2d8 + 4) piercing damage. If the target is a Medium or smaller creature, it is grappled (escape DC 15). Until this grapple ends, the target is restrained and the piasa can’t make tail attacks against other targets. When the piasa moves, any Medium or smaller creature it is grappling moves with it.","name":"Tail"},{"desc":"Each creature of the piasa’s choice that is within 120 feet of the dragon and aware of it must succeed on a DC 15 Wisdom saving throw or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature’s saving throw is successful or the effect ends for it, the creature is immune to the piasa’s Frightful Presence for the next 24 hours.","name":"Frightful Presence"},{"desc":"The piasa exhales sleep gas in a 30-foot cone. Each creature in that area must succeed on a DC 15 Constitution saving throw or fall unconscious for 10 minutes. This effect ends for a creature if the creature takes damage or someone uses an action to wake it.","name":"Sleep Breath (Recharge 5-6)"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"The piasa’s spiked tail is segmented and up to three times the length of its body. When the piasa takes 25 or more damage in a single turn, a segment of its tail is severed. When the first segment is severed, the tail attack’s damage type changes from piercing to bludgeoning and deals 1d8 less damage. When the second segment is severed, the tail attack no longer deals damage, but it can still grapple. When the third segment is severed, the piasa can’t make tail attacks. The tail re-grows at a rate of one segment per long rest.","name":"Segmented Tail"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"piasa","type":"dragon"}