{"name":"Pillar of the Lost Magocracy","size":"Huge","subtype":"","group":null,"alignment":"chaotic neutral","armor_class":14,"armor_desc":"natural armor","hit_points":90,"hit_dice":"12d12+12","speed":{"walk":0},"strength":9,"dexterity":1,"constitution":13,"intelligence":18,"wisdom":8,"charisma":13,"strength_save":null,"dexterity_save":null,"constitution_save":3,"intelligence_save":null,"wisdom_save":1,"charisma_save":null,"perception":null,"skills":{"arcana":6,"history":6},"damage_vulnerabilities":"","damage_resistances":"bludgeoning, piercing, and slashing from nonmagical attacks","damage_immunities":"poison","condition_immunities":"charmed, exhaustion, frightened, paralyzed, petrified, poisoned","senses":"darkvision 120 ft., passive Perception 9","languages":"understands Common but can’t speak, telepathy 120 ft.","challenge_rating":"4","actions":[{"desc":"The pillar of lost magocracy unleashes a random magical attack on a target or area within 120 feet. Roll a d4 to determine the effect:\n1. Mutant Plants. Grasping tendrils of alien vegetation sprout from the ground in a 20-foot radius centered on a point the pillar can see within 120 feet. The area becomes difficult terrain, and each creature in the area must succeed on a DC 14 Strength saving throw or become restrained. Treat as an entangle spell, except it only lasts for 2d4 rounds.\n2. Acid Rain. Corrosive acid falls from the sky centered on a point the pillar can see within 120 feet. Each creature in a 20-foot-radius, 40-foot-high cylinder must make a DC 14 Dexterity saving throw, taking 13 (3d8) acid damage on a failed save, or half as much damage on a successful one.\n3. Noxious Cloud. The pillar creates a 20-foot-radius sphere of reddish, stinging mist centered on a point it can see within 120 feet. The area is heavily obscured, and each creature inside the cloud at the start of its turn must make a DC 14 Constitution saving throw. On a failed save, the creature takes 13 (3d8) poison damage and is blinded until the start of its next turn. On a success, the creature takes half the damage and isn’t blinded. The cloud lasts for 1d4 rounds.\n4. Shrinking Ray. A bright green ray strikes a single creature within 120 feet. The creature must succeed on a DC 14 Constitution saving throw or be shrunk to half its size. Treat as an enlarge/reduce spell, except it lasts for 2d4 rounds.","name":"Anger of the Ancient Mage"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"The pillar uses its Intelligence instead of its Dexterity to determine its place in the initiative order.","name":"Mental Agility"},{"desc":"A creature that touches the pillar or hits it with a melee attack while within 5 feet of it takes 3 (1d6) lightning damage.","name":"Shocking Vengeance"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"pillar-of-the-lost-magocracy","type":"construct"}