{"name":"Psoglav Demon","size":"Large","subtype":"demon","group":null,"alignment":"chaotic evil","armor_class":17,"armor_desc":"natural armor","hit_points":115,"hit_dice":"11d10 + 55","speed":{"walk":40,"fly":60},"strength":21,"dexterity":23,"constitution":20,"intelligence":16,"wisdom":19,"charisma":18,"strength_save":null,"dexterity_save":9,"constitution_save":8,"intelligence_save":null,"wisdom_save":7,"charisma_save":7,"perception":6,"skills":{"acrobatics":9,"intimidation":7,"perception":6,"stealth":9},"damage_vulnerabilities":"","damage_resistances":"cold, lightning","damage_immunities":"fire, poison","condition_immunities":"poisoned","senses":"blindsight 30 ft., darkvision 60 ft., passive Perception 16","languages":"Common, Infernal; telepathy 60 ft.","challenge_rating":"7","actions":[{"name":"Multiattack","desc":"The psoglav demon makes three bite attacks."},{"name":"Bite","desc":"Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 18 (2d12 + 5).","attack_bonus":8,"damage_dice":"2d12"},{"name":"Shadow Stealing Ray (Recharge 5-6)","desc":"The psoglav emits a beam from its single eye. One target within 60 feet of the psoglav is hit automatically by the ray. The target is knocked 20 feet back and must succeed on a DC 15 Dexterity saving throw or be knocked prone. The target's shadow stays in the space the target was originally in, and acts as an undead shadow under the command of the psoglav demon. If the creature hit with the shadow stealing ray flees the encounter, it is without a natural shadow for 1d12 days before the undead shadow fades and the creature's natural shadow returns. The undead shadow steals the body of its creature of origin if that creature is killed during the encounter; in that case, the creature's alignment shifts to evil and it falls under the command of the psoglav. The original creature regains its natural shadow immediately if the undead shadow is slain. A creature can only have its shadow stolen by the shadow stealing ray once per day, even if hit by the rays of two different psoglav demons, but it can be knocked back by it every time it is hit."}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Innate Spellcasting","desc":"the psoglav's innate spellcasting ability is Charisma (spell save DC 15). It can innately cast the following spell, requiring no material components:\n\n1/day: greater invisibility"},{"name":"Magic Weapon","desc":"The psoglav's weapon attacks are magical."},{"name":"Shadow Door (4/Day)","desc":"The psoglav has the ability to travel between shadows as if by means of a dimension door spell. The magical transport must begin and end in an area with at least some dim light. The shadow door can span a maximum of 90 feet."}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"psoglav-demon","type":"fiend"}