{"name":"Queen Of Witches","size":"Large","subtype":"","group":null,"alignment":"neutral","armor_class":18,"armor_desc":"natural armor","hit_points":123,"hit_dice":"13d10 + 52","speed":{"hover":true,"walk":40,"fly":50},"strength":22,"dexterity":10,"constitution":19,"intelligence":16,"wisdom":18,"charisma":22,"strength_save":null,"dexterity_save":6,"constitution_save":null,"intelligence_save":null,"wisdom_save":10,"charisma_save":12,"perception":10,"skills":{"arcana":9,"deception":12,"history":9,"insight":10,"perception":10},"damage_vulnerabilities":"","damage_resistances":"fire, cold; bludgeoning, piercing, and slashing damage from weapons that aren't cold iron","damage_immunities":"radiant","condition_immunities":"blinded, charmed, frightened","senses":"truesight 60 ft., passive Perception 19","languages":"Celestial, Common, Draconic, Elvish, Sylvan, Umbral","challenge_rating":"17","actions":[{"name":"Multiattack","desc":"Nicnevin makes two attacks, or makes one attack and casts a spell."},{"name":"Moonsilver Ring","desc":"Melee Weapon Attack: +12 to hit, reach 10 ft., one target. Hit: 15 (2d8 + 6) bludgeoning damage plus 10 (3d6) radiant damage. The moonsilver ring is a magical weapon.","attack_bonus":12,"damage_dice":"2d8"},{"name":"Blast","desc":"Ranged Spell Attack: +12 to hit, range 120 ft., one target. Hit: 11 (1d10 + 6) force damage. A creature hit by a blast must succeed on a DC 19 Strength saving throw or be pushed 10 feet directly away from Nicnevin.","attack_bonus":12,"damage_dice":"1d10"}],"reactions":"","legendary_desc":"Nicnevin can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. Nicnevin regains spent legendary actions at the start of its turn.","legendary_actions":[{"name":"Attack","desc":"Nicnevin makes one attack."},{"name":"Spell (2 actions)","desc":"Nicnevin casts a spell."},{"name":"Teleport","desc":"Nicnevin magically teleports to an unoccupied space she can see within 40 feet."}],"special_abilities":[{"name":"Absorb the Weave","desc":"When Nicnevin counters or dispels a spell, she heals damage equal to twice the spell level."},{"name":"Innate Spellcasting","desc":"nicnevin's spellcasting attribute is Charisma (save DC 19, +12 to hit with spell attacks). She can innately cast the following spells, requiring no material components:\n\nat will: faerie fire, hex, misty step, silent image, tongues\n\n3/day each: chain lightning, counterspell, dispel magic, hypnotic pattern, teleportation circle\n\n2/day each: bestow curse, feeblemind, mass suggestion, flesh to stone\n\n1/day each: power word kill, sleep (9th level), true polymorph"},{"name":"Magic Resistance","desc":"Nicnevin has advantage on saving throws against spells and other magical effects."},{"name":"Legendary Resistance (3/day)","desc":"If Nicnevin fails a saving throw she can choose to succeed instead."},{"name":"Token of Favor","desc":"As an action, Nicnevin can cut a lock of her copper hair and twist it into a token for a creature she chooses. As long as that creature carries the token, it gains the magic resistance trait (see above). Nicnevin can revoke her favor at any time as a bonus action. When that happens, the creature loses the benefit of the token and, if Nicnevin wishes, the creature also has disadvantage on saving throws against spells and other magical effects for 24 hours."},{"name":"The Queen of Witches's Lair","desc":"on initiative count 20 (losing initiative ties), Nicnevin takes a lair action to cause one of the following effects; Nicnevin can’t use the same effect two rounds in a row:\n\n- Nicnevin causes a searing flare of moonlight to burst from a point she can see within 100 feet. All creatures Nicnevin chooses within 30 feet of that point take 13 (3d8) radiant damage, or half damage with a successful DC 15 Wisdom saving throw. Creatures not in their natural form have disadvantage on the saving throw, and if they fail, they revert to their natural form immediately (this does not affect any shape-changing effect created by Nicnevin).\n\n- A wall of softly glowing crystal springs up from a solid surface in the lair. The wall is 60 feet long, 10 feet high, 5 feet thick, blocks line of sight, and sheds dim light out to 10 feet. Creatures within the wall’s area when it appears must succeed on a DC 15 Dexterity saving throw or take 14 (4d6) radiant damage. The creature is pushed out of the wall’s space to whichever side it chooses. Each 5-foot section of the wall has AC 15, 10 hit points, resistance to fire, slashing, and piercing damage, immunity to poison and psychic damage, and vulnerability to thunder. The wall lasts until Nicnevin uses this action again or dies.\n\n- Until initiative count 20 on the following round, any creatures other than fey who attempt to cast a spell must succeed on a DC 15 Constitution saving throw or the spell fails and the spell slot is expended. A creature becomes aware of this effect the moment it begins casting a spell, and it can choose to take a different action instead."},{"name":"Regional Effects","desc":"the region containing Nicnevin’s lair is warped by the queen’s magic, which creates one or more of the following effects:\n\n- Calling Nicnevin’s name under the light of the moon within 10 miles of her lair draws Nicnevin’s attention (as if she cast a scrying spell). She may visit the supplicant and hear a request, especially if the request is repeated on multiple nights. For 24 hours after the invocation, Nicenvin has a connection to the area that allows her to target it with teleportation circle.\n\n- Despite the weather, the moon is always visible for most of the night within 10 miles of the lair. Cloud cover has many breaks, or the moon’s light sharply penetrates the clouds.\n\n- Silvery fog is common within 10 miles of the lair, and strange whispers are heard within the mist.\n\nif Nicnevin dies, conditions in the area surrounding the lair return to normal over the course of 1d10 days."}],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"queen-of-witches","type":"fey"}