{"name":"Queen Of Night And Magic","size":"Medium","subtype":"","group":null,"alignment":"neutral evil","armor_class":15,"armor_desc":"18 with mage armor","hit_points":180,"hit_dice":"24d8 + 72","speed":{"hover":true,"walk":30,"fly":60},"strength":12,"dexterity":20,"constitution":17,"intelligence":20,"wisdom":18,"charisma":26,"strength_save":null,"dexterity_save":null,"constitution_save":10,"intelligence_save":null,"wisdom_save":11,"charisma_save":null,"perception":11,"skills":{"arcana":12,"deception":15,"intimidation":15,"perception":11,"stealth":12},"damage_vulnerabilities":"","damage_resistances":"fire, lightning","damage_immunities":"cold; bludgeoning, piercing, and slashing from weapons that aren't made of cold iron","condition_immunities":"charmed, frightened","senses":"truesight 120 ft., passive Perception 21","languages":"Celestial, Common, Elvish, Sylvan, Umbral; telepathy 120 ft.","challenge_rating":"21","actions":[{"name":"Multiattack","desc":"The Queen of Night and Magic makes three attacks with her rapier or with star strike."},{"name":"Rapier","desc":"Melee Weapon Attack: +12 to hit, reach 5 ft., one target. Hit: 9 (1d8 + 5) piercing damage plus 10 (3d6) cold damage.","attack_bonus":12,"damage_dice":"1d8"},{"name":"Shadow Rift (Recharge 5-6)","desc":"The Queen of Night and Magic creates a shadowy rift in a 20-foot sphere centered on a point she can see within 150 feet. Any creature within the rift takes 72 (16d8) cold damage, or half damage with a successful DC 23 Constitution saving throw. Creatures that fail the saving throw are also restrained by icy wisps of shadow. A restrained creature repeats the saving throw at the end of its turn, ending the restrained condition on a success."},{"name":"Star Strike","desc":"Ranged Spell Attack: +15 to hit, range 120 ft., one target. Hit: 9 (2d8) fire damage plus 9 (2d8) radiant damage.","attack_bonus":15,"damage_dice":"2d8"},{"name":"Teleport","desc":"The Queen of Night and Magic teleports to an unoccupied space up to 60 feet away."},{"name":"Unravel","desc":"The Queen of Night and Magic targets a creature, object, or magical effect that she can see. For every spell affecting the target, the Queen makes a Charisma check; the DC equals 10 + the spell's level. On a success, the spell is dispelled."}],"reactions":[{"name":"Sudden Fraying","desc":"When the Queen of Night and Magic is targeted by a spell or included in a spell's area, she can use her Unravel ability on it. The Queen does not need to see a spell to target it with this reaction, but she must be able to see at least some portion of an area or object affected by the spell."}],"legendary_desc":"The Queen of Night and Magic can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The Queen of Night and Magic regains spent legendary actions at the start of her turn.","legendary_actions":[{"name":"Cantrip","desc":"The Queen of Night and Magic casts a cantrip."},{"name":"Swirling Stars","desc":"The Queen of Night and Magic makes one star strike attack. Having a foe within 5 feet of the Queen doesn't cause this attack to be made with disadvantage."},{"name":"Teleport","desc":"The Queen of Night and Magic uses her Teleport ability."},{"name":"Spell (2 actions)","desc":"The Queen of Night and Magic casts a spell."}],"special_abilities":[{"name":"Legendary Resistance (3/day)","desc":"If the Queen of Night and Magic fails a saving throw, she can choose to succeed instead."},{"name":"Magic Resistance","desc":"The Queen of Night and Magic has advantage on saving throws against spells and other magical effects."},{"name":"Shadowborn","desc":"When in lighting other than bright light, the Queen of Night and Magic has advantage on Dexterity (Stealth) checks made to hide, and she can hide even while being observed."},{"name":"Spellcasting","desc":"the Queen of Night and Magic is an 18th-level spellcaster. Her spellcasting ability is Charisma (spell save DC 23, +15 to hit with spell attacks). The Queen knows the following sorcerer spells:\n\ncantrips (at will): blade ward, chill touch, dancing lights, mage hand, prestidigitation, ray of frost\n\n1st level (4 slots): mage armor, magic missile, shield\n\n2nd level (3 slots): darkness, mirror image\n\n3rd level (3 slots): blink, fear\n\n4th level (3 slots): confusion, greater invisibility\n\n5th level (3 slots): cone of cold, teleportation circle\n\n6th level (1 slot): circle of death\n\n7th level (1 slot): plane shift, prismatic spray\n\n8th level (1 slot): dominate monster\n\n9th level (1 slot): meteor swarm"},{"name":"The Queen of Night and Magic's Lair","desc":"on initiative count 20 (losing initiative ties), the Queen of Night and Magic takes a lair action to cause one of the following effects; the Queen of Night and Magic can’t use the same effect two rounds in a row:\n\n- The Queen wills darkness to overpower the light. All bright light sources in the lair shed only dim light to their normal bright light radius, and dim light sources are extinguished. This lasts until the Queen dismisses the effect or dies.\n\n- An opaque wall of writhing shadows springs up from a solid surface within 120 feet of the Queen. The wall is up to 60 feet long, 10 feet high, and 5 feet thick. Each creature in the area must make a successful DC 15 Dexterity saving throw or take 18 (4d8) necrotic damage. Creatures in the wall’s space are pushed 5 feet out of the wall’s space, appearing on whichever side of the wall they choose. A creature can move through the wall, but the semimaterial shadow resists intrusion. For every foot a creature travels through the wall, it must spend 4 feet of movement. Furthermore, any creature that, during its own turn, occupies any part of the wall’s space takes 18 (4d8) necrotic damage, or half damage with a successful DC 15 Constitution saving throw. Each 10-foot section of wall has AC 5, 15 hit points, vulnerability to radiant damage, resistance to bludgeoning and piercing damage, and immunity to cold, poison, and psychic damage. The wall lasts until the Queen uses this lair action again, or until she dies.\n\n- The Queen targets one creature within 60 feet of her and assails its mind with visions of hopelessness and despair. The creature must succeed on a DC 15 Wisdom saving throw or be stunned until initiative count 20 on the next round."},{"name":"Regional Effects","desc":"the region containing the Queen of Night and Magic’s lair is warped by her magic, which creates one or more of the following effects:\n\n- Shadows come to life within 6 miles of the Queen’s lair. Most of the time these living shadows are unnerving and nothing more, but when a creature acts against the interests of the Queen, the shadows can interfere and cause any relevant die roll to be made with disadvantage.\n\n- Magic saturates the area within 6 miles of the lair, causing minor random effects similar to a prestidigitation cantrip.\n\n- The Queen of Night and Magic can cast her senses to any area containing darkness, dim light, or shadows within 6 miles of her lair, similar to a clairvoyance spell.\n\nwhile the Summer Court rules, the regional effects of the Queen’s lair extend into the Winter Palace, but they are diminished and weaker than normal. During the Winter Court’s reign, the Winter Palace is not subject to the regional effects. If the Queen of Night and Magic dies, conditions in the area surrounding the lair gradually return to normal over the course of 2d10 days."}],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"queen-of-night-and-magic","type":"fey"}