{"name":"Ratatosk","size":"Tiny","subtype":"","group":null,"alignment":"chaotic neutral","armor_class":14,"armor_desc":"","hit_points":42,"hit_dice":"12d4 + 12","speed":{"walk":20,"climb":20},"strength":4,"dexterity":18,"constitution":12,"intelligence":17,"wisdom":10,"charisma":18,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":4,"charisma_save":4,"perception":null,"skills":{"deception":6,"persuasion":6,"stealth":6},"damage_vulnerabilities":"","damage_resistances":"bludgeoning, piercing, and slashing damage from nonmagical weapons","damage_immunities":"","condition_immunities":"","senses":"darkvision 60 ft., passive Perception 10","languages":"Celestial, Common; telepathy 100 ft.","challenge_rating":"4","actions":[{"name":"Gore","desc":"Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 1 piercing damage plus 14 (4d6) psychic damage and the target must make a successful DC 14 Wisdom saving throw or be charmed for 1 round. While charmed in this way, the creature regards one randomly determined ally as a foe.","attack_bonus":6,"damage_dice":"4d6"},{"name":"Divisive Chatter (recharge 5-6)","desc":"Up to six creatures within 30 feet that can hear the ratatosk must make DC 14 Charisma saving throws. On a failure, the creature is affected as if by a confusion spell for 1 minute. An affected creature repeats the saving throw at the end of each of its turns, ending the effect on itself on a success."}],"reactions":[{"name":"Desperate Lies","desc":"A creature that can hear the ratatosk must make a DC 14 Wisdom saving throw when it attacks the ratatosk. If the saving throw fails, the creature still attacks, but it must choose a different target creature. An ally must be chosen if no other enemies are within the attack's reach or range. If no other target is in the attack's range or reach, the attack is still made (and ammunition or a spell slot is expended, if appropriate) but it automatically misses and has no effect."}],"legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Innate Spellcasting","desc":"the ratatosk's spellcasting attribute is Charisma (save DC 14). It can innately cast the following spells without requiring material or somatic components:\n\nat will: animal messenger, message, vicious mockery\n\n1/day each: commune, mirror image\n\n3/day each: sending, suggestion"},{"name":"Skitter","desc":"The ratatosk can take the Dash, Disengage, or Hide action as a bonus action on each of its turns."}],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"ratatosk","type":"celestial"}