{"name":"Ravenala","size":"Large","subtype":"","group":null,"alignment":"unaligned","armor_class":15,"armor_desc":"natural armor","hit_points":126,"hit_dice":"12d10 + 60","speed":{"walk":30},"strength":20,"dexterity":10,"constitution":20,"intelligence":12,"wisdom":16,"charisma":12,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":6,"charisma_save":6,"perception":null,"skills":{},"damage_vulnerabilities":"","damage_resistances":"bludgeoning, piercing","damage_immunities":"","condition_immunities":"blinded, deafened","senses":"passive Perception $1","languages":"Common, Druidic, Elvish, Sylvan","challenge_rating":"5","actions":[{"name":"Multiattack","desc":"The ravenala makes two slam attacks or two bursting pod attacks."},{"name":"Slam","desc":"Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 12 (2d6 + 5) bludgeoning damage.","attack_bonus":8,"damage_dice":"2d6+5"},{"name":"Bursting Pod","desc":"Melee Ranged Attack: +8 to hit, range 30/120 ft., one target. Hit: 8 (1d6 + 5) bludgeoning damage, and the target and all creatures within 5 feet of it also take 5 (2d4) piercing damage, or half as much piercing damage with a successful DC 15 Dexterity saving throw.","attack_bonus":8,"damage_dice":"1d6"},{"name":"Lamenting Engulfment","desc":"The ravenala targets a creature within 5 feet of it. The target must succeed on a DC 13 Dexterity saving throw or be grappled and restrained by the ravenala. While restrained, the creature is engulfed inside the ravenala's trunk. The ravenala can grapple one creature at a time; grappling doesn't prevent it from using other attacks against different targets. The restrained creature must make a DC 14 Wisdom saving throw at the start of each of its turns. On a failure, the creature is compelled to sing a lament of all its various mistakes and misdeeds for as long as it remains restrained. Singing prevents uttering command words, casting spells with a verbal component, or any verbal communication. The restrained creature can still make melee attacks. When the ravenala moves, the restrained creature moves with it. A restrained creature can escape by using an action to make a DC 15 Strength check. On a success, the creature escapes and enters a space of its choice within 5 feet of the ravenala."}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Magic Resistance","desc":"The ravenala has advantage on saving throws against spells and other magical effects."},{"name":"Innate Spellcasting","desc":"the ravenala's innate spellcasting ability is Wisdom (spell save DC 14). It can innately cast the following spells, requiring no material components:\n\nat will: entangle, sleep\n\n1/day each: heal, wall of thorns"},{"name":"Green Walk","desc":"The ravenala can move across undergrowth, natural or magical, without needing to make an ability check and without expending additional movement."}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"ravenala","type":"plant"}