{"name":"Razorleaf","size":"Medium","subtype":"","group":null,"alignment":"neutral evil","armor_class":14,"armor_desc":"natural armor","hit_points":112,"hit_dice":"15d8+45","speed":{"walk":30},"strength":14,"dexterity":12,"constitution":16,"intelligence":7,"wisdom":12,"charisma":10,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":4,"skills":{"perception":4},"damage_vulnerabilities":"fire","damage_resistances":"cold, necrotic","damage_immunities":"","condition_immunities":"blinded, deafened, exhaustion","senses":"blindsight 60 ft. (blind beyond this radius), passive Perception 14","languages":"—","challenge_rating":"5","actions":[{"desc":"The razorleaf makes two lacerating leaves attacks.","name":"Multiattack"},{"attack_bonus":5,"damage_dice":"3d6+2","desc":"Melee Weapon Attack: +5 to hit, reach 10 ft., one target. Hit: 12 (3d6 + 2) slashing damage.","name":"Lacerating Leaves"},{"desc":"The razorleaf shakes loose a deadly shower of slicing leaves. Each creature within 10 feet of the razorleaf must make a DC 14 Dexterity saving throw, taking 21 (6d6) slashing damage on a failed save, or half as much damage on a successful one.","name":"Shower of Razors (Recharge 5-6)"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"As an action, the razorleaf can dig its roots into the ground, securing itself in place and causing the area in a 20-foot radius around it to be shrouded in shadow. While rooted in this way, the razorleaf’s speed becomes 0, it can’t be knocked prone, and its attacks deal an extra 3 (1d6) necrotic damage. This area is difficult terrain and nonmagical sources of light are only half as effective while within it. Small and smaller beasts with Intelligence 3 or lower in the area lose their natural coloration and turn pale grey. These creatures are charmed by the razorleaf while within the area. Plants and trees inside the area turn an ashen color. The razorleaf can recall its roots and end this effect as a bonus action.","name":"Dark Ground"},{"desc":"A creature that touches the razorleaf or hits it with a melee attack while within 5 feet of it takes 3 (1d6) slashing damage.","name":"Do Not Touch"},{"desc":"While in bright light, the razorleaf has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight.","name":"Light Sensitivity"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"razorleaf","type":"plant"}