{"name":"River King","size":"Medium","subtype":"","group":null,"alignment":"chaotic neutral","armor_class":18,"armor_desc":"natural armor","hit_points":152,"hit_dice":"16d8 + 80","speed":{"walk":30,"swim":40},"strength":21,"dexterity":17,"constitution":20,"intelligence":14,"wisdom":13,"charisma":17,"strength_save":null,"dexterity_save":8,"constitution_save":10,"intelligence_save":null,"wisdom_save":6,"charisma_save":null,"perception":6,"skills":{"intimidation":8,"nature":7,"perception":6,"stealth":8},"damage_vulnerabilities":"","damage_resistances":"fire, cold, thunder; bludgeoning, piercing, and slashing damage from weapons that aren't cold iron","damage_immunities":"lightning","condition_immunities":"exhaustion","senses":"blindsight 10 ft., darkvision 60 ft., passive Perception 16","languages":"Common, Elemental, Elvish, Giant","challenge_rating":"16","actions":[{"name":"Multiattack","desc":"The River King makes three attacks with his longsword and/or flood blast, in any combination."},{"name":"Longsword","desc":"Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 9 (1d8 + 5) slashing damage or 10 (1d10 + 5) slashing damage if used with two hands, plus 10 (3d6) lightning damage.","attack_bonus":10,"damage_dice":"1d8"},{"name":"Flood Blast","desc":"Ranged Spell Attack: +8 to hit, range 120 ft., one target. Hit: 18 (4d8) bludgeoning damage. A target creature must succeed on a DC 16 Strength saving throw or be knocked prone and pushed up to 60 feet at the River King's choosing.","attack_bonus":8,"damage_dice":"4d8"},{"name":"Grasping Whirlpool (Recharge 5-6)","desc":"The River King magically creates a swirling vortex of water centered on a point he can see within 60 feet. The vortex fills a cylinder with a 10-foot radius and 15 feet high. Creatures in the area must make a successful DC 16 Strength saving throw or take 11 (2d10) bludgeoning damage and be restrained and unable to breathe. On a successful save, the creature is pushed to the edge of the area. A restrained creature can escape from the whirlpool by using an action to make a successful DC 16 Strength check. A creature that's in the whirlpool at the end of its turn takes 11 (2d10) bludgeoning damage in addition to any effects from being unable to breathe. Creatures with a swim speed have advantage on the saving throw and the Strength check to escape. The whirlpool lasts for 1 minute or until the River King uses this ability again."}],"reactions":[{"name":"Blade Current","desc":"When a creature within the River King's melee reach stands up from prone, the River King can make a longsword attack on that creature with advantage."}],"legendary_desc":"The River King can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The River King regains spent legendary actions at the start of his turn.","legendary_actions":[{"name":"Longsword","desc":"The River King makes a longsword attack."},{"name":"Flow","desc":"The River King moves half his speed without provoking opportunity attacks."},{"name":"Ripple (2 Actions)","desc":"The River King magically ripples like sunlight on the surface of water. Until the start of his next turn, all attacks against him have disadvantage."}],"special_abilities":[{"name":"Amphibious","desc":"The River King can breathe air and water."},{"name":"Innate Spellcasting","desc":"the River King's innate spellcasting ability score is Charisma (save DC 16, +8 to hit with spell attacks). The River King can innately cast the following spells, requiring no material components.\n\nat will: create or destroy water, shocking grasp, water breathing\n\n3/day each: freedom of movement, control water\n\n1/day: chain lightning"},{"name":"Legendary Resistance (3/day)","desc":"If the River King fails a saving throw, he can choose to succeed instead."},{"name":"Magic Weapons","desc":"The River King's weapon attacks are magical and do an extra 10 (3d6) lightning damage (included below)."},{"name":"The River King's Lair","desc":"on initiative count 20 (losing initiative ties), the River King takes a lair action to cause one of the following effects; the River King can’t use the same effect two rounds in a row:\n\n- The fey river swells and rushes over the land, or the walls of the Hall buckle and allow the torrent in. The River King chooses a 10-foot-wide path up to 60 feet long. Each creature in the path of the water must make a DC 15 Strength saving throw. Creatures that fail the save are swept 20 feet down the path of the water and take 9 (2d8) bludgeoning damage.\n\n- The River King targets a creature he can see within 60 feet. That creature’s mouth and throat fill with river water. The creature must make a DC 15 Constitution saving throw. On a success, the creature manages to hold its breath, but on a failure, it begins to suffocate. A suffocating but conscious creature repeats the saving throw at the end of its turn, ending the effect on itself on a success. Another creature within 5 feet can use an action to make a DC 15 Wisdom (Medicine) check. On a success, the suffocating creature coughs up the water and the effect ends. Otherwise the effect lasts until the River King uses this action again or dies.\n\n- The River King targets a creature he can see within 120 feet. His commanding presence overwhelms the creature, who must make a DC 15 Charisma saving throw. On a failure, the creature is charmed by the River King until initiative count 20 on the following round."},{"name":"Regional Effects","desc":"the region containing the River King’s lair is warped by its magic, which creates one or more of the following effects:\n\n- The current of rivers and streams within 6 miles of the lair becomes strong and erratic. Creatures without a swim speed who start their turns in running water must succeed on a DC 15 Strength (Athletics) check or be swept 60 feet downriver.\n\n- Lakes, ponds, rivers, and streams within 6 miles of the lair teem with fish and other wildlife.\n\n- Rain and thunderstorms are common within 6 miles of the lair, and often build to torrential downpours that create heavy obscurement and cause waterways to overflow their banks.\n\nif the River King dies, conditions in the area surrounding the lair return to normal over the course of 1d10 days."}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"river-king","type":"fey"}