{"name":"Sand Silhouette","size":"Medium","subtype":"","group":null,"alignment":"neutral evil","armor_class":15,"armor_desc":"natural armor","hit_points":105,"hit_dice":"14d8 + 42","speed":{"walk":30,"burrow":30},"strength":18,"dexterity":12,"constitution":17,"intelligence":7,"wisdom":12,"charisma":10,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":null,"skills":{},"damage_vulnerabilities":"","damage_resistances":"bludgeoning, piercing, and slashing from nonmagical weapons","damage_immunities":"necrotic, poison","condition_immunities":"charmed, exhaustion, grappled, frightened, paralyzed, petrified, poisoned, prone, restrained, unconscious","senses":"darkvision 60 ft., tremorsense 60 ft., passive Perception 11","languages":"all languages it knew in life","challenge_rating":"6","actions":[{"name":"Multiattack","desc":"The sand silhouette makes two slam attacks."},{"name":"Slam","desc":"Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 14 (3d6 + 4) bludgeoning damage. If both attacks hit a Medium or smaller target, the target is grappled (escape DC 14), and the sand silhouette engulfs it.","attack_bonus":7,"damage_dice":"3d6"},{"name":"Engulf","desc":"The sand silhouette engulfs a Medium or smaller creature grappled by it. The engulfed target is blinded and restrained, but no longer grappled. It must make a successful DC 15 Constitution saving throw at the start of each of the sand silhouette's turns or take 14 (3d6 + 4) bludgeoning damage. If the sand silhouette moves, the engulfed target moves with it. The sand silhouette can only engulf one creature at a time."},{"name":"Haunted Haboob (Recharge 4-6)","desc":"The sand silhouette turns into a 60-foot radius roiling cloud of dust and sand filled with frightening shapes. A creature that starts its turn inside the cloud must choose whether to close its eyes and be blinded until the start of its next turn, or keep its eyes open and make a DC 15 Wisdom saving throw. If the saving throw fails, the creature is frightened for 1 minute. A frightened creature repeats the Wisdom saving throw at the end of each of its turns, ending the effect on itself on a success."}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Camouflage","desc":"While in desert environments, the sand silhouette can use the Hide action even while under direct observation."},{"name":"Sand Form","desc":"The sand silhouette can move through a space as narrow as 1 inch wide without squeezing."},{"name":"Sand Glide","desc":"The sand silhouette can burrow through nonmagical, loose sand without disturbing the material it is moving through. It is invisible while burrowing this way."},{"name":"Vulnerability to Water","desc":"For every 5 feet the sand silhouette moves while touching water, or for every gallon of water splashed on it, it takes 2 (1d4) cold damage. If the sand silhouette is completely immersed in water, it takes 10 (4d4) cold damage."}],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"sand-silhouette","type":"undead"}