{"name":"Sap Demon","size":"Small","subtype":"","group":null,"alignment":"chaotic evil","armor_class":13,"armor_desc":"natural","hit_points":67,"hit_dice":"15d6 + 15","speed":{"walk":20,"climb":20},"strength":14,"dexterity":6,"constitution":12,"intelligence":10,"wisdom":14,"charisma":10,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":null,"skills":{},"damage_vulnerabilities":"","damage_resistances":"piercing and slashing from nonmagical weapons","damage_immunities":"bludgeoning; acid, lightning","condition_immunities":"blinded, charmed, deafened, exhaustion, frightened, prone","senses":"blindsight 90 ft. (blind beyond this radius), passive Perception 12","languages":"none in its natural form; knows the same languages as a creature it dominates","challenge_rating":"4","actions":[{"name":"Multiattack","desc":"The sap demon makes two slam attacks."},{"name":"Slam","desc":"Melee Weapon Attack: +4 to hit, reach 5 ft., one target. Hit: 11 (2d8 + 2) bludgeoning damage. If both attacks hit a Medium or smaller target, the target is grappled (escape DC 12), and the sap demon uses Soul Sap on it as a bonus action.","attack_bonus":4,"damage_dice":"2d8"},{"name":"Soul Sap","desc":"The sap demon slides down the throat of a sleeping, helpless, or grappled living creature of Medium size or smaller. Once inside, the sap demon takes control of its host, as per the dominate monster spell (Wisdom DC 12 negates). While dominated, the host gains blindsight 90 feet. The host drips blood from its ears, nose, eyes, or from a wound that resembles the injury done to the sap demon's tree (1 damage/ hour). Damage inflicted on the host has no effect on the sap demon. If the host dies or is reduced to 0 hit points, the sap demon must leave the body within one hour."}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Amorphous","desc":"The sap demon can move through a space as narrow as 1 inch wide without squeezing."},{"name":"Season's Change","desc":"If a sap demon (or its host) takes at least 10 fire damage, it also gains the effect of a haste spell until the end of its next turn. If it takes at least 10 cold damage, it gains the effect of a slow spell until the end of its next turn."}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"sap-demon","type":"ooze"}