{"name":"Sarcophagus Slime","size":"Medium","subtype":"","group":null,"alignment":"neutral evil","armor_class":11,"armor_desc":"","hit_points":105,"hit_dice":"14d8 + 42","speed":{"walk":20},"strength":14,"dexterity":12,"constitution":18,"intelligence":3,"wisdom":12,"charisma":12,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":4,"charisma_save":4,"perception":null,"skills":{"stealth":4},"damage_vulnerabilities":"","damage_resistances":"acid, necrotic","damage_immunities":"poison","condition_immunities":"blinded, charmed, deafened, exhaustion, frightened, poisoned, prone","senses":"blindsight 60 ft. (blind beyond this radius), passive Perception 11","languages":"understands the languages of its creator but can't speak","challenge_rating":"5","actions":[{"name":"Multiattack","desc":"The sarcophagus slime uses its Frightful Presence, uses its Corrupting Gaze, and makes two slam attacks."},{"name":"Slam","desc":"Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 9 (2d6 + 2) bludgeoning damage plus 14 (4d6) acid damage.","attack_bonus":5,"damage_dice":"2d6"},{"name":"Frightful Presence","desc":"Each creature of the sarcophagus slime's choice that is within 60 feet of the sarcophagus slime and aware of it must succeed on a DC 15 Wisdom saving throw or become frightened for 1 minute. A frightened creature repeats the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the sarcophagus slime's Frightful Presence for the next 24 hours."},{"name":"Corrupting Gaze","desc":"The sarcophagus slime targets one creature it can see within 30 feet of it. If the target can see the sarcophagus slime, the target must succeed on a DC 15 Constitution saving throw or take 14 (4d6) necrotic damage and its hit point maximum is reduced by an amount equal to the necrotic damage taken. If this effect reduces a creature's hit point maximum to 0, the creature dies and its corpse becomes a sarcophagus slime within 24 hours. This reduction lasts until the creature finishes a long rest or until it is affected by greater restoration or comparable magic."}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Amorphous","desc":"The sarcophagus slime can move through a space as narrow as 1 inch wide without squeezing."}],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"sarcophagus-slime","type":"undead"}