{"name":"Sathaq Worm","size":"Huge","subtype":"","group":null,"alignment":"neutral evil","armor_class":16,"armor_desc":"natural armor","hit_points":172,"hit_dice":"15d12 + 75","speed":{"walk":20,"burrow":20,"swim":20},"strength":22,"dexterity":6,"constitution":20,"intelligence":5,"wisdom":12,"charisma":9,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":5,"skills":{"perception":5,"stealth":2},"damage_vulnerabilities":"","damage_resistances":"fire; bludgeoning, piercing, and slashing from nonmagical weapons","damage_immunities":"acid, poison","condition_immunities":"exhaustion, paralyzed, petrified, poisoned, unconscious","senses":"tremorsense 60 ft., passive Perception 15","languages":"understands Deep Speech and Terran, but can't speak","challenge_rating":"10","actions":[{"name":"Bite","desc":"Melee Weapon Attack: +10 to hit, reach 10 ft., one target. Hit: 24 (4d8 + 6) piercing damage. If the target is a Large or smaller creature, it must succeed on a DC 18 Dexterity saving throw or be swallowed by the sathaq worm. A swallowed creature is blinded and restrained, has total cover against attacks and other effects outside the worm, and takes 7 (2d6) bludgeoning damage plus 7 (2d6) slashing damage plus 7 (2d6) acid damage at the start of each of the sathaq worm's turns. The sathaq worm can have only one creature swallowed at a time. If the sathaq worm takes 20 damage or more on a single turn from a creature inside it, the sathaq worm must succeed on a DC 15 Constitution saving throw at the end of that turn or regurgitate the swallowed creature, which falls prone in a space within 5 feet of the sathaq worm. If the sathaq worm dies, a swallowed creature is no longer restrained by it and can escape from the corpse by using 10 feet of movement, exiting prone.","attack_bonus":10,"damage_dice":"4d8"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Agonizing Aura","desc":"The sathaq worms' presence induces pain in creatures native to the Material Plane. Any creature that starts its turn within 30 feet of the sathaq worm must make a DC 17 Fortitude saving throw. On a failed save, the creature is poisoned until the start of its next turn. If a creature's saving throw succeeds, it is immune to the sathaq worm's Agonizing Aura for the next 24 hours."},{"name":"Earth Glide","desc":"The sathaq worm can burrow through nonmagical, unworked earth and stone. While doing so, the elemental doesn't disturb the material it moves through."},{"name":"Siege Monster","desc":"The sathaq worm deals double damage to objects and structures."},{"name":"Earthen Camoflage","desc":"The sathaq worm's stealth bonus is increased to +6 in sand, mud, or dirt."}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"sathaq-worm","type":"elemental"}