{"name":"Shabti","size":"Medium","subtype":"","group":null,"alignment":"unaligned","armor_class":17,"armor_desc":"natural armor","hit_points":102,"hit_dice":"12d8 + 48","speed":{"walk":40},"strength":14,"dexterity":20,"constitution":18,"intelligence":6,"wisdom":11,"charisma":6,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":null,"skills":{},"damage_vulnerabilities":"","damage_resistances":"","damage_immunities":"poison, psychic; bludgeoning, piercing, and slashing from nonmagical weapons that aren't adamantine","condition_immunities":"charmed, exhaustion, frightened, paralyzed, petrified, poisoned","senses":"darkvision 60 ft., passive Perception 10","languages":"understands the languages of its creator but can't speak","challenge_rating":"8","actions":[{"name":"Multiattack","desc":"The shabti uses Telekinesis and makes two attacks with its nabboot."},{"name":"Nabboot","desc":"Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 7 (1d4 + 5) bludgeoning damage plus 7 (2d6) necrotic damage. If the target is a creature, it must succeed on a DC 15 Constitution saving throw or be cursed with tomb taint. The cursed target's speed is reduced to half, and its hit point maximum decreases by 3 (1d6) for every 24 hours that elapse. If the curse reduces the target's hit point maximum to 0, the target dies and its body turns to dust. The curse lasts until removed by the remove curse spell or comparable magic.","attack_bonus":8,"damage_dice":"1d4"},{"name":"Telekinesis","desc":"The shabti targets a creature within 60 feet. The target must succeed on a DC 15 Strength check or the shabti moves it up to 30 feet in any direction (including upward), and it is restrained until the end of the shabti's next turn."}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Immutable Form","desc":"The shabti is immune to spells and effects that would alter its form."},{"name":"Magic Resistance","desc":"The shabti has advantage on saving throws against spells and other magical effects."},{"name":"Magic Weapons","desc":"The shabti's weapon attacks are magical."},{"name":"Serpentine Armlets","desc":"As a bonus action, the shabti commands its armlets to drop to the floor, whereupon they become two giant poisonous snakes. The shabti can mentally direct the serpents (this does not require an action). If the snakes are killed, they dissolve into wisps of smoke which reform around the shabti's forearms, and they can't be turned into snakes for 1 week. These armlets are linked to the shabti at the time of its creation and do not function for other creatures."}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"shabti","type":"construct"}