{"name":"Shard Swarm","size":"Medium","subtype":"","group":null,"alignment":"unaligned","armor_class":13,"armor_desc":"natural armor","hit_points":22,"hit_dice":"5d8","speed":{"fly":30,"walk":0},"strength":3,"dexterity":13,"constitution":11,"intelligence":1,"wisdom":5,"charisma":1,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":null,"skills":{},"damage_vulnerabilities":"","damage_resistances":"bludgeoning, piercing, slashing","damage_immunities":"poison, psychic","condition_immunities":"blinded, charmed, deafened, exhaustion, frightened, paralyzed, petrified, poisoned, prone","senses":"blindsight 60 ft. (blind beyond this radius), passive Perception 7","languages":"—","challenge_rating":"1/2","actions":[{"attack_bonus":3,"damage_dice":"2d4","desc":"Melee Weapon Attack: +3 to hit, reach 0 ft., one creature in the swarm’s space. Hit: 5 (2d4) slashing damage or 2 (1d4) slashing damage if the swarm has half of its hp or less.","name":"Shards"},{"attack_bonus":3,"damage_dice":"1d6","desc":"Ranged Weapon Attack: +3 to hit, range 30 ft., one target. Hit: 3 (1d6) piercing damage. A piece of the swarm breaks off, falling into the target’s space.","name":"Shrapnel"},{"desc":"The shard swarm envelopes one Medium or smaller creature in its space. The target must succeed on a DC 13 Dexterity saving throw or be restrained inside the swarm for 1 minute. The target has disadvantage on this saving throw if the shard swarm used Come Together to form in the target’s space. While restrained, the target doesn’t take damage from the swarm’s Shards action, but it takes 5 (2d4) slashing damage if it takes an action that requires movement, such as attacking or casting a spell with somatic components. A creature within 5 feet of the swarm can take an action to pull a restrained creature out of the swarm. Doing so requires a successful DC 13 Strength check, and the creature making the attempt takes 5 (2d4) slashing damage.","name":"Contain (Recharge 5-6)"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"The swarm is incapacitated while in the area of an antimagic field. If targeted by the dispel magic spell, the swarm must succeed on a Constitution saving throw against the caster’s spell save DC or fall unconscious for 1 minute.","name":"Antimagic Susceptibility"},{"desc":"If the shard swarm has at least 1 hit point and all of its pieces are within 30 feet of each other, the pieces can re-form as a bonus action in any space containing at least one of its pieces.","name":"Come Together (3/Day)"},{"desc":"While the swarm remains motionless and isn’t flying, it is indistinguishable from a normal pile of junk.","name":"False Appearance"},{"desc":"The swarm can occupy another creature’s space and vice versa, and the swarm can move through any opening large enough for a pebble. The swarm can’t regain hp or gain temporary hp.","name":"Swarm"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"shard-swarm","type":"constructs"}