{"name":"Shoreline Scrapper","size":"Large","subtype":"","group":null,"alignment":"unaligned","armor_class":16,"armor_desc":"natural armor","hit_points":93,"hit_dice":"11d10+33","speed":{"swim":20,"walk":30},"strength":16,"dexterity":12,"constitution":16,"intelligence":3,"wisdom":11,"charisma":5,"strength_save":null,"dexterity_save":null,"constitution_save":5,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":null,"skills":{"survival":2},"damage_vulnerabilities":"","damage_resistances":"","damage_immunities":"","condition_immunities":"","senses":"darkvision 60 ft., passive Perception 10","languages":"—","challenge_rating":"4","actions":[{"desc":"The shoreline scrapper makes two claw attacks.","name":"Multiattack"},{"attack_bonus":5,"damage_dice":"2d10+3","desc":"Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 14 (2d10 + 3) slashing damage.","name":"Claw"},{"desc":"The shoreline scrapper causes a surge in the magnetic power of its shell. Each creature within 25 feet of the shoreline scrapper is subjected to its Magnetic Shell. On a failed save, a creature’s metal objects or the creature itself, if it is made of metal or wearing metal armor, are pulled up to 25 feet toward the shoreline scrapper and adhere to its shell. Creatures adhered to the shoreline scrapper’s shell are restrained.","name":"Magnetic Pulse (Recharge 5-6)"}],"reactions":[{"desc":"The shoreline scrapper adds 4 to its AC against one melee attack that would hit it as it withdraws into its shell. Until it emerges, it increases its AC by 4, has a speed of 0 ft., and can’t use its claws or magnetic pulse. The shoreline scrapper can emerge from its shell as a bonus action.","name":"Shell Protection"}],"legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"The shoreline scrapper can breathe air and water.","name":"Amphibious"},{"desc":"At the start of each of the shoreline scrapper’s turns, each creature within 5 feet of the scrapper must succeed on a DC 15 Strength saving throw or the metal items worn or carried by it stick to the scrapper’s shell. A creature that is made of metal or is wearing metal armor that fails the saving throw is stuck to the shell and restrained. If the item is a weapon and the wielder can’t or won’t let go of the weapon, the wielder is adhered to the shell and is restrained. A stuck item can’t be used. A creature can take its action to remove one creature or object from the shoreline scrapper’s shell by succeeding on a DC 15 Strength check. \n\nItems made of gold and silver are unaffected by the shoreline scrapper’s Magnetic Shell. When the shoreline scrapper dies, all metal creatures and objects are released.","name":"Magnetic Shell"},{"desc":"The shoreline scrapper can pinpoint, by scent, the location of metals within 60 feet of it.","name":"Metal Sense"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"shoreline-scrapper","type":"beast"}