{"name":"Sigilian","size":"Medium","subtype":"","group":null,"alignment":"unaligned","armor_class":14,"armor_desc":null,"hit_points":65,"hit_dice":"10d8+20","speed":{"fly":60,"walk":0},"strength":6,"dexterity":18,"constitution":14,"intelligence":5,"wisdom":10,"charisma":20,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":2,"skills":{"perception":2,"stealth":6},"damage_vulnerabilities":"psychic","damage_resistances":"bludgeoning, piercing and slashing from nonmagical attacks","damage_immunities":"poison","condition_immunities":"blinded, charmed, deafened, exhaustion, frightened, paralyzed, poisoned, unconscious","senses":"darkvision 60 ft., passive Perception 12","languages":"understands Common but can’t speak","challenge_rating":"2","actions":[{"desc":"The sigilian makes three attacks: one with its cut and two with its paste.","name":"Multiattack"},{"attack_bonus":6,"damage_dice":"1d6+4","desc":"Ranged Weapon Attack: +6 to hit, range 60 ft., one target. Hit: 7 (1d6 + 4) slashing damage and the sigilian copies one of the target’s weapon attacks for 1 minute.","name":"Cut"},{"desc":"Melee or Ranged Spell Attack: +7 to hit, reach 5 ft. or range 60 ft., one target. Hit: Damage die and type are determined by the copied weapon attack from Cut. Glowing runes in the image of that weapon appear as the sigilian attacks.","name":"Paste"},{"desc":"While inside a spellbook, the sigilian eats one spell of the highest level present then exits the spellbook. It chooses to either make its next Paste attack with a number of damage dice equal to the eaten spell’s level or regain 3 hp per spell level. The sigilian can only eat one spell at a time and must use the devoured spell’s energy before attempting to enter another spellbook. The eaten spell’s entry is garbled, but the owner can repair it for half the gold and time usually spent to copy a spell. If the owner has the spell prepared, it can re-record the spell during a long rest for no additional cost.","name":"Devour Spell"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"The sigilian can move through a space as narrow as 1 inch wide without squeezing.","name":"Amorphous"},{"desc":"At the start of each of its turns if the sigilian is inside a book that is not a spellbook, it removes the words from 3 (1d6) pages and regains 7 (2d6) hp.","name":"Cognivore"},{"desc":"The sigilian can move half its speed to enter a book. If the book is being worn or carried by a creature, that creature must succeed on a DC 14 Dexterity saving throw or the sigilian enters the book. A creature can take its action to find the sigilian in a book by succeeding on a DC 12 Intelligence (Investigation) check. If successful, a creature can use a bonus action to tear out the pages where the sigilian is hiding, forcing the sigilian out of the book and into an unoccupied space within 5 feet. Alternatively, a creature can destroy the book with a successful melee attack, dealing half of the damage to the sigilian and forcing it out of the book into an unoccupied space within 5 feet.","name":"Home Sweet Tome"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"sigilian","type":"construct"}