{"name":"Spawn Of Arbeyach","size":"Medium","subtype":"devil","group":null,"alignment":"lawful evil","armor_class":17,"armor_desc":"natural armor","hit_points":78,"hit_dice":"12d8 + 24","speed":{"walk":40,"climb":20},"strength":18,"dexterity":15,"constitution":15,"intelligence":10,"wisdom":13,"charisma":12,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":4,"charisma_save":null,"perception":4,"skills":{"perception":4,"stealth":5},"damage_vulnerabilities":"","damage_resistances":"","damage_immunities":"poison","condition_immunities":"poisoned","senses":"darkvision 60 ft., tremorsense 60 ft., passive Perception 14","languages":"Infernal","challenge_rating":"5","actions":[{"name":"Multiattack","desc":"A Spawn of Arbeyach makes one bite attack and two stinger attacks."},{"name":"Bite","desc":"Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) piercing damage plus 4 (1d8) poison damage.","attack_bonus":7,"damage_dice":"2d6"},{"name":"Stinger","desc":"Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 7 (1d6 + 4) piercing damage plus 9 (2d8) poison damage. If the target is a creature, it must succeed on a DC 13 Constitution saving throw or be poisoned for 1 minute. A poisoned creature repeats the saving throw at the end of each of its turns, ending the effect on itself on a success.","attack_bonus":7,"damage_dice":"1d6"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Hive Mind","desc":"Spawn of Arbeyach share a bond with other members of their hive that enhances their hive mates' perception. As long as a spawn is within 60 feet of at least one hive mate, it has advantage on initiative rolls and Wisdom (Perception) checks. If one spawn is aware of a particular danger, all others in the hive are, too. No spawn in a hive mind is surprised at the beginning of an encounter unless all of them are."},{"name":"Innate Spellcasting","desc":"The spawn of Arbeyach's spellcasting ability is Charisma. The Spawn of Arbeyach can innately cast the following spells, requiring no material components: 1/day: conjure animals (only swarms of insects) Scent Communication. Spawn of Arbeyach can communicate with each other and all swarms of insects within 60 feet via pheromone transmission. In a hive, this range extends to cover the entire hive. This is a silent and instantaneous mode of communication that only Arbeyach, spawn of Arbeyach, and swarms of insects can understand. As a bonus action, the spawn of Arbeyach can use this trait to control and give orders to one swarm of insects within 60 feet."}],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"spawn-of-arbeyach","type":"fiend"}