{"name":"Spawn of Chernobog","size":"Large","subtype":"","group":null,"alignment":"chaotic evil","armor_class":14,"armor_desc":"natural armor","hit_points":95,"hit_dice":"10d10+40","speed":{"walk":40},"strength":22,"dexterity":12,"constitution":18,"intelligence":10,"wisdom":12,"charisma":12,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":null,"skills":{"athletics":8,"stealth":3},"damage_vulnerabilities":"radiant","damage_resistances":"necrotic","damage_immunities":"","condition_immunities":"charmed, frightened","senses":"darkvision 60 ft., passive Perception 11","languages":"understands Common, Umbral, and Undercommon but can’t speak","challenge_rating":"4","actions":[{"desc":"The spawn of Chernobog makes two attacks: one with its bite and one with its claws.","name":"Multiattack"},{"attack_bonus":8,"damage_dice":"1d8+6","desc":"Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 10 (1d8 + 6) piercing damage, and the creature must succeed on a DC 14 Constitution saving throw or become infected with the night’s blood disease (see the Night’s Blood trait).","name":"Bite"},{"attack_bonus":8,"damage_dice":"2d6+6","desc":"Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) slashing damage.","name":"Claws"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"If a bite wound from the spawn of Chernobog results in an infection, the black oil that drips from the spawn’s jaws seeps into the wound and vanishes. After each long rest, the creature must make a DC 14 Constitution saving throw. On two successes, the disease is cured. On a failure, the disease progresses, forcing the creature to undergo a series of changes, in the following order.\n# The creature can’t speak, and its tongue turns black.\n# The creature’s eyes turn a deep red, and it gains darkvision 60 feet and the Sunlight Sensitivity trait. \n# The creature secretes black oil from its skin, and it has advantage on ability checks and saving throws made to escape a grapple.\n# The creature’s veins turn black, slowly working their way up through the body from the appendages over 24 hours. \n# When the blackened veins reach its head after the final long rest, the creature experiences excruciating, stabbing pains in its temples. At sunset, the creature dies as the antlers of an elk burst from its head. The oil secreting from the corpse pools and forms a spawn of Chernobog at midnight.","name":"Night’s Blood"},{"desc":"While in sunlight, the spawn of Chernobog has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight.","name":"Sunlight Sensitivity"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"spawn-of-chernobog","type":"fiend"}