{"name":"Spree","size":"Small","subtype":"demon","group":null,"alignment":"chaotic evil","armor_class":15,"armor_desc":"natural armor","hit_points":84,"hit_dice":"13d6+39","speed":{"walk":30},"strength":11,"dexterity":17,"constitution":16,"intelligence":10,"wisdom":8,"charisma":15,"strength_save":null,"dexterity_save":6,"constitution_save":null,"intelligence_save":null,"wisdom_save":2,"charisma_save":null,"perception":null,"skills":{},"damage_vulnerabilities":"","damage_resistances":"cold, fire, lightning; bludgeoning, piercing, and slashing from nonmagical attacks","damage_immunities":"poison","condition_immunities":"frightened, poisoned","senses":"darkvision 60 ft., passive Perception 9","languages":"Abyssal, Common, Gnomish","challenge_rating":"5","actions":[{"desc":"The spree demon makes two claw attacks. If both attacks hit the same target, the target must succeed on a DC 14 Wisdom saving throw or become frightened for 1 minute. While frightened this way, the creature believes it has shrunk to half its normal size. All attacks against the creature do an extra 7 (2d6) psychic damage, and the creature’s attacks do half damage. A frightened creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.","name":"Multiattack"},{"attack_bonus":6,"damage_dice":"1d6+3","desc":"Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) slashing damage plus 10 (3d6) poison damage, and the creature must make a DC 14 Constitution saving throw. On a failure, the target can’t take reactions and must roll a d10 at the start of each of its turns to determine its behavior for that turn for 1 minute. This works like the confusion spell. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a creature’s saving throw is successful or the effect ends for it, the creature is immune to this effect for the next 24 hours.","name":"Claw"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"The spree demon has advantage on attacks if it saw another spree demon make a successful attack within the last minute.","name":"Frothing Rage"},{"desc":"If a creature confused by the spree demon’s claw attack reduces a target to 0 hp, the confused creature must make a successful DC 14 Wisdom saving throw or gain a short-term madness (see the System Reference Document 5.1). If a creature fails this saving throw again while already suffering from a madness, it gains a long-term madness instead.","name":"Spree Madness"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"spree","type":"fiend"}