{"name":"Steam Golem","size":"Large","subtype":"","group":null,"alignment":"unaligned","armor_class":18,"armor_desc":"natural armor","hit_points":171,"hit_dice":"18d10 + 72","speed":{"walk":40},"strength":26,"dexterity":12,"constitution":18,"intelligence":3,"wisdom":10,"charisma":1,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":null,"skills":{},"damage_vulnerabilities":"","damage_resistances":"","damage_immunities":"fire, poison, psychic; bludgeoning, piercing, and slashing from nonmagical weapons that aren't adamantine","condition_immunities":"charmed, exhaustion, frightened, paralyzed, petrified, poisoned","senses":"darkvision 120 ft., passive Perception 10","languages":"understands its creator's languages but can't speak","challenge_rating":"13","actions":[{"name":"Multiattack","desc":"The steam golem makes two ax arm attacks, or one long axe attack."},{"name":"Ax Arm","desc":"Melee Weapon Attack: +13 to hit, reach 5 ft., one target. Hit: 22 (4d6 + 8) slashing damage.","attack_bonus":13,"damage_dice":"4d6"},{"name":"Long Axe","desc":"Melee Weapon Attack: +13 to hit, reach 10 ft., one target. Hit: 40 (5d12 + 8) slashing damage.","attack_bonus":13,"damage_dice":"5d12"},{"name":"Steam Blast (Recharge 5-6)","desc":"A steam golem can release a blast of steam. The golem chooses whether to affect a 5-foot radius around itself or a 20-foot cube adjacent to itself. Creatures in the affected area take 38 (7d10) fire damage, or half damage with a successful DC 17 Constitution saving throw."}],"reactions":[{"name":"Whistle","desc":"When an opponent within 30 feet of the golem tries to cast a spell, the steam golem can emit a shriek from its twin steam whistles. The spellcaster must make a DC 17 Constitution saving throw. If the save succeeds, the spell is cast normally. If it fails, the spell is not cast; the spell slot is not used, but the caster's action is."}],"legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Boiler Weakness","desc":"A steam golem that's immersed in water or whose boiler is soaked with at least 20 gallons of water (such as from a water elemental) may be stopped in its tracks by the loss of steam pressure in the boiler. In the case of a water elemental, dousing a steam golem destroys the elemental and the golem must make a DC 20 Constitution saving throw. If it succeeds, the water instantly evaporates and the golem continues functioning normally. If it fails, the golem's fire is extinguished and the boiler loses pressure. The steam golem acts as if affected by a slow spell for 1d3 rounds, then becomes paralyzed until its fire is relit and it spends 15 minutes building up pressure."},{"name":"Immutable Form","desc":"The golem is immune to any spell or effect that would alter its form."},{"name":"Extend Long Ax","desc":"A steam golem can extend or retract one arm into long ax form as a bonus action."},{"name":"Magic Resistance","desc":"The golem has advantage on saving throws against spells and other magical effects."},{"name":"Magic Weapons","desc":"The golem's weapon attacks are magical."}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"steam-golem","type":"construct"}