{"name":"Suppurating Ooze","size":"Medium","subtype":"","group":null,"alignment":"unaligned","armor_class":8,"armor_desc":null,"hit_points":30,"hit_dice":"4d8+12","speed":{"climb":10,"walk":10},"strength":16,"dexterity":6,"constitution":16,"intelligence":1,"wisdom":6,"charisma":2,"strength_save":null,"dexterity_save":null,"constitution_save":5,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":null,"skills":{},"damage_vulnerabilities":"","damage_resistances":"cold, necrotic, slashing","damage_immunities":"poison","condition_immunities":"blinded, charmed, deafened, exhaustion, frightened, poisoned, prone","senses":"blindsight 60 ft. (blind beyond this radius), passive Perception 8","languages":"—","challenge_rating":"1","actions":[{"attack_bonus":5,"damage_dice":"1d6+3","desc":"Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) bludgeoning damage plus 9 (2d8) necrotic damage. If the target is a creature, it must succeed on a DC 13 Constitution saving throw or become infected with the seeping death disease (see the Seeping Death trait).","name":"Pseudopod"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"The ooze can move through a space as narrow as 1 inch wide without squeezing.","name":"Amorphous"},{"desc":"A living creature that touches the ooze or hits it with a melee attack while within 5 feet of it takes 4 (1d8) necrotic damage and must succeed on a DC 13 Constitution saving throw or contract a disease. At the end of each long rest, the diseased creature must succeed on a DC 13 Constitution saving throw or its Dexterity score is reduced by 1d4. The reduction lasts until the target finishes a long rest after the disease is cured. If the disease reduces the creature’s Dexterity to 0, the creature dies and its body becomes a suppurating ooze 1d4 hours later. The disease lasts until removed by the lesser restoration spell or other similar magic.","name":"Seeping Death"},{"desc":"The ooze can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check.","name":"Spider Climb"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"suppurating-ooze","type":"ooze"}