{"name":"Tulpa","size":"Medium","subtype":"","group":null,"alignment":"neutral evil","armor_class":13,"armor_desc":null,"hit_points":39,"hit_dice":"6d8+12","speed":{"hover":true},"strength":14,"dexterity":16,"constitution":14,"intelligence":10,"wisdom":14,"charisma":9,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":null,"skills":{},"damage_vulnerabilities":"radiant","damage_resistances":"acid, fire, lightning, thunder; bludgeoning, piercing, and slashing from nonmagical attacks","damage_immunities":"cold, necrotic, poison","condition_immunities":"charmed, exhaustion, frightened, grappled, paralyzed, petrified, poisoned, prone, restrained","senses":"darkvision 60 ft., passive Perception 12","languages":"the languages spoken by its creator","challenge_rating":"4","actions":[{"desc":"The tulpa makes two black claw attacks.","name":"Multiattack"},{"attack_bonus":5,"damage_dice":"2d8+3","desc":"Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 12 (2d8 + 3) necrotic damage.","name":"Black Claw"},{"attack_bonus":4,"damage_dice":"4d10","desc":"Ranged Spell Attack: +4 to hit, range 120 ft., one target. Hit: 22 (4d10) psychic damage.","name":"Psychic Blast"},{"desc":"The tulpa uses its action to fill a 40-foot radius around itself with dread-inducing psychic energy. Each creature, other than the tulpa’s creator, within that area must succeed on a DC 13 Wisdom saving throw or be frightened of the tulpa until the end of its next turn and become cursed. A creature with an Intelligence of 5 or lower can’t be cursed. While cursed by the tulpa, that creature’s own thoughts turn ever more dark and brooding. Its sense of hope fades, and shadows seem overly large and ominous. The cursed creature can repeat the saving throw whenever it finishes a long rest, ending the effect on itself on a success. If not cured within three days, the cursed creature manifests its own tulpa.","name":"Imposing Dread (1/Day)"}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"desc":"The tulpa can move through other creatures and objects as if they were difficult terrain. It takes 5 (1d10) force damage if it ends its turn inside an object.","name":"Incorporeal Movement"},{"desc":"Within a day of being slain, the tulpa reforms within 500 feet of its creator. It doesn’t reform if its creator is slain, or if the creator’s mental disturbance is healed. The tulpa is immune to all damage dealt to it by its creator.","name":"Rise Again"},{"desc":"The tulpa always remains within 500 feet if its creator. As long as the tulpa is within 500 feet of its creator, the creator has disadvantage on Wisdom saving throws.","name":"It Follows"}],"spell_list":[],"img_main":null,"document__slug":"cc","document__title":"Creature Codex OGL","document__license_url":"http://open5e.com/legal","id":"tulpa","type":"undead"}