{"name":"Urochar (Strangling Watcher)","size":"Huge","subtype":"","group":null,"alignment":"chaotic evil","armor_class":19,"armor_desc":"natural armor","hit_points":256,"hit_dice":"19d12 + 133","speed":{"walk":40,"climb":20},"strength":24,"dexterity":15,"constitution":24,"intelligence":14,"wisdom":14,"charisma":20,"strength_save":null,"dexterity_save":8,"constitution_save":13,"intelligence_save":null,"wisdom_save":9,"charisma_save":11,"perception":8,"skills":{"perception":8,"stealth":8},"damage_vulnerabilities":"","damage_resistances":"cold, lightning; bludgeoning, piercing, and slashing from nonmagical weapons that aren't silvered","damage_immunities":"thunder","condition_immunities":"frightened","senses":"truesight 120 ft., passive Perception 19","languages":"understands Darakhul and Void Speech","challenge_rating":"17","actions":[{"name":"Multiattack","desc":"The watcher makes four attacks with its tentacles."},{"name":"Tentacle","desc":"Melee Weapon Attack: +13 to hit, reach 20 ft., one target. Hit: 20 (3d8 + 7) bludgeoning damage, and the target is grappled (escape DC 17). Until this grapple ends, the target is restrained. Each of its four tentacles can grapple one target.","attack_bonus":13,"damage_dice":"3d8"},{"name":"Paralyzing Gaze (Recharge 5-6)","desc":"The watcher can target one creature within 60 feet with its eerie gaze. The target must succeed on a DC 19 Wisdom saving throw or become paralyzed for 1 minute. The paralyzed target can repeat the saving throw at the end of each of its turns, ending the effect on a success. If a target's saving throw is successful or the effect ends for it, the target is immune to the watcher's gaze for the next 24 hours."}],"reactions":"","legendary_desc":"The urochar can take 3 legendary actions, choosing from the options below. Only one option can be used at a time and only at the end of another creature's turn. The strangling watcher regains spent legendary actions at the start of its turn.","legendary_actions":[{"name":"Crush Attack","desc":"The urochar crushes one creature grappled by its tentacle. The target takes 25 (4d8 + 7) bludgeoning damage."},{"name":"Tentacle Attack","desc":"The watcher makes one tentacle attack."},{"name":"Tentacle Leap (Costs 2 Actions)","desc":"Using a tentacle, the urochar moves up to 20 feet to an unoccupied space adjacent to a wall, ceiling, floor, or other solid surface. This move doesn't trigger reactions. The urochar must have at least one tentacle free (not grappling a creature) to use this action. Grappled creatures move with the urochar."}],"special_abilities":[{"name":"Death Throes","desc":"When a strangling watcher dies, it releases all the fear it consumed in its lifetime in a single, soul-rending wave. All creatures within 60 feet of it must succeed on a DC 19 Charisma saving throw or become frightened. A frightened creature takes 13 (2d12) psychic damage at the start of each of its turns from the centuries of accumulated dread. It can repeat the Charisma saving throw at the end of each of its turns, ending the effect on a success."},{"name":"Innate Spellcasting","desc":"the watcher's innate spellcasting ability is Charisma (spell save DC 19). It can cast the following spells, requiring no material components:\n\nat will: feather fall\n\n3/day each: blur, meld into stone, phantasmal killer\n\n1/day each: black tentacles, eyebite, greater invisibility"},{"name":"Spider Climb","desc":"The watcher can climb any surface, including upside down on ceilings, without making an ability check."},{"name":"Squeeze","desc":"Despite their size, strangling watchers have slender, boneless bodies, enabling them to squeeze through passages only a Small-sized creature could fit through, without affecting their movement or combat capabilities."}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"urochar-strangling-watcher","type":"aberration"}