{"name":"Vampire Warlock - Variant","size":"Medium","subtype":"shapechanger","group":null,"alignment":"lawful evil","armor_class":16,"armor_desc":"natural armor","hit_points":144,"hit_dice":"17d8 + 68","speed":{"walk":30},"strength":18,"dexterity":18,"constitution":18,"intelligence":17,"wisdom":15,"charisma":18,"strength_save":null,"dexterity_save":9,"constitution_save":null,"intelligence_save":null,"wisdom_save":7,"charisma_save":9,"perception":7,"skills":{"perception":7,"stealth":9},"damage_vulnerabilities":"","damage_resistances":"necrotic, bludgeoning, piercing, and slashing from nonmagical weapons","damage_immunities":"","condition_immunities":"","senses":"darkvision 120 ft., passive Perception 17","languages":"the languages it knew in life","challenge_rating":"13","actions":[{"name":"Bloody Arms","desc":"The vampire warlock saturates itself in its own blood, causing 20 poison damage to itself. For 1 minute, its armor class increases to 20 and its unarmed strike and bite attacks do an additional 7 (2d6) poison damage."},{"name":"Call the Blood","desc":"The vampire warlock targets one humanoid it can see within 60 feet. The target must be injured (has fewer than its normal maximum hit points). The target's blood is drawn out of the body and streams through the air to the vampire warlock. The target takes 25 (6d6 + 4) necrotic damage and its hit point maximum is reduced by an equal amount until the target finishes a long rest; a successful DC 17 Constitution saving throw prevents both effects. The vampire warlock regains hit points equal to half the damage dealt. The target dies if this effect reduces its hit point maximum to 0."},{"name":"Blood Puppet","desc":"The vampire warlock targets one humanoid it can see within 30 feet. The target must succeed on a DC 17 Wisdom saving throw or be dominated by the vampire warlock as if it were the target of a dominate person spell. The target repeats the saving throw each time the vampire warlock or the vampire's companions do anything harmful to it, ending the effect on itself on a success. Otherwise, the effect lasts 24 hours or until the vampire warlock is destroyed, is on a different plane of existence than the target, or uses a bonus action to end the effect; the vampire warlock doesn't need to concentrate on maintaining the effect."},{"name":"Children of Hell (1/Day)","desc":"The vampire warlock magically calls 2d4 imps or 1 shadow. The called creatures arrive in 1d4 rounds, acting as allies of the vampire warlock and obeying its spoken commands, and remain for 1 hour, until the vampire warlock dies, or until the vampire warlock dismisses them as a bonus action."}],"reactions":"","legendary_desc":"Misty Step. The vampire warlock uses misty step.","legendary_actions":[{"name":"Unarmed Strike","desc":"The vampire warlock makes one unarmed strike."},{"name":"Call the Blood (Costs 2 Actions).","desc":"The vampire warlock uses call the blood."}],"special_abilities":[{"name":"Innate Spellcasting","desc":"the vampire's spellcasting ability is Charisma (spell save DC 17). It can innately cast the following spells, requiring no material components.\n\nat will: darkness, dominate person, invisibility, misty step\n\n1/day each: arms of hadar, disguise self, dissonant whispers, detect thoughts, hold monster"}],"spell_list":[],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"vampire-warlock-variant","type":"undead"}