{"name":"Vine Lord","size":"Medium","subtype":"","group":null,"alignment":"lawful neutral","armor_class":16,"armor_desc":"natural armor","hit_points":105,"hit_dice":"14d8 + 42","speed":{"walk":30},"strength":12,"dexterity":20,"constitution":16,"intelligence":14,"wisdom":16,"charisma":18,"strength_save":null,"dexterity_save":null,"constitution_save":6,"intelligence_save":null,"wisdom_save":6,"charisma_save":7,"perception":null,"skills":{},"damage_vulnerabilities":"","damage_resistances":"","damage_immunities":"","condition_immunities":"blinded, deafened","senses":"blindsight 30 ft. (blind beyond this radius), passive Perception 13","languages":"Common","challenge_rating":"7","actions":[{"name":"Multiattack","desc":"The vine lord makes two claw attacks and four tendril attacks. A single creature can't be the target of more than one tendril attack per turn."},{"name":"Claw","desc":"Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 8 (1d6 + 5) slashing damage.","attack_bonus":8,"damage_dice":"1d6"},{"name":"Spore Sacs (1/week)","desc":"The vine lord can release seeds from specialized sacs on its tendrils. These seeds sprout into 1d4 green spore pods that reach maturity in 3 days. The pods contain noxious spores that are released when the pod is stepped on, picked, or otherwise tampered with. A humanoid or beast that inhales these spores must succeed on a DC 14 Constitution saving throw against disease or tendrils start growing inside the creature's body. If the disease is not cured within 3 months, the tendrils take over the creature's nervous system and the victim becomes a tendril puppet."},{"name":"Tendril","desc":"Melee Weapon Attack: +8 to hit, reach 10 ft., one target. Hit: 7 (1d4 + 5) slashing damage plus 3 (1d6) poison damage.","attack_bonus":8,"damage_dice":"1d4"},{"name":"Awaken the Green (1/Day)","desc":"The vine lord magically animates one or two trees it can see within 60 feet of it. These trees have the same statistics as a treant, except they have Intelligence and Charisma scores of 1, they can't speak, and they have only the Slam action option. An animated tree acts as an ally of the vine lord. The tree remains animate for 1 day or until it dies; until the vine lord dies or is more than 120 feet from the tree; or until the vine lord takes a bonus action to turn it back into an inanimate tree. The tree then takes root if possible."}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Green Strider","desc":"The vine lord ignores movement restrictions and damage caused by natural undergrowth."},{"name":"Magic Resistance","desc":"The vine lord has advantage on saving throws against spells and other magical effects."},{"name":"Regeneration","desc":"The vine lord regains 10 hit points at the start of its turn if it has at least 1 hit point and is within its home forest or jungle."},{"name":"Root Mind","desc":"Within its home forest or jungle, the vine lord's blindsight extends to 60 ft., it succeeds on all Wisdom (Perception) checks, and it can't be surprised."}],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"vine-lord","type":"plant"}