{"name":"White Ape","size":"Large","subtype":"","group":null,"alignment":"neutral","armor_class":14,"armor_desc":"natural armor","hit_points":114,"hit_dice":"12d10 + 48","speed":{"walk":40,"climb":40},"strength":18,"dexterity":16,"constitution":18,"intelligence":8,"wisdom":14,"charisma":8,"strength_save":null,"dexterity_save":null,"constitution_save":null,"intelligence_save":null,"wisdom_save":null,"charisma_save":null,"perception":5,"skills":{"acrobatics":6,"athletics":7,"intimidation":2,"perception":5,"stealth":6},"damage_vulnerabilities":"","damage_resistances":"","damage_immunities":"","condition_immunities":"","senses":"darkvision 60 ft., passive Perception 15","languages":"Common","challenge_rating":"6","actions":[{"name":"Multiattack","desc":"The ape makes one bite attack and two claw attacks."},{"name":"Bite","desc":"Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) piercing damage, and the target must succeed on a DC 14 Constitution saving throw or contract the arcane wasting disease (see sidebar).","attack_bonus":7,"damage_dice":"2d8"},{"name":"Claw","desc":"Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 15 (2d10 + 4) slashing damage.","attack_bonus":7,"damage_dice":"2d10+4"},{"name":"Frenzy (1/Day)","desc":"When two or more foes are adjacent to the ape, it can enter a deadly battle frenzy. Instead of using its normal multiattack, a frenzied white ape makes one bite attack and two claw attacks against each enemy within 5 feet of it. Melee attacks against the white ape are made with advantage from the end of that turn until the start of the white ape's next turn."}],"reactions":"","legendary_desc":"","legendary_actions":"","special_abilities":[{"name":"Hatred for Spellcasters","desc":"The white ape does one extra die of damage (d8 or d10, respectively) per attack against an enemy it has seen cast a spell."},{"name":"Arcane Wasting (Disease)","desc":"When the bodily fluid of an infected creature touches a humanoid or when an infected creature casts a spell (direct or indirect) on a humanoid, that humanoid must succeed on a DC 15 Constitution saving throw or become infected with arcane wasting. Beginning 1d6 days after infection, the infected creature must make a DC 15 Constitution saving throw at the end of each long rest. If the saving throw fails, the victim loses 1d3 Intelligence and 1d3 Wisdom. Lost Intelligence and Wisdom can't be recovered while the disease persists. If the saving throw succeeds, nothing happens; the disease ends after the second consecutive successful saving throws. Once the disease ends, lost Intelligence and Wisdom can be restored by greaterrestoration or comparable magic. The disease is also cured by lesser restoration if the caster makes a successful DC 15 spellcasting check."}],"img_main":null,"document__slug":"tob","document__title":"Tome of Beasts OGL","document__license_url":"http://open5e.com/legal","id":"white-ape","type":"monstrosity"}